label story:
    stop music fadeout 1.0
    window hide dissolve
    pause 2.0

    show screen end1 with fade
    pause 5.0
    hide screen end1
    pause 2.0
    screen end1:
        text "19 грудня" yalign 0.5 xalign 0.5
    scene bg grocery 
    with dissolve_scene_full
    play music clubs
    "Хм, повільний день."
    "Повільні дні в цілодобовому магазині – відстій.."
    "Особливо в якості менеджера."
    "Я просто сиджу і займаюся паперовою роботою."
    "Є звісно деякі роспорядження."
    "Но у мене є цілий тиждень, щоб виконати їх."
    "Якби я зробив їх зараз, то потім мені було б нудно."
    "Проблеми первого світу, скажу я вам."
    mc "Відстій."
    #show Sayori
    show sayori work happ cm oe at t11
    s om "Та годі тобі, могло бути і гірше."
    s "До кінця дня не більше двох годин."
    mc "Легко казати тій, хто стоїть і нічого не робить."
    s neut "Неправда."
    mc "Я працюю з тобою, можу підтвердити це."
    s happ "Можливо, якби ти працював більше, то не помітив би, що я не працюю."
    mc "Я менеджер, моя робота - стежитись за тим, щоб ти виконувала свою роботу."
    mc "Що зачасту ти не робиш."
    s pout md "Хмф."
    s om "Злюка."
    mc "Продовжиш дутись, поставлю на нічну зміну."
    s nerv ce om "Беру свої слова назад."
    mc "Так і думав."
    show sayori neut oe
    mc "Так чим ти зайнята вечером?"
    s happ "Вечеря, справи з котом і перегляд телевізора."
    mc "Не зрозумів про тему з котом."
    s angr "Коти теж вміють гуляти!"
    mc "Це дивно!"
    s "Ти дивний!"
    mc "Моливо і так, но це не робить вигул кота не дивним."
    mc "У Містера Міттенса немає права голосу."
    s happ "А що до тебе?"
    s "Є веселі плани на вечір?"
    mc "Ні, просто тихий вечір з сім'єю."
    s "Те, що вона тиха, не означає, що вона не може бути веселою."
    mc "Я сказав тиха, до речі, у мене шестирічна дитина."
    mc "Таке рідко буває тихим."
    s ce "Вона прекрасна."
    mc "Вона така, просто трохи менше, коли я втомлююсь."
    s oe "Я впевнена, що не все так погано."
    mc "Я б не сказав, що це погано."
    mc "Іноді не просто відставати."
    s "Воно того варте."
    mc "Так, ти права."
    s nerv "......Ти ж не залишиш мене на нічну зміну, правда?"
    mc "Звісно ж ні."
    mc "Особливо після останнього разу."
    "Її налякав єнот і вона закрила двері, а потім всю ніч ховалась в моєму кабінеті."
    "Так, ніколи більше." #have Sayori look away embarassed in the background
    #fade out, fade in
    scene bg grocery 
    with fadehold
    "Добре, майже на місці."
    "Залишилось дочекатись, поки тіп на нічній зміні прийде сюди."
    "Котрий є болем в сраці, бо приходить завжди в останню хвилину."
    "Він ніби чекає на дворі."
    "Один із тих хлопців що «Мені не платять за те щоб я приходив раніше»."
    #show Sayori again, winter outfit
    show sayori winterwork happ cm oe at t11
    mc "... Я бачу, тобі теж хочеться звалити."
    s ce "Агась!"
    mc "Тобі везе, що твій бос достатньо добрий, щоб не сварити тебе за те, що ти збираєшся піти раніше."
    s oe "Я більш ніж впевнена, що він мене не звільнить."
    mc "Ага."
    mc "До речі, не занадто холодно щоб вигулювати кота?"
    s ce "Ні, у нього є одежа і чобітки!"
    mc "Хм-м-м, ну добре тоді."
    show sayori oe at t22
    #show chad mc
    show chadmc turned casual happ cm oe at t21
     
    c "Ей, начальник!"
    c "Як справи?"
    mc "Добрий вечір, Чед, все добре."
    mc "Я бачу, ти знову без уніформи."
    c "Та говорю тобі, без неї буде легше ловити магазинних злодіїв."
    mc "Ти буквально більшу частину часу стоїш за касою."
    c curi mb "Можливо, я клієнт, який заблукав."
    show chadmc ma
    mc "... "
    mc "Почекай, ти прийшов сюди тільки в цьому?"
    c happ om oe "Так, я живу, напевно, в 15 хвилинах ходьби звідси."
    c "Крім того, піддаючи себе впливу природи, ти зміцнюєш свій імунітет."
    mc "Я бідьш ніж впевнений, що це не так працює."
    c "Це не те, що кажуть в інтернеті."
    mc "...Короче, неважливо."
    mc "Добре, ми розходимось, на добраніч."
    s "Бувай, Чед!"
    c "Ще побачимось!"
    "...Тобі так пощастило, що ти єдиний, хто хоче працювати вночі."
    #fade out
    stop music fadeout 1.0

    scene bg sayo_house_night_snow
    show snow
    play music snowyjazz
    with fadehold
    show sayori winterwork happ cm oe at t11
    s "Дякую, що провів мене додому."
    mc "Без проблем, мені все одно по дорозі."
    mc "Ти вже переїхала на верхній поверх?"
    s neut "Ні, все ще в підвалі."
    s happ "Но як тільки люди наверху з'їдуть, я, скоріше за все, заберу квартиру."
    mc "Це добре, підвальні квартири – відстій."
    s neut "Ти це мені кажеш."
    s "Тобі везе, у тебе є дім."
    mc "Ну, це добре і погано."
    mc "Більше кімнат – більше рахунків."
    s happ "Так, логічно, в будь-якому випадку, побачимось завтра?"
    mc "Ні, завтра я їду, так що будеш тільки ти."
    s "Добре, тоді побачимось через день."
    mc "Звісно, бувай, Сайорі."
    s ce "Бувай!"
    show sayori at thide
    hide sayori
    "А тепер добратись додому одному, тут до дідька холодно."
    #fade out

    scene bg house_snow_night with fadehold
    show snow

    "Тепло, слава богу."
    "...Пахне смачненько."
    "Не терпиться дізнатись, що це так пахне."
    stop music fadeout 1.0
    play music sayo_gaze

    scene bg kitchen with fade
    show monika forward_casual happ cm oe at t11
    mc "Що так смачно пахне?"
    m "Ой! Привіт, коханий."
    show monika ce at h11:
        ease .3 zoom 3.8 yoffset 1900 
    #hug/kiss
    window hide dissolve
    pause 2.0
    show monika at h11:
        ease .5 zoom 1.0 yoffset 0
    m oe "Я не почула, як ти зайшов."
    mc "Так, я непомітний."     
    mc "Так, що ж готується?"
    m "Теріякі з лосося."
    mc "Чудово!"
    mc "Де донечка?"
    m "Наверху в своїй кімнаті."
    m "Взагалі, вечеря майже готова, не міг би ти сходити за нею?"
    mc "Звісно."

    scene bg altbedroomnight with fade
    show miyuki casual e7 at t11

    mc "Мію? Вечеря майже готова."
    mm m2 "О, привіт, тату!"
    mm e4 "Зараз закінчу малювати, і прийду."
    show miyuki m10
    mc "А що ти малюєш?"
    mm e7 m3 "Чібі кролика."
    show miyuki m10
    mc "Звучить чарівно."
    mm e4 m2 "Він реально миленький!"
    mm e7 m4 "Но він ще не закінчений, так що не дивись."
    show miyuki m10
    mc "Добре, добре, тільки спустись, як закінчиш."
    mm e4 m2 "Обов'язково!"

    scene bg kitchen with fade

    show monika forward_casual happ cm oe at t11
    mc "Вона скоро спуститься."
    m "Добре."
    m "Ну, як попрацював?"
    mc "Нудно, радий, що закінчилось."
    m rhip laug mb "Оу, ну, принаймні, завтра у тебе вихідний."
    show monika ma
    mc "Так, це вже щось."
    m happ om "Як там Сайорі?"
    mc "Сайорі-Сайорі, ти і сама знаєшь, як вона."
    mc "Господи, клянусь, у цієї дівчини в голові парк розваг, куди вона тікає."
    m rdown neut "Можливо, але вона завжди така."
    mc "Я знаю, но часом це мене збиває з пантелику."
    mc "І в такі дні, як цей, я трохи ревную."
    m happ ce "А-ха-ха, ну що ж, тепер ти вдома, не треба сердитися."
    mc "Так, ти права."
    m neut oe "Ти впевнений, що вона прийде?"
    mc "Так, вона просто малювала кролика, чи що-небудь таке."
    m happ "Мило."
    m "Ну, вечеря готова, може мені покликати її."
    show monika at t21
    show miyuki casual e7 at t22
    mm "Все в порядку, мама, я тут."
    mc "Закінчила свій малюнок, Мію?"
    mm "Так, но мені не подобається, як він виглядає, тому я його викинула."
    mm e4 "Я знову спробую завтра."
    mm e7 "А що на вечерю?"
    m "Лосось з обжареними овочами."
    mm e4 "М-м-м, люблю лосося."
    show miyuki e7
    m ce "Він дуже корисний для твого здоров'я, тож рада чути."
    show monika oe
    mc "Так, ти б могла бути як твоя тітка Сайорі і любити солодощі."
    mm back m4 "Ну, я люблю солодощі, але від великої кількості мій животик болить."
    show miyuki cm
    mc "Урок, котрий тітка досі не засвоїла."
    mm e4 "Тітка Сайорі дурненька."
    mc "І справді."
    show miyuki neutral
    m rhip "М-м-м, доню, ти не хотіла дещо запитати тата?"
    mm e7 m4 "Я?"
    show miyuki m9
    m rdown "Кхм, ми говорили про це раніше."
    mm m2 e6 "...А, так!!"
    show monika rdown
    mm om e7 back "Тату, ми можем влаштувати Різдвяну вечірку цього року?"
    mc "Вечірку?"
    mm e4 "Так! З декораціями, їжею і всяким різним!"
    mc "Ах-х-х...."
    mm e7 m4 b2 "Будь ласка-а-а!? "
    show miyuki m9
    mc "Я не дуже впевнений."
    mm b1 m3 "Я можу допомогти з декораціями і всяким різним!"
    mm b2 m4 "Ну ж бо, тату, будь ласка?"
    show miyuki m9
    mc "Ем-м-м... що думає мама?"
    m lpoint rhip "Воно повинно бути веселим, ми могли б запросити Сайорі, Юрі і Нацукі, можливо, навіть мою маму."
    show monika ldown
    mc "Хм-м-м, ну може бути."
    m ce "Що ж, я повністю за, але я сказала їй, що ми обоє повинні погодитись."
    show monika oe
    mc "Ось що я тобі скажу, Мію, тато сьогодні трохи втомлений, але я подумаю про це і дам тобі знати завтра, добре?"
    mm m4 neutral "Звучить як ні..."
    show miyuki m9 neutral
    mc "Міюки..."
    mm m8 b3 "Добре..."
    mc "Чудово."
    show miyuki m9 b1 
    mc "Як справи в школі?"
    mm m4 "Все чудово."
    mm om "На справді, ми мало що зробили сьогодні, окрім кількох ігор, бо це був останній день перед канікулами."
    mc "Що ж, звучить весело."
    mm e4 "Тому що і справді було весело!" 
    mm e7 "Я нічого не виграла, але мені все одно було весело."
    m ce "В цьому і весь сенс, доню."
    show monika oe
    mm "Так, я знаю."
    mm "Добре, я закінчила їсти, можу я піти пограти?"
    m neut "Ти не бажаєш десерту?"
    mm b2 "Я об'їлась, можливо, пізніше."
    m happ "Добре, ти можеш піти пограти."
    show miyuki at thide
    hide miyuki
    show monika at t11
    mc "У тебе є десерт?"
    m rhip "Ні, я просто збиралась пригостити її морозивом чи ще чимось."
    m rdown "Но тобі теж можна."
    mc "Чудово, дякую, мам."
    m ce "Завжди будь ласка." #gleeful
    mc "Ага."
    m oe "Пройшло стільки років, а тебе все ще легко дразнити."
    mc "Ти продовжуєш мене шантажувати, ха-ха-ха."
    m rhip "Що можу сказати? Це весело."
    m rdown neut "Доречі, про веселощі, що ти думаєш про те, щоб влаштувати вечірку?"
    mc "Я думаю, що у нас мало часу, і ми не знаємо, чи встигнемо."
    m rhip "Но-о-о?..."
    mc "Но я не проти цієї ідеї."
    m happ ce rdown lpoint "Так давай займемся цим!"
    show monika ldown
    mc "Ми можемо, але я думаю, на всякий випадок, було б краще подивитись, хто це зробить першим." 
    show monika oe
    mc "Я не хочу, щоб вона засмутилась, якщо ніхто не зможе."
    m "Що ж, мабуть, ти правий."
    mc "Кохана, це не схоже на вечірку, це сімейні посиденьки з декораціями."
    m neut "На цьому і зупинимось."
    m happ "Ну, кого ми можемо запросити?"
    mc "Всіх, кого ти згадала раніше, окрім твоєї матері."
    m anno e1a "Що? Чому?"
    mc "Тому що твоя мама не приходить на жодну вечірку, яку я влаштовую."

    m "{i}Ми{/i} влаштовуємо, і це все ще не відповідь на моє питання."
    mc "Тому що твоя мати - зануда!"
    mc "Вона мене не любить!"
    m "Діло не в тобі, а в нашій доньці, яку вона дуже сильно любить."
    m "До того ж, тобі не доведеться пити, бо на вечірці не буде алкоголю."
    mc "Ти правильно сказала, без алкоголю, а це значить, що твоя мама не прийде."
    m angr oe "Ей!"
    mc "Я правий."
    mc "Ця жінка - алкоголічка."
    m "Неправда."
    mc "Якщо буде вечірка, то вона має бути такою, де я не буду сперечатись з кимось настільки самозакоханим."
    mc "Якщо це станеться, твоїй матері доведеться піти."
    mc "Я не намагаюся бути поганим, я просто хочу запобігти конфлікту до того, як він станеться."
    m anno "...допустим."
    m neut "Тоді тільки Сайорі, Юрі і Нацукі?"
    mc "Звучить чудово."
    mc "Щоб довести, що я не поганий хлопець, я можу відвести Міюки до бабусі раніше ненадовго."
    m happ ce "Добре."
    m oe "Вона це оцінить."
    mc "Я сказав, що можу, але подивимось, коли настане день."
    mc "І все ж, що нам потрібно для вечірки?"
    m neut "Ну, це ж Різдвяна вечірка, це буде просто, але треба зробити список."
    mc "...І скільки це все буде коштувати?"
    m happ "У нас достатньо грошей, не думай про це."
    mc "Легко сказати, ти не працюєш в цілодобовому магазині."
    m anno rhip "Ні, не працюю, і я кажу тобі, що це не та розмова, яку я хочу вести."
    m ce "Так, я заробляю більше, ніж ти, але для мене це не має значення."
    m neut oe rdown "Головне для мене - благополуччя нашої сім'ї."
    mc "Принаймні в цьому ми можемо погодитися."
    m happ "Точно, а інше не має сенсу."
    "Легко сказати, важко не відчувати."
    "Но не час для цього."
    mc "Добре, тоді давай складемо список."
    mc "Давай спочатку пройдемо в зал, я хочу повалятись на дивані."
    m "Добре, тоді я схожу за ручкою і листком на верх."
    #fade out
    stop music fadeout 1.0

    scene bg living_room_night with fadehold

    play music chillvibes
    "Тиждень, щоб зібрати це все."
    "Повинно бути весело."
    "Спочатку треба дізнатись, чи зможуть прийти люди."
    "Я впевнений, що Сайорі точно прийде, але щодо Юрі і Нацукі не знаю, так що треба б дізнатись."
    "Не завадило б запросити ще пару людей, щоб це було варте того."
    #show moni
    show monika forward_casual happ cm oe at t11
    m "Добре, давай уявимо, що нам потрібно."
    mc "Ти знаєш, кого ще ми можемо запросити?"
    m neut md "М-м-м?"
    show monika md
    mc "Я просто задумався, кого ще ми можемо запросити."
    mc "Якщо ми збираємось витратити на це, було б добре зібрати побільше людей."
    m om "Добре підмічено."
    m happ "Я думаю, я могла б запросити свою подругу по каві."
    mc "Котоноха?"
    m "А хто ж іще?"
    mc "Не знаю, у тебе малося б бути багато друзів."
    m neut "Фальшивих друзів, ти маєш на увазі."
    m happ "Я скоротила їх до кількох справжніх."
    mc "А."
    mc "Що ж, не завадить запитати її."
    mc "Я можу покликати брата, у нього все одно немає занять краще."
    m anno "Він все ще безробітний?"
    mc "Ага."
    m "Хіба ти не можеш влаштувати його в магазин?"
    mc "Немає часу, а навіть якби і було, я люблю свого брата, але не настільки, щоб бачити його так часто."
    m ce "Це погано."
    show monika oe
    mc "Це братські стосунки, тобі не зрозуміти."
    mc "У будь якому випадку це тільки 2 додаткові людини, кого ще можна?"
    m neut "У мене нікого, наскільки я розумію."
    mc "У мене теж, але якщо в усіх вийде, цього має бути достатньо."
    mc "Тепер поверенемось до нашого списку."
    m "Так, по-перше, нам потрібна ялинка."
    mc "Добре, не повинно виникнути проблем з цим."
    m anno "Говорить той, хто ще нічого не купив."
    mc "Я був зайняти!"
    show monika neut
    mc "Не хвилюйся, я візьму ялинку найближчим часом."
    m happ "Добре."
    m neut "Потрібні ще прикраси на ялинку, і ще хоча б в вітальні."
    mc "Було б чудово, не думаю, що решту будинку потрібно прикрашати."
    mc "Думаю, нам ще потрібна їжа."
    m happ "Звісно, нам потрібна гора закусок і напоїв для вечірки."
    mc "Я можу купити більшість в торговому центрі, але тобі доведеться розписати."
    m ce "Я можу зайнятись цим прямо зараз."
    mc "Прекрасно."
    show monika neut oe
    #phone ringtone
    mc "М-м-м?"
    mc "Дідько, чому він дзвонить?"
    show chadmc turned casual happ cm oe at t31 zorder 2
    show grocerysplit behind chadmc zorder 2
    show monika behind grocerysplit
    mc "Привіт?"
    c "Привіт, начальник!"
    mc "Ти ж розумієш, що час ночі не найкращий?"
    c "Так, я знаю і дуже вибачаюсь, але у мене дуже важливе питання."
    mc "Х-х-х, що таке?"
    c "Добре, я перевіряв просрочені продукти і знайшов дещо."
    c neut "Моє питання таке, чи можу я забрати це додому?"
    mc "Що? Ні, звісно ж ні."
    c "Но воно просрочено, ми б все одно викинули."
    mc "Ні."
    c "Це марно витрачений час, це навіть не схоже на погане."
    mc "Мене не хвилює, це проти правил компанії, так що ні."
    mc "Якщо ти щось забереш з цього, ти звільнений."
    c "Добре, добре, не треба перегинати палицю."
    c happ "Я просто викину це, як завжди."
    mc "Я перевірю камери, щоб впевнитися в цьому."
    mc "Я вішаю слухавку."
    c "До зустрічі, начальник."
    show chadmc at thide
    hide chadmc
    show grocerysplit at thide
    hide grocerysplit
    mc "Цей хлопець так мене дратує."
    m happ "Принаймні вчасно. Поки ви розмовляли, я склала список."
    mc "Ні один дзвінок від нього ніколи не буває вчасно."

    scene bg entrance_night with fade
    #show Miyu pjs
    show miyuki pajama m9 at t11
    mc "У будь-якому разі, я думаю, я візьму Мію, щоб розпитати кожного."
    show miyuki e4 cm
    miyu "Так-а-а-а."
    show miyuki e7
    m "Ми не можемо просто зателефонувати їм?"
    show miyuki b3 m9
    #show annoyed
    mc "Ні, я думаю, вона хоче запитати у них особисто, плюс я можу виконати кілька доручень по дорозі."
    #show gleeful
    show miyuki e7 b1 cm
    mc "Я можу спочатку зайти до Нацукі, потім до Юрі, і нарешті, запитати Сайори на роботі."
    mc "Ти можеш зателефонувати своїм друзям, а я напишу брату завтра."
    m "Звучить як гарний план."
    mm e4 "{size=12}Так, це так.{/size}" #small writing
    mc "Піду подивлюся, чи не спить вона ще, скажу їй, що я розбуджу її досить рано."
    mm m4 e7 "О-оу."
    
    scene bg living_room_night with fade
    show monika forward_casual happ cm oe at t11
    mc "Якщо вона ще не спить, я вкладу її спати, і потім ми можемо подивитися фільм, або зайнятися ще чимось."
    m "Добре, коханий."

    scene bg entrance_night with fade

    "Хм... клянуся, що тільки що чув кроки наді мною."
    "Вона підслуховувала?"

    scene bg hallway with fade

    "З її кімнати нічого не чутно."
    "Але я знаю, як з цим впоратись."

    scene bg altbedroomdark with fade

    show miyuki pajama e5 m10 at t11
    "..."
    mc "Міюкі, ти вже заснула?"
    mm "..."
    mm om "{size=12}Так-а-а-а...{/size}" #small writing
    mc "А ти знаєш, що сплячі люди не можуть відповісти на це питання?"
    mm b2 "{size=12}...Мабуть?{/size}" #small writing
    mc "Я знаю, що ти не спиш, доню."
    #show Miyuki
    mm om e7 "Окей, я не сплю, але я намагалася!"
    mm e4 b1 "Я дуже чекаю завтрашнього дня!"
    mc "Ох, ти чула про нього."
    mm b2 e7 "Можливо, я підслухала зі сходів."
    mc "Так, мені здалося, що я чув кроки, місіс Потайність."
    mm m4 "Вибач."
    show miyuki m9
    mc "За що?"
    mm m4 "За шпигунство."
    show miyuki m9
    mc "Хм, тобі не слід було підслуховувати, але цього разу я не серджуся."
    show miyuki b1
    mc "У будь-якому разі, я піднявся, щоб сказати тобі про це."
    mm m4 "Правда?"
    show miyuki m9
    mc "Ага, а ще тобі потрібно встати рано і бути бадьорою."
    mm b1 om e4 "Окей!"
    show miyuki e7
    mc "Ти будеш запрошувати гостей, як думаєш, ти впораєшся з цим?"
    show miyuki pose
    mm "Ти можеш покластися на мене, тату." #finger point
    show miyuki pajama neutral
    mc "Я знаю, а тепер повертайся в ліжечко."
    mm neutral b2 "Можу я трохи почитати перед сном?"
    mm "Я ще не хочу спати."
    mc "Добре, тільки трохи, окей?"
    mc "Завтра важкий день для нас."
    mm b1 e4 "Окей, тату, я клянуся."
    mc "Це моя дівчинка, добраніч, Мію."
    mm e7 "Добраніч, тату, я люблю тебе!"
    mc "Я теж тебе люблю, доню."
    #fadeout

    scene bg living_room_night with fade
    show monika forward_casual happ cm oe at t11
    m "Вона все ще не спала?"
    mc "Ну, спала, але взагалі-то не спала."
    mc "Вона трохи почитає, якщо ти хочеш побажати їй спокійної ночі.."
    m ce "Звичайно хочу, скоро повернуся." #fadeout monika after
    show monika at thide
    hide monika
    "Дивно, як сильно Мію схожа на свою маму."
    "Напевно, це добре."
    "Занадто багато моїх генів, і ти виростеш менеджером цілодобового магазину."
    "На сьогодні достатньо самобичування."
    "Задрімаю, поки Моніка не повернеться."
    stop music fadeout 1.0




