label story5:
    scene black
    with fadehold
    window hide dissolve
    pause 2.0

    show screen end5 with fade
    pause 5.0
    hide screen end5
    pause 2.0
    screen end5:
        text "24 грудня" yalign 0.5 xalign 0.5
    scene bg kitchen with dissolve_scene_full
    play music firelofi
    
    "О-ох, доброго ранку."
    "Свято чи ні, мені все одно."
    "Святковий настрій може зачекати, принаймні до полудня."
    "Я з'їв льодяник на сніданок, досить святково."
    "Добре, що сьогодні я працюю лише до обіду."
    "День і так буде досить довгим."
    "Моніці й Міюкі пощастило, вони можуть спокійно виспатися."
    "Радість зимових канікул і відпустки на роботі."
    "Якби я спробував взяти вихідний на Різдво, з мене б посміялися."
    "Дурна робота на дні." #якби це була не перевірка у ворді, а справжня гра, то перші кілька рядків дня у тебе б навіть не відкрилися
    #show Miyuki excited, bouncing if possible
    show miyuki pajama e4 at t11
    "......О-о-о, Господи..."
    mc "Доброго ранку, Мі-{nw}"
    mm m1 "СЬОГОДНІ КАНУН РІЗДВА!!!!!!!"
    show miyuki m10
    mc "Тс-с-с-с, твоя мама ще спить."
    show miyuki at t22
    show monika pjs happ cm ce at t21
    m "Ха-ха, молодець."
    m oe "Вона розбудила мене першою."
    mc "Ох."
    mc "Що ж, тоді доброго ранку вам обом."
    mm m1 "Це Канун Різдва!!"
    mm m2 "Канун Різдва, Канун Різдва, Канун Різдва, Канун Різдва, ка-{nw}" #без «це»
    mc "Звідки в неї стільки енергії?"
    m "Сама не знаю."
    mc "Тепер я навіть не можу нормально функціонувати вранці без постійних доз кави."
    m ce "Хе-хе, мені трохи краще, але мені все одно треба хоч трохи кави."
    show monika oe
    mm "-нун Різдва, Канун Різдва, Канун Різдва, Канун Різдва, Канун Рі-{nw}"
    mc "Ти впораєшся з нею зранку?"
    m "Я впораюся."
    m "Я впевнена, що зрештою вона заспокоїться."
    mc "Хочеш посперечатися?"
    m laug ce "Ні, ха-ха, просто надія."
    show monika happ oe
    mm "-здв, Канун Різдва, Канун Різдва, Канун Різдва-{nw}"
    show miyuki cm e7 
    mc "Міюкі, як думаєш, ти зможеш заспокоїтися, щоб поїсти?"
    mm e4 m1 "Але сьогодні Канун Різдва!"
    show miyuki cm 
    mc "Так, але навіть якщо ти трохи заспокоїшся, це все одно буде Канун Різдва."
    "Боже, якою вона буде завтра?"
    mm e7 "Але тату, сьогодні Канун Різдва, скоро буде вечірка!" 
    mm e4 "І Санта прийде сьогодні ввечері!"
    m "Звичайно, прийде, доню."
    m rhip "Нам доведеться залишити для нього трохи молока і печива."
    show monika rdown
    mm "Так!"
    mm e7 "А потім буде вечірка!"
    mc "Ключове слово – потім, моя маленька Мію." #давай хоча б цілісність тексту збережемо, а то в двох різних реченнях на одне й те саме англійське слово у тебе два українських переклади
    mc "Тож постарайся трохи заспокоїтися, ти ж не хочеш втомитися до цього моменту, правда?"
    mm "Я не втомлюся!"
    mm e4 "Я занадто збуджена, щоб втомитися!"
    mm m2 "Сьогодні Канун Різдва, я не можу втомитися!"
    show miyuki cm
    "Хе-хе-хе, удачі, Моніко."
    mc "Що ж, я дуже сподіваюся, що ти маєш рацію щодо цього."
    mc "У будь-якому разі, татові треба ненадовго піти на роботу, тож гарного ранку з мамою."
    mm "Мамо, чим займемося зранку?!"
    mm e4 "Може, зліпимо сніговика? Або підемо в парк? Або спечемо різдвяне печиво? Або подивимося п'ять фільмів? Або..."
    show miyuki e7
    m laug ce "Притримай коней, доню." 
    m oe "Може, я просто виберу кілька варіантів з усього, у нас не буде часу на все."
    show monika happ
    mm "Добре!"
    mc "Я б із задоволенням подивився, як це розіграється, але мені справді час іти."
    mc "Побачимося пізніше з вами обома."
    m "Люблю тебе, дорогий."
    show monika ce at h11:
        ease .3 zoom 3.8 yoffset 1900 
    #hug/kiss
    window hide dissolve
    pause 2.0
    show monika at h21:
        ease .5 zoom 1.0 yoffset 0
    #kiss
    m "Гарного дня на роботі, милий."
    #Miyu hug
    mm "Бувай, тату!"
    mc "Бувай, Мію, веселися з мамою."
    mm "Я так і зроблю!"
    pause(1.5)
    m "Отже, подумай, що б ти хотіла зробити?"
    mm e4 "Все одразу!"
    m laug ce "О боже..."
    #fadeout
    stop music fadeout 1.0

    scene bg grocery with fadehold
    play music clubs

    "Паперова робота у Канун Різдва."
    "Це має бути незаконно."
    "Чому я взагалі маю сьогодні робити замовлення?"
    "Ми все одно нічого не отримаємо до кінця Різдва."
    # *bell dinging sounds*
    play audio ding
    "М-м-м?"
    "Клієнт?"
    "... А касира немає..."
    mc "Ага-а-а-а-а-а."
    "Куди поділася Сайорі?.."
    #show Haruna
    show Haruna autumn cm at t11
    $ hr_name = "Покупець"
    mc "Вибачте за це." #ти до будь-якої незнайомої людини звертаєшся і з першої ж фрази переходиш на ти?
    hr "Все гаразд. Я чекала всього кілька хвилин."
    mc "Я справді не впевнений, куди поділася моя співробітниця-"
    mc "Сайорі! Де ти?"
    s "Вибач! Зараз буду!" #offscreen
    mc "Ще раз перепрошую."
    "Чи хочу я взагалі знати, чим вона там займалася?"
    hr m1 "Хм-м-м."
    show Haruna cm at t22
    show sayori work pani cm ce at t21
    s "Вибач, я готувала гарячий шоколад."
    s happ oe "... О, привіт, Харуна."
    $ hr_name = "Харуна"
    s "Як справи?"
    hr "Привіт, Сайорі."
    hr "У мене все добре."
    s ce "Це чудово!"
    s oe "Чим я можу допомогти тобі сьогодні?"
    hr "Допоможи мені придбати ці товари."
    s ce "Я думаю, що можу з цим допомогти, а-ха-ха!"
    hr m1 "Хм-м-м."
    show Haruna cm
    s oe "Я просто проб'ю їх для тебе."
    hr "Дякую тобі."
    mc "Там ще йде сніг?"
    hr "Так."
    hr "Хоча я впевнена, що ти б це зрозумів, виглянувши у вікно."
    mc "...Так, це правда."
    mc "Мабуть, я ще не до кінця прокинувся, а-ха."
    hr m1 "Хм."
    show Haruna cm
    s "Добре, карткою чи готівкою?"
    hr "Карткою."
    s "Все буде готово, коли ти будеш готова!"
    hr "Добре."
    s "Тобі потрібен чек?"
    hr "Ні, дякую."
    s ce "Гаразд, тоді можеш іти!"
    show sayori oe
    hr "Дякую тобі, Сайорі."
    s "Нема за що, гарного дня."
    hr "Тобі також."
    mc "Так, гарного дня."
    hr "Дякую." #fadeout Haruna
    show sayori at t11
    show Haruna at thide
    hide Haruna
    s "Вона чудова, правда ж?"
    mc "...Мабуть?"
    mc "Звідки ти взагалі її знаєш?"
    s neut "О, неподалік є чайна, куди я іноді заходжу, зазвичай вона там читає в куточку."
    s happ "Щоразу, коли я її бачу, я завжди з нею балакаю."
    mc "Я розумію... і вона відповідає тобі у відповідь?"
    s neut "Ну так, а чому б і ні?"
    mc "Я не знаю, я просто бачу в ній риси тихої людини."
    s happ "Так, вона може бути трохи тихонею, але вона справді мила, коли ти її краще пізнаєш."
    mc "Хм, цікаво."
    mc "Що ж, я збираюся ненадовго повернутися до своїх паперів, будь ласка, слідкуй уважніше."
    s tap work nerv om oe "Е-хе-хе, вибач за це, я трохи хотіла пити."
    mc "Все гаразд, принаймні ти знала її, можливо, це змусило її трохи менше злитися через очікування."
    show sayori work neut cm oe
    mc "Просто наступного разу будь уважнішою." #я насправді працюю – ніколи б вищий за званням не звертався до нижчого на «ви»
    s happ "Зрозуміла."
    mc "Гаразд. Поговоримо з тобою трохи пізніше." #fadeout
    stop music fadeout 1.0

    scene bg grocery with fadehold
    #show sayori
    show sayori work happ cm oe at t11
    play music snowyjazz
    "Хм, на диво, цей ранок пролетів швидко."
    "Не очікував такого у Канун Різдва."
    "Хоча це було досить напружено, я думаю, що все нормально."
    "Якраз час мені піти змінити Моніку."
    "Судячи з повідомлень, які вона мені надіслала, у Мію ще не закінчилася енергія."
    "Вони також домовилися про прогулянку і перегляд фільму як ранкові розваги."
    "Чесно кажучи, я здивований, що вона змогла всидіти на місці під час фільму."
    s "Занурився у свої думки?"
    mc "Не дуже."
    mc "Іноді це на тебе не схоже."
    s "Так, ніхто з моїх знайомих не може виділятися так, як я."
    mc "У будь-якому разі, про що ти взагалі так старанно думаєш?"
    s nerv ce "...Та так, нічого особливого."
    mc "Нічого особливого?"
    s oe "Так."
    mc "...Гаразд..."
    "Я припускаю, що це «нічого особливого» насправді нічого особливого собою не являє."
    "Хоча сумніваюся, що вона це визнає."
    show sayori happ oe cm
    mc "І що ти плануєш робити з Мію пізніше?"
    s "Так, сьогодні гарна погода, тому я відведу її в парк."
    mc "Звучить весело."
    s ce "Я весела тітка, звісно, буде весело."
    show sayori oe
    mc "Просто щоб ти знала, сьогодні вона справді повна енергії."
    s "Ох, хі-хі, немає нічого такого, з чим я не впораюся."
    mc "Ох, тобі видніше."
    mc "Це не звичайний рівень енергії дитини, це рівень енергії дитини в Канун Різдва."
    mc "Цього ранку вона буквально відскакувала від стін."
    s "Ну так, сьогодні Канун Різдва."
    s ce "Яка дитина не була б у захваті?"
    s oe "Чорт забирай, тільки не кажи мені, що ти не був таким у дитинстві."
    mc "Я не можу згадати."
    "Хоча, може, і був, хто знає."
    mc "Все, що я кажу – готуйся."
    s "У цьому немає потреби, я впораюся."
    mc "Гаразд, якщо ти так кажеш."
    "Їй видніше."
    s "Всі прийдуть на вечірку?"
    mc "Так, наскільки я знаю."
    s "Це чудово."
    mc "Ну, крім Нацукі."
    mc "Вона зазвичай вирішує в останню хвилину."
    s "Я впевнена, що у неї все вийде."
    mc "Так, вона казала, що попросить свого хлопця допомогти їй сьогодні, щоб вона могла швидше звільнитися."
    mc "Думаю, це просто залежить від того, наскільки корисним він виявиться."
    s ce "Це ж Нацукі, вона приведе його до ладу."
    show sayori oe
    mc "О, я впевнений, що він добре отримає на горіхи."
    s angr "Гей, не кажи так!"
    mc "Так, ти права."
    mc "Це загальновідомо, тож з мого боку було зайвим це казати."
    s ce "Це не те, що я мала на увазі!"
    mc "Мабуть, ні."
    s mj oe "Р-р-р..."
    mc "Р-р-р-р-розкішно?"
    s om "Ні!"
    mc "Ну що ж, я помилився в здогадках."
    show sayori neut
    mc "А зараз я збираюся йти, мені треба навідати малечу."
    s happ "Гаразд, побачимось пізніше."
    mc "Подзвони мені, якщо Чед не з’явиться раніше, і я з радістю піду його шукати."
    s "Я не знаю, чи варто заходити так далеко, але так, я дам тобі знати."
    mc "Гаразд, побачимось, Сай."
    #fade out
    stop music fadeout 1.0

    scene bg entrance with fade
    play music firelofi

    "..."
    "Ну, поїхали..."
    mc "Я вдома!"
    "Три... два... один..."
    show miyuki casual e4 cm at t11
    mm "Тату!!"
    mc "Мію!"
    mm "Тату!!"
    mc "Мію!"
    mm e7 "Тату, коли гості прийдуть на вечірку?!"
    mc "Трохи пізніше, Мію, ще досить рано."
    show miyuki at t22
    show monika forward_yellow happ cm oe at t21
    m "О, добре, ти повернувся."
    mc "Як тільки зміг."
    m "Напружений ранок?"
    mc "Так, досить напружений."
    mc "У тебе так само?"
    m laug ce "Скажімо так, мені потрібно було набагато більше кави, ніж зазвичай."
    show monika happ oe
    mm e4  "Сьогодні вранці я пила гарячий шоколад!"
    mm e7 "Я знаю, що це не ранковий напій, але мама дозволила, бо сьогодні Канун Різдва."
    mc "У тітки Сайорі сьогодні вранці теж був такий, як не дивно."
    mm "Справді?!"
    mc "Так, але вона балда, бо відволіклася і змусила когось чекати."
    mm m4 "О ні!"
    show miyuki m9
    mc "Саме так, о ні, але все було гаразд, бо тітка знала цю людину."
    m neut "Хто це був?"
    mc "Якась жінка на ім'я Харуна."
    m "О, думала, може, я її знаю, але, мабуть, ні."
    mc "Вона не справила враження товариської людини, тому я б припустив, що можливість зустрітися з нею випадає рідко."
    mc "Але, може, Сайорі якось вас познайомить."
    m happ "Так, можливо."
    mm om "Я теж хочу з нею познайомитися!"
    mc "Ми навіть її не знаємо, Мію, просто тітка."
    mm "Тоді ми всі зможемо з нею познайомитися."
    mc "... Можливо, колись."
    "Я просто погоджусь, мені не потрібно, щоб ця розмова затягувалася."
    mc "Тим часом, у мене є донька, з якою я хотів би провести трохи часу, думаєш, ти можеш допомогти з цим?"
    mm e4 "Хм... може!"
    show miyuki e7
    mc "Балда."
    mc "Що ти хочеш робити?"
    mm m4 "М-м-м..."
    mm om "Я не впевнена."
    mc "Щось із твого ранкового списку?"
    mm "Ні, це був список для мене і мами."
    mc "Я розумію."
    mc "Ну, ти дай мені знати, гаразд?"
    mm "Так, мені просто треба добре подумати."
    mc "Не поспішай, у нас є час, поки тітка не повернеться з роботи."
    mm e4 "Це не займе так багато часу, тату."
    show miyuki e7
    m "Ну, ви двоє весело проведіть час, плануючи щось, а я почну готувати все, що мені потрібно."
    mc "Добре, кохана, дай мені знати, якщо щось знадобиться."
    m ce "Ти будеш першим, хто дізнається." #fade out Monika
    show monika at thide
    hide monika
    show miyuki at t11
    mc "Є ідеї?"
    mm "Поки що ні."
    mc "Тобі не обов'язково залишатися вдома."
    mm e6 "Ти маєш на увазі, що ми можемо кудись піти?"
    mc "Саме це я і маю на увазі."
    mm e7 back "Можемо ми сходити в торговий центр?"
    mc "... Можливо, не туди."
    mm neutral b2 m4 "О-о-о, чому ні?"
    show miyuki m9
    mc "Бо сьогодні в торговому центрі буде шалено людно."
    mm m4 "Але мені треба щось купити!"
    show miyuki m9
    mc "За які гроші?"
    mm m4 "У мене ще є трохи кишенькових."
    show miyuki m9
    mc "Добре, і що ж ти хочеш купити?"
    mm b1 om "Подарунок для моєї подруги."
    mc "Твоєї подруги?"
    mm "Так, моєї подруги Юї зі школи."
    mc "А, цієї."
    mm "Так, вона моя подруга, тому я хочу купити їй подарунок, щоб потім подарувати, коли повернуся до школи."
    mc "Це дуже мило з твого боку."
    mc "Втім, нам, мабуть, слід уникати торгового центру, але ось що я скажу: давай пошукаємо магазин у центрі міста, щоб ти могла щось купити."
    show miyuki m9
    mc "Звучить як справедливий компроміс?"
    mm m4 "А якщо ми нічого не знайдемо?"
    show miyuki m9
    mc "Якщо нічого не знайдемо, я відведу тебе в торговий центр перед школою, щоб купити їй щось, добре?"
    mm om "Домовились."
    mc "Мама залишиться вдома на цілий день, тож ми теж можемо туди поїхати."
    mc "Слухай Моніко! Я візьму Мію з собою, щоб знайти подарунок для її подруги, ми скоро повернемося!"
    m "Добре! Веселого вам шопінгу!" #offscreen
    mc "Я беру машину!"
    m "Добре, ключі висять біля дверей!"
    mc "Гаразд, йди одягайся, і ми вирушаємо за подарунками."
    mm e4 "Ура!" #fadeout
    stop music fadeout 1.0

    scene bg clothes-store with fadehold
    show miyuki winter cm at t11
    play music clubs

    "Чорт, це набагато простіше, ніж ходити по магазинах з Монікою."
    "Це перший магазин, у якому ми були, і Міюкі вже вирішила, що купить щось тут."
    "З Монікою нам довелося б зайти ще десь у шість магазинів."
    "І не дай Боже, її подруги їй трапляться."
    mc "То що думаєш?"
    mm "Я хочу подарувати їй шарф чи щось таке."
    mc "Так?"
    mm "Угу! На вулиці холодно, тож їй треба тепліше вдягатися."
    mc "Я впевнений, що її батьки вже про це подбали."
    mm pose "Ну, я теж збираюся допомогти." #point
    show miyuki neutral
    mc "Як турботливо з твого боку."
    mm e4 "Дякую."
    show miyuki e7
    mc "Купи їй щось її улюбленого кольору."
    mm "Її улюблений колір — фіолетовий."
    mm m4 "Але я не бачу жодних фіолетових шарфів."
    show miyuki m9
    mc "Може, замість цього подарувати їй шапку? Або рукавички?"
    mm e6 om "Хм... О! Он там фіолетові рукавички!"
    show miyuki at thide
    hide miyuki
    mm "Я їх схоплю, поки хтось інший не забрав!" #fadeout Miyu
    "Вона така чарівна."
    "Ми тут зараз єдині."
    "І все ж вона женеться за цими рукавичками, ніби це остання пара на землі."
    "У неї є рішучість її матері, треба віддати належне."
    show miyuki winter cm at t11
    mm e4 "Вони у мене, тату!"
    mc "Добре, ще кілька секунд — і вони могли б зникнути!"
    mm e7 "Я знаю! Але я була набагато швидшою за інших."
    mc "Ти майбутня зірка кросу в процесі становлення."
    mm m4 "Що таке зірка кросу?"
    show miyuki m9
    mc "Хтось, хто дуже добре бігає."
    mm om e4 "Я можу бігати дуже швидко!"
    mc "Колись ти зможеш бігати ще швидше!"
    mm "Ахаха."
    show miyuki e7
    mc "Не проти, якщо я хвилинку подивлюся рукавички?"
    mm "Звісно."
    mm "Вони справді гарні."
    mc "У них дуже приємний колір."
    "Але не дуже приємна ціна."
    "Вона нізащо не зможе дозволити собі це з тими грошима, що в неї залишилися."
    "Як би там не було, я не збираюся їхати звідси з засмученою донькою."
    mc "Мію, дай татові свої кишенькові гроші, і він піде платити."
    mm m4 "А чому я не можу заплатити?"
    show miyuki m9
    mc "Зараз касири по всьому місту дуже зайняті, обслуговують багато клієнтів, тож буде швидше, якщо я заплачу."
    mc "Після цього ми можемо піти пообідати."
    mm om "О, добре, тату, тримай."
    "Слава Богу, вона не сперечалася зі мною через це."
    mc "Дякую, Мію, я знаю, що твоїй подрузі це сподобається."
    mm e4 "Я справді сподіваюся, що вона зрадіє!"
    show miyuki e7
    "Хм, біля каси є кілька яскравих вітрин."
    mc "Поки я розраховуюсь, чому б тобі не піти подивитися на прикраси он там?"
    mm "Добре."
    "Ідеально, тоді вона не побачить ціну і не зрозуміє, що насправді не може собі їх дозволити."
    "Я просто дуже швидко заплачу, а потім відведу її кудись поїсти, перш ніж ми повернемося."
    #fadeout
    stop music fadeout 1.0

    scene bg living_room_day_christmas2 with fadehold
    show miyuki casual cm at t11
    play music wonderland
    "Що ж, це було весело."
    "Ми швидко перекусили, а там уже й додому."
    "Моніка казала, що це чарівно, що Мію дарує щось своїй подрузі."
    "Зараз ми просто дивимося один із чотирьох інших фільмів, які вона хотіла подивитися цього ранку."
    "Очевидно, у неї був список."
    mm m4 "Я не розумію, тату, чому його батьки залишили його вдома самого на Різдво?"
    show miyuki m9
    mc "Бо його батьки трохи дурнуваті, доню."
    mm "М-м-м?"
    mc "Якимось чином вони забули про нього, коли їхали у відпустку."
    mm m4 "Це не дуже добре з їхнього боку."
    show miyuki m9
    mc "Ні, зовсім не добре."
    "Не може бути, щоб служба у справах дітей не втрутилася після такої нісенітниці."
    #*doorbell*
    play audio doorbell
    "О, це, мабуть, Сайорі."
    "Що добре, бо це означає, що хоча б раз Чед справді був відповідальним."
    mc "Це, мабуть, тітка, нам, скоріше за все, доведеться поки що призупинити фільм."
    mm b2 m4 "О-о-о."
    show miyuki m9
    mc "Не хвилюйся, ми можемо закінчити його завтра."
    mm m4 "Ох. Але ж завтра Різдво!"
    show miyuki m9
    mc "Це не означає, що ми не можемо подивитися фільм, правда?"
    mm m4 "... Так, мабуть, ні."
    show miyuki m9
    mc "Правильно, а тепер іди одягайся, думаю, тітка хоче зводити тебе в парк."
    #*rapid doorbells*
    play audio doorbell
    play audio doorbell
    mc "Йду!"
    play audio doorbell
    "Зовсім забув, що ще не впустив її."

    scene bg entrance with wipeleft
    show sayori winterhoodie anno cm oe at t11
    mc "Вибач, Сайорі, відволікся."
    s "Нічого."
    show sayori neut at t21
    show miyuki casual cm at t22
    mm "Привіт, тітко!" #normal outfit
    s happ ce "Привіт, Мію!"
    mm "Ми йдемо в парк?!"
    s "Так, йдемо."
    mm e4 "Ура!!"
    show sayori oe
    mc "Пообіцяй, що будеш добре поводитися."
    mm e7 "Добре, тату." #show monika #fadeout Miyu
    show miyuki at thide
    hide miyuki
    show monika forward_yellow happ cm oe at t22
    m "Мені здалося, я почула шум за дверима."
    s "О, привіт, Моніко, як справи?"
    m ce "Чудово."
    m oe "Готувала, як в сраку ужалена, весь день, смаколики і все таке."
    s rup "О-о-о, можна я буду дегустатором?"
    show sayori rdown 
    mc "Якби ти була дегустатором, на вечірку нічого б не залишилося."
    s angr mj "Хмф."
    s om "Мію, твій тато — злюка."
    mc "А ти доросла людина, яка називає когось злюкою." #те саме
    s "Це не дурниця, якщо це правда."
    mc "Тоді використовуй доросле слово, наприклад..."
    show sayori neut
    m "Ні-ні-ні, тільки не при Міюкі."
    show miyuki winter at t33
    show monika at t32
    show sayori at t31
    mm m4 "Що?" #show Miyu winter outfit
    show miyuki m9
    m laug ce "Нічого, доню."
    show monika happ cm oe
    mm m4 "Ех."
    mm om "Я готова йти, тітко Сайорі."
    s ce "Ну гаразд, ходімо веселитися!"
    show sayori oe
    mm e4 "Так!"
    mm e7 "Бувай, мамо! Бувай, тату!"
    show sayori at thide
    hide sayori 
    show miyuki at thide
    hide miyuki
    m "Гарно повеселися, доню."
    mc "Так, не втомлюй тітку занадто сильно."
    s "Я впораюся-я-я~" #offscreen
    m "А тепер, коханий, якщо ти будеш такий добрий і допоможеш мені з підготовкою до вечірки, я була б дуже вдячна."
    mc "Думаю, я зможу це зробити."
    m "Оце мені й треба."
    #fadeout

    scene bg kitchen with wiperight

    "Можна подумати, Моніка приймала у себе сорок людей з усією приготовленою нею їжею."
    "Або, можливо, вона просто враховує апетит Сайорі."
    "Наближається час вечірки, а я ще нічого не чув від Нацукі."
    "Може, мені варто їй зателефонувати."
    "Я знаю, що вона залишає свій мобільний вимкненим на роботі, тож я просто подзвоню їй на роботу."
    #*ringing*
    play audio dial
    window hide dissolve
    pause 7.0
    n "Ви потрапили на голосову пошту, якщо ви телефонуєте, щоб зробити замовлення, залиште повідомлення, якщо ви телефонуєте не для цього, навіщо ви взагалі телефонуєте?!"
    #*beep*
    play audio beep
    "Це справжнє божевілля, як добре вона справляється з тим, наскільки зухвалою може бути."
    "Вона навіть не назвала назву своєї пекарні!"
    "Як би там не було, вона, мабуть, дуже зайнята, якщо не може відповісти на дзвінок."
    "Напевно, я просто припущу, що вона не зможе прийти, і сподіваюся, що ми будемо приємно здивовані."
    show monika forward_yellow neut cm oe at t11
    m "Як ти думаєш, ми зробили достатньо?"
    mc "Достатньо, щоб нагодувати їдальню."
    m "Я серйозно."
    mc "І я теж, ти занадто багато приготувала."
    mc "Тож перестань хвилюватися, кохана."
    m sad mi "Я знаю, просто ми насправді не займаємося такими речами, тому я хочу, щоб усе було добре."
    show monika cm
    mc "Я можу тебе запевнити, що все буде чудово."
    show monika ma
    mc "Насправді у нас немає таких друзів, які б судили."
    mc "Чорт забирай, ми могли б просто замовити піцу і подивитися фільми, і все було б чудово."
    m nerv ce "Мабуть, ти правий, вибач, мабуть, я просто нервую."
    mc "Не те, щоб це щось змінило, але не варто нервувати."
    show monika e1a
    mc "Усі чудово проведуть час, включаючи тебе."
    show monika neut cm oe
    #*knock*
    play audio sayo_knock
    mc "Хм, хтось прийшов раніше."
    mc "І вони не скористалися дверним дзвінком."
    "Якби це була Сайорі, вона б просто зайшла, тож цікаво, хто це міг бути."

    scene bg entrance with wipeleft
    
    show monika forward_yellow neut cm oe at t22
    m "Привіт?"
    show Kotonoha sweater happ cm oe at t21
    k "Привіт."
    m happ "О, привіт, Котонохо."
    m "Ти трохи зарано."
    k "Так, мені було нудно сидіти вдома, тому я вирішила зайти і подивитися, чи не потрібна тобі допомога."
    m nerv ce "Окрім моїх нервів, не впевнена."
    k neut "Нервів?"
    mc "Вона хвилюється, що людям буде не весело."
    show monika e1a
    k happ ce "О, це дурниці."
    k oe "Все буде чудово."
    m ce "Я дуже на це сподіваюся, ха-ха-ха."
    k rhip "Повір мені, я особисто подбаю, щоб усі пішли щасливими."
    m happ oe b1b "Побачимо, мабуть."
    k neut rdown "Гей, а де мала?"
    show monika b1a
    mc "Вона гуляє зі своєю тіткою Сайорі."
    "Цікаво, як у них там справи, ха-ха."
    #slide transition to park scene
    scene bg park_snow with wipeleft
    show sayori winterhoodie pani cm ce at t11
    s "Мію, де ти?!"
    mm "Ехе-хе-хе!" #offscreen
    s pani ce "Я здаюся! Ти перемогла! Можеш виходити прямо зараз!"
    show sayori neut oe
    mm "Це так не працює!"
    mm "Ти маєш знайти мене, щоб гра в хованки закінчилася!"
    s pout "Чорт забирай, чому я не можу зрозуміти, звідки її голос?!"
    #slide transition back
    scene bg entrance with wipeleft
    show Kotonoha sweater happ cm oe at t21
    show monika forward_yellow happ cm oe at t22
    "Е-е-е, я впевнений, що все йде добре."
    m "Що ж, заходь, немає сенсу стояти тут вічно."
    k "Якби ми це зробили, не було б великої вечірки."
    #fade out
    stop music fadeout 1.0

    scene bg living_room_day_christmas2 with fadehold
    show monika forward_yellow happ cm oe at t42
    show yuri turned casual happ cm oe at t44
    show canon turned casual happ cm oe at t41
    show Kotonoha sweater happ cm oe at t43
    play music firelofi

    "Сайорі і Мію скоро мають повернутися."
    "Поки їх не було, з'явилися мій брат і Юрі."
    y "Тут досить затишно, Моніко."
    y "Чесно кажучи, я очікувала, що все буде більш розкішно."
    m "Так, ми не думали, що це має бути занадто чи щось таке."
    hi "Гей, це краще, ніж те, що я маю для прикраси."
    hi neut "У мене просто маленька ялинка на журнальному столику."
    show canon happ
    mc "Так, не можу уявити, що було б сенс дуже старатися з декором у підвалі наших батьків."
    hi anno "Гей! Це лише тимчасово."
    mc "Так, я знаю."
    "Він це говорить вже рік."
    show canon neut
    mc "Але ти ж знаєш, що тобі потрібна робота, щоб покінчити з «тимчасово», інакше це стане «постійно»."
    hi "Я шукав, просто ще не знайшов те, що треба."
    y "Можливо, ти міг би піти працювати в книжковий магазин, ми шукаємо нового співробітника."
    hi "Ні, фізична праця не для мене."
    show yuri anno
    hi happ ce "[player] вже благав мене попрацювати на нього, але ні, ця робота не для мене."
    show canon oe
    mc "Я не благав."
    mc "Це називається бути ввічливим і пропонувати."
    hi ce "Так, але я можу просто сказати «ні» дуже багато разів, а-ха-ха."
    show canon oe
    "Чесно кажучи, це мої батьки так часто мене про нього питали."
    "Але я знаю, що він у це не повірить."
    show yuri neut
    k neut "На яку роботу ти хочеш влаштуватися?"
    hi "Хто знає, може, модель чи щось таке."
    hi "Я маю на увазі, що мені явно дісталася сімейна зовнішність, тож я міг би щось з цим зробити."
    k nerv e1c "О, а-ха-ха..." #ну, типу, ніяково
    show Kotonoha neut oe
    m ce "Я не знаю, мені здається, цей хлопець це отримав."
    mc "А-а-а..."
    show yuri happ
    show Kotonoha happ
    "Я відчуваю, як горить моє обличчя, і знаю, що всі це бачать."
    hi neut "Ти його дружина, ти маєш бути на його боці."
    m oe "Я б вибрала його, незважаючи ні на що."
    show monika ce at h11:
        ease .3 zoom 3.8 yoffset 1900 
    #hug/kiss
    window hide dissolve
    pause 2.0
    show monika at h42:
        ease .5 zoom 1.0 yoffset 0
    #kiss
    hi anno ce "Ой, годі вже, залиште це на той випадок, коли ми всі підемо, гаразд?"
    show canon oe
    m ce "Не втрималася, хі-хі."
    mc "Не починай зараз ревнувати."
    hi "Так, точно."
    show canon neut
    m oe "Хоча мені б хотілося, щоб це тривало, я маю подбати про дещо на кухні."
    m "Ти можеш піти допомогти мені, Кото?"
    k ce "Звісно, можу!" #fadeout koto and monika
    show Kotonoha at thide
    hide Kotonoha 
    show monika at thide
    hide monika
    show canon at t31
    show yuri at t33
    "З таким же успіхом можна трохи підколоти Юрі."
    mc "Отже, поки твоя кар'єра моделі, ймовірно, не складеться, що ще ти запланував?"
    hi happ "Великі справи, брате, великі справи."
    mc "О? Розповідай."
    hi "Ти коли-небудь чув про клік-фанел?"
    mc "Ні, але маю відчуття, що ти зараз поясниш."
    hi "Отже, по суті, я розміщую рекламу для сайтів на інших сайтах, і кожного разу, коли хтось натискає на мою рекламу і щось купує, сайт, який я рекламую, платить мені."
    hi ce "Це, по суті, халявні гроші."
    show canon oe
    show yuri anno
    mc "Так просто, так?"
    hi "Я сам не міг у це повірити."
    y "Але ж тобі треба платити за саме рекламне місце?"
    hi "Ну так, але я вирішив почати з малого і просто як снігова куля вирости у щось більше."
    y ce "Мені важко зрозуміти, наскільки це реалістичний план."
    y oe "З того, що ти нам щойно розповів, здається, що лише люди з достатньо великим стартовим капіталом можуть заробити реальні гроші."
    hi ce "Е-е-е, ви все побачите, як тільки я стану мільйонером."
    show canon oe
    mc "Тепер, коли ти сказав про великі плани, розкажи нам, що ще у тебе в рукаві."
    hi "Ну, це лише побічний ефект, але я купував права на зображення в Інтернеті, і зрештою зможу продати їх з величезним прибутком."
    mc "... Вибач, {i}що?{/i}"
    hi "Так, це та штука, яка зараз набирає обертів, і я, так би мовити, встиг застрибнути у потяг."
    mc "Я навіть не можу почати пояснювати, наскільки це дурно звучить."
    hi doub "Якщо це так дурно, то чому знаменитості це купують?"
    show canon neut oe
    mc "Бо у них є гроші, які можна спалити."
    y neut "Я згодна з ним, це здається досить дурною авантюрою."
    y "Ти ж знаєш, що володіння загальнодоступною фотографією в Інтернеті насправді не має сенсу, так?"
    y "Люди можуть просто завантажити її без твого дозволу, якщо захочуть."
    mc "Саме так."
    hi happ "Я довіряю багатим знаменитостям, дякую."
    mc "Ну так, звісно."
    mc "Дай мені знати, коли це спрацює."
    hi "Ти будеш першим, кому я подзвоню зі свого спорткара."
    mc "Я впевнений, що так і буде."
    y happ ce "У-фу-фу-фу."
    hi neut "Що смішного?"
    y "О, нічого, зовсім нічого."
    show yuri oe
    mm "Мамо, тату, ми вдома!" #offscreen
    mm "О, тут ще й інші!"
    y neut "Я справді сподіваюся, що вона буде трохи розкутішою поруч зі мною."
    mc "Я впевнений, що з нею все буде гаразд."
    mc "Ти просто дуже страшна людина."
    y nerv e1d mk "Щ-що? Я... я не намагаюся бути такою."
    y "Що у мені такого страшного?"
    show yuri md
    mc "Я жартую, Юрі, вона просто з якоїсь причини соромиться поруч із тобою."
    y nerv om oe "О-ох."
    y ce "Я... Я розумію."
    show yuri ma e1d 
    mc "Може, сьогодні ввечері ми зможемо це змінити."
    show yuri happ cm oe
    show miyuki casual cm at t32
    show canon happ oe
    mm "Привіт!" #show Miyu
    mc "Привіт, доню, як парк?"
    mm e4 "Було весело!"
    mm e7 "Привіт, дядьку Хірото!"
    hi "Привіт, мала, як поживає моя улюблена племінниця?"
    mm "Дуже добре."
    mc "Вона твоя єдина племінниця."
    show miyuki m9 b2
    hi "Саме так, що автоматично робить її улюбленою."
    mc "..."
    mm m4 "Ем, привіт, тітко Юрі."
    show miyuki m9
    y ce "Привіт, Міюкі, дуже приємно знову тебе бачити."
    show yuri oe
    mm m4 "Так, м-м-мені теж."
    show yuri neut
    mm om b2 e4 "Е-е-е, я піду до мами." #fadeout
    show miyuki at thide
    hide miyuki
    y sad "Схоже, я її засмутила."
    mc "Просто дай їй час."
    show yuri neut
    show sayori turned hoodie happ cm oe at t32
    s "Привіт, друзі." #show Sayori
    mc "Як парк?"
    s neut "Е-е... насправді, досить втомливо."
    show yuri happ
    mc "Я ж казав."
    s nerv "Блін. Я думала, впораюся."
    mc "Чим ви взагалі займалися?"
    s happ "О, ми грали в хованки."
    s laug ce "Я програла, е-хе-хе-хе~..."
    mc "Не можеш знайти її?"
    s pout oe "Ні..." #pout
    mc "Ага, вона дивовижно добре грає в хованки."
    show sayori neut
    mc "Дивно, що її зелений шарф тобі не впав у вічі."
    s lup rup "Я теж так думала!"
    show sayori ldown rdown 
    mc "Отже, скільки часу тобі знадобилося, щоб знайти її?"
    s "Я її так і не знайшла."
    s nerv "Вона вийшла, як тільки їй набридло чекати."
    mc "Ого. Значить, ти зовсім не вмієш шукати."
    mc "Навіть я зрештою її знаходжу."
    s ce "Я старалася!"
    s happ oe "Головне, що нам було весело."
    mc "Так, кажуть, найважливіше — щоб було весело."
    s "Як справи, Юрі?"
    y ce "У мене все добре, дякую."
    show yuri oe
    s "А у тебе як, Хірото?"
    hi "Супер!"
    hi "Я пояснював цим двом свої плани стати багатієм."
    s neut "Оу? І які у тебе плани?"
    hi "Сідай і я розповім."
    mc "Та-а-а. Ти поки посиди тут, а я піду до Моніки."
    hi ce "Ех-х-х, ти таке пропускаєш."
    show canon oe
    mc "Ага."

    scene bg kitchen with wipeleft
    show miyuki casual cm at t33
    show Kotonoha sweater happ cm oe at t31
    show monika forward_yellow happ cm oe at t32
    m "Ой. Як справи, коханий?"
    mc "Не так вже й погано. Просто уникаю дурної розмови."
    m neut cm "М-м-м?"
    mc "Це не так важливо. А як у тебе справи?"
    m happ om "Чудово."
    m "Міюкі щойно розповідала нам про свій похід у парк."
    mm e4 "Я перемогла в хованках тітку Сайорі, тату!"
    show miyuki e7
    mc "Так, я чув!"
    mc "Молодець."
    mm e4 "Аха-ха-ха, дякую."
    show miyuki e7
    k "Ми дозволили їй спробувати домашнє печиво."
    mm "Воно справді дуже смачне."
    m ce "Не думаю, що вони можуть змагатися з печивом тітки Нацукі, але все одно милі."
    show monika oe
    k "Не применшуй своїх навичок, Моніко. Я думаю, вони чудові."
    mm e4 "Згодна!"
    m neut "Не говори з повним ротом, доню."
    mm e7 b2 "...вибачте."
    show miyuki b1
    show monika happ
    "Дуже радий, що вона не спитала про Нацукі."
    "Міюкі буде дуже розчарована, якщо вона не прийде."
    show monika at t42
    show Kotonoha at t41
    show miyuki at t43
    show sayori turned hoodie happ cm oe at t44
    s "Я відчуваю запах їжі."
    m "Гей, Сайорі."
    k ce "Привіт!"
    show Kotonoha oe
    mc "Я здивований, що ти так довго стримувалася."
    s "Ну... я не хотіла здатися грубою — твій брат розповідав мені дещо."
    mc "Нісенітниця."
    s nerv "...мабуть, це було дивно, так?"
    show sayori neut
    mc "Тобі не обов'язково так добирати слова. Він дивак, я знаю."
    s "Він просто... трохи особливий."
    mc "Хех, бідній Юрі довелося двічі слухати одне й те саме."
    m "Тоді мені краще піти до неї. Не хочу, щоб вона пішла."
    mc "Сумніваюся, що вона б пішла. Не такий вже він і поганий."
    mc "Принаймні, більшу частину часу."
    m ce "Втім, я впевнена, що вона оцінить компанію."
    m oe "Мію, ходімо зі мною."
    mm "Окей, мамо." #fadeout both
    show sayori at t22
    show Kotonoha at t21
    show miyuki at thide
    hide miyuki
    show monika at thide
    hide monika
    s "Отже, скількох людей Моніка планувала нагодувати?"
    mc "Ну, їй довелося врахувати твій апетит."
    mc "Попри кількість їжі, ми не чекаємо так багато гостей."
    s angr "Е-ей! Я не так багато їм."
    mc "Я жартую."
    mc "Вона просто була передбачливою."
    show sayori neut
    mc "Краще перестрахуватися, ніж недострахуватися."
    s "О, це має сенс."
    mc "Але ти ж і справді багато їси."
    k "Так, Моніка розповідала мені про твій легендарний апетит."
    s nerv "Вона перебільшує..."
    mc "Зовсім трішки."
    s vang ce "Гей, ти мав бути на моєму боці!"
    show sayori e1a mj
    mc "Перед моєю дружиною?"
    s angr om "Так."
    mc "Вибач, нічого не можу вдіяти."
    s pout "Хмф. Я думала, ми найкращі друзі."
    mc "Я не буду брехати про твій апетит лише тому, що ми найкращі друзі."
    show sayori neut
    k "Ви обидва такі кумедні."
    mc "Так, ми, можна сказати, комедійний дует."
    k ce "Моніка, мабуть, почувається мамою трьох дітей, коли ви бігаєте туди-сюди."
    show Kotonoha oe
    mc "...Так, дивовижно точний опис."
    s happ ce "Вона нас любить." #gleeful
    mc "Вона любить мене, а ти просто приємний бонус."
    s anno oe "Гей, я була з нею знайома раніше, ніж ти."
    mc "Знаю-знаю. Якби не ти, я б ніколи її не зустрів."
    show sayori neut 
    mc "Знайомство, за яке я досі тобі вдячний."
    k rhip "А й справді. Ви ж були в її клубі у старшій школі, так?"
    s happ "Ага, він називався літературним."
    k rdown "Досить лаконічно."
    s "Так, Юрі теж у ньому була."
    show yuri turned casual neut cm oe at t33
    show sayori at t32
    show Kotonoha at t31
    y "Де я була?"
    s "О, привіт, Юрі. Я розповідала Котоносі про Літературний клуб." #одна справа, коли на питання «Який у нас клуб?» відповідають «літературний», інша — коли це власна назва
    mc "Як у вас справи?"
    y "Досить нудно."
    y "Я вирішила перекусити, бо Моніка і твій брат сперечаються про те, що таке «халява»."
    mc "Пф-ф-ф, аха-ха-ха-ха."
    s neut "Чого ти смієшся?"
    mc "Б'юсь об заклад, вона там з нього піджартовує, а він навіть не розуміє."
    y "Схоже на правду."
    mc "Так, він не дуже добре розпізнає такі підколи."
    mc "Зачекай, чому вони це обговорюють при Мію?"
    y "Вона, здається, на підлозі малює."
    mc "Оу."
    show sayori happ
    y happ "Так, мені здалося, їй байдуже на дорослі розмови."
    mc "Ну, зазвичай він нічого розумного не каже, тож таке ставлення — хороший знак."
    show sayori neut
    mc "До речі, Сайорі, я тоді жартував. Звісно, Моніка тебе любить — ти ж одна з її найкращих подруг."
    s happ "О, я знаю, знаю. Такий ти вже є."
    mc "Ага, нічого не можу з собою вдіяти."
    show sayori neut
    mc "Я ж не можу просто мовчати. Але моя фраза прозвучала трохи недоречно, тож я відчув себе ніяково."
    mc "Тож прийми мої вибачення."
    s happ "Вибачення прийняті."
    mc "Супер."
    mc "Що ж, мені краще піти до Моніки, поки вона там не збожеволіла."
    y neut "Невже все так погано?"
    mc "Так, вони ніколи не сходилися у поглядах."
    mc "Два абсолютно різних людини."
    k "Може, не будеш їм заважати? Мені дуже цікаво побачити її сердитою."
    show yuri happ
    mc "Якби Міюкі тут не було, я б точно дозволив цьому статися, бо зазвичай це дуже смішно."
    mc "Але у нас тут відповідальне виховання і все таке."
    k "Тоді ти просто зобов'язаний запросити його в кафе, бо мені дуже цікаво побачити це наживо."
    mc "Це можна влаштувати."
    k b1c rhip "Блискуче." #smug
    show Kotonoha b1a rdown
    mc "Якщо що, не соромтеся брати їжу. Її тут вдосталь."
    
    "Гаразд, час перевірити Моніку."
    #fadeout
    stop music fadeout 1.0

    scene bg living_room_night_christmas2 with fadehold
    #show monika yuri koto miyu & Mc's brother
    
    show monika forward_yellow happ cm oe at t42 behind miyuki
    show yuri turned casual happ cm oe at t44
    show canon turned casual happ cm oe at t41
    show Kotonoha sweater happ cm oe at t43 behind miyuki
    play music yuri_theme
    k "Отже, Моніка і Мію були зі мною в торговому центрі днями, пам'ятаєте?"
    k "Ми ходили по магазинах у пошуках прикрас і всього такого."
    k "Як раптом ми побачили, як хлопець, що ніс торт, послизнувся на мокрій підлозі."
    k ce "Торт розлетівся на всі боки, але це ще не найсмішніше. Вгадайте, в кого влучив один із шматків."
    show Kotonoha oe
    m laug ce "Б-благаю, не розповідай."
    show monika ma n4
    k "Окей, Мію, скажи їм."
    show miyuki casual at t32 zorder 2
    mm e4 "Він влучив мамі в обличчя!"
    y ce "Боже."
    show miyuki om
    show canon om ce
    show Kotonoha om ce 
    show yuri ce om 
    everyone "Ха-ха-ха-ха!"
    show Kotonoha cm oe
    show canon cm oe
    show yuri oe cm
    mc "Мх-ха-ха-ха-ха!"
    mc "Вибач, кохана, це було надто смішно."
    show miyuki cm e7
    show monika oe
    show miyuki at thide
    hide miyuki
    k "Уживу це виглядало ще смішніше."
    k "Але Моніка не дозволила мені її сфотографувати."
    m om ce "Аж ніяк."
    hi "Треба було хоча б одну зробити нишком."
    k "Була така думка."
    show monika oe
    k ce "Але це було б низько."
    show Kotonoha oe
    mc "Чому я тільки зараз про це дізнався?"
    show miyuki casual at t32 zorder 2
    mm "Мама дала мені печиво, щоб я не розповідала."
    mc "О-хо-хо, підкуповуєш нашу доньку, щоб вона щось приховувала, м-м-м?"
    m ce "Це була дуже н-н-незручна с-ситуація."
    m oe n1 "Які взагалі були шанси, що цей клятий торт так у мене опиниться?"
    y "Це й справді здається нещасливим збігом обставин."
    show monika happ cm oe
    y ce "Простіше кажучи, ти опинилася не в тому місці, не в той час."
    show yuri oe
    m ce "Може, повториш ще раз?"
    mm e4 "Ця ситуація була дуже дурною."
    m oe "Дякую, сонечко."
    mm e7 "Завжди будь ласка!"
    m "Ну, досить історій про моє життя."
    show miyuki at thide
    hide miyuki
    m ce "Котонохо, може, розкажеш про ту ситуацію, коли ти думала, що твій хлопець був у кафе?"
    k nerv "А-ха-ха... а може, не треба?"
    show monika oe
    hi "Ні-ні, давай, розповідай."
    mc "Ага, дуже хочу почути цю історію."
    k ce "Там нічого такого... чесно."
    show Kotonoha oe
    m rhip "Чого це ти так злякалася? Клин клином вибивають."
    m rdown "Коротше. Заходимо ми в кафе, а їй здалося, що там сидить її хлопець."
    m ce "Тому їй не спало на думку нічого кращого, як підкрастися і стрибнути йому на спину."
    y nerv ce "І я так розумію, це був не він."
    show yuri oe
    m oe "Правильно, Юрі, той хлопець не був її хлопцем."
    m "Це був просто якийсь випадковий хлопець у такій же куртці й з таким же кольором волосся."
    m ce "Уявіть його обличчя, коли на нього стрибнула якась незнайома жінка."
    show monika oe
    hi ce "Ахахах, серйозно?!"
    show canon oe
    mc "Ха-ха-ха. Чесно кажучи, мені здається, Котоносі краще було б отримати тортом в обличчя."
    k ce "І ти абсолютно права."
    show yuri happ
    show miyuki casual at t32 zorder 2
    k oe "Я так почервоніла від сорому, коли зрозуміла, що навіть не знаю, на кого стрибнула."
    mm m4 "Чому ти на нього стрибнула?"
    show miyuki m9
    k "Бо я трохи дурненька."
    show Kotonoha happ n3
    mm om "О, прям як тітка Сайорі."
    k n1 "Так, прям як вона."
    mc "Сайорі теж кілька разів намагалася стрибнути на мене, тож це досить справедливе порівняння."
    y nerv ce "Не вкладається в голові, якби я спробувала так стрибнути на когось. Тим паче, зробити це зненацька."
    show yuri happ oe
    mc "Так, уявляю, як одна така думка тебе лякає."
    y "Дуже навіть."
    #show Sayori, fadeout Miyu
    show miyuki at thide
    hide miyuki
    show canon at thide
    hide canon
    show sayori turned hoodie neut cm oe at t41
    s "Хтось про мене згадував?"
    mc "Цього було достатньо, щоб відволікти тебе від їжі?"
    s anno "Гей! Ви ж сказали пригощатися."
    mc "Ти там не все з'їла?"
    s "Ага, звісно."
    s "Не прикидайся дурником."
    s neut "І все ж, хто мене кликав?"
    mc "Здається, я тебе згадав."
    mc "Я розповідав про ті випадки, коли тобі спадало на думку, що було б весело пограти в квача без попередження."
    s happ "О, це було весело."
    mc "Ага, для тебе!"
    s anno "Ой, не сердься так."
    s "Я ж не важка."
    mc "Може, й ні, але вага не має значення, коли ти стрибаєш, як ніндзя."
    s "Не поводься як дитина."
    s ce "Зазвичай я була дуже мила до тебе."
    s neut oe "Скажи ж, Юрі."
    y nerv "Щ-що сказати? Що ти маєш на увазі?"
    s "Ти ж пам'ятаєш, що я не завдавала йому шкоди своїми стрибками, правда?"
    y "Я д-думаю, ні."
    y e1d "Ну, якщо не рахувати того дня, коли він вперше прийшов у клуб."
    show yuri ma
    s nerv "Це не рахується!"
    k "Ні-ні-ні, все рахується."
    show yuri happ oe cm
    show sayori at thide
    hide sayori
    show canon turned casual happ cm oe at t41
    hi "Згоден, хочу почути незручну історію про нього."
    
    mc "Не хвилюйся, ця історія не переплюне твої витівки."
    hi anno "Замовкни!"
    hi "Я піду поїм." #fadeout hiroto
    show sayori turned hoodie happ cm oe at t41
    show canon at thide
    hide canon
    y laug ce "М-мабуть, не варто вдаватися в подальші подробиці..."
    k sad e1a "Оу-у."
    show Kotonoha neut oe
    hi "Ой, та ну, розкажи нам!"
    show yuri oe
    mc "Леді сказала «ні», відчепися від неї."
    show yuri happ
    m neut "Чому ти не попросила мене підтримати тебе?"
    m "Це ж мій клуб, зрештою."
    s happ lup rup "Бо ти його дружина і зобов'язана стати на його бік!"
    show sayori ldown rdown
    k happ "Так, Моні, тепер у нас не може бути жодних упереджень, правда?"
    m "Я не зустрічалася з ним весь цей час, ти ж знаєш."
    m happ "До того, як ми почали зустрічатися, він більшість часу проводив із Сайорі, і я не помічала на ньому жодних ушкоджень."
    s "Бачиш? Навіть твоя дружина знає, що ти драматизуєш."
    mc "А що було після того, як ми почали зустрічатися?"
    m "Після того, як ми почали зустрічатися, я перестала звертати увагу на такі речі."
    m ce "Замість цього я зосередилася на стосунках із тобою."
    mc "...ти й справді вмієш змусити мене почервоніти, так?"
    m "Один із моїх багатьох трюків, ехе-хе-хе."
    show monika oe
    s "Гей, [player], я помітила снігопад на вулиці, не хочеш прогулятися?"
    mc "Звісно. Сподіваюся, зможу освіжити своє палаюче обличчя."
    mc "Не хочеш приєднатися, Мію?"
    mm "Ні, я краще помалюю." #offscreen
    mc "Тоді вирішено."
    show natsuki turned casual happ cm ce at t41
    show sayori at thide
    hide sayori
    n "Душа компанії прибула!"
    show miyuki casual e6 cm at t32 zorder 2
    show monika behind miyuki
    show Kotonoha behind miyuki
    mm "Тітко Нацукі!" #show Miyu
    show miyuki e4
    n oe "Власною персоною!"
    "Ого, Нацукі все ж прийшла."
    "До того ж, вхідні двері, схоже, не зачинені."
    show miyuki e7
    m "Нацукі, ти все ж змогла прийти."
    y "Добрий вечір, Нацукі."
    n "Привіт усім. Так, у мене вийшло зазирнути."
    n lhip rhip ce "Я б нічому не дозволила стати на моєму шляху сюди."
    n oe "Можете називати мене «модницею на виклик»." #жарт
    show natsuki ldown rdown
    mc "Гей, а твій хлопець не мав прийти?"
    n neut ce "Він, мабуть, занадто втомився."
    n happ oe "Хто його знає чому. Мені здавалося, йому буде легше, з додатковою парою рук."
    mc "О котрій ви почали готуватися?"
    n "О сьомій ранку."
    mc "Мабуть, у цьому й причина."
    "Не дивно, що він не зміг за нею встигнути."
    "У неї якийсь абсурдний запас енергії."
    n "Гей, а де твій чудний братик?"
    mc "На кухні."
    n ce "Піду-но його трохи підколю." #fadeout Natsuki
    show natsuki at thide
    hide natsuki
    show sayori turned hoodie neut cm oe at t41
    mc "Ох, вона не втрачає можливостей."
    mc "Не пробула тут і п'яти хвилин, а вже створює проблеми."
    mm "Я хочу з нею побачитися."
    mc "А як же твоє «творчість»?"
    mm "Потім домалюю."
    mm "Я ще не бачила тітку Нацукі, тож хочу провести з нею трохи часу." #fadeout Miyu #sad yuri
    show yuri sad
    show miyuki at thide
    hide miyuki
    "..."
    show Kotonoha neut
    show sayori neut
    mc "Не хвилюйся, Юрі. У тебе ще буде шанс поговорити з нею ближче до ночі."
    y "Сподіваюся на це, [player]."
    mc "Терпіння і труд все перетруть."
    show yuri neut
    mc "Не хочеш поки що прогулятися з нами?"
    y "Мабуть, я краще залишуся. Я рано встала, тож не хочу витрачати залишки енергії."
    mc "Чудово. Склади тоді компанію тим двом."
    show yuri happ
    mc "Якщо, звісно, Моніка не відмовиться від прогулянки."
    m "Ні. Без мене це місце швидко перетвориться на хаос."
    "Я й очікував, що вона так відповість. Але ви ж знаєте, ввічливість і все таке."
    k happ "Все гаразд, ми зможемо весело побалакати."
    k "Юрі, Моніка казала мені, що ти трохи «книжковий черв'як». Які книжки ти могла б порадити?"
    "О Боже, вона сказала чарівні слова."
    "Удачі, Кото. Це надовго."
    mc "Ходімо, Сайорі."
    show sayori happ
    s "Окей."
    #fadeout
    stop music fadeout 1.0

    scene bg house_snow_night with fade
    show snow
    show sayori turned hoodie happ cm oe at t11
    play music wonderland

    mc "Маєш якісь побажання щодо маршруту прогулянки?"
    s "Мені байдуже, ми ж далеко не підемо."
    s "Просто хочеться прогулятися під снігом."
    s nerv ce "...та й я переїла, тож вирішила, що прогулянка допоможе заспокоїти шлунок."
    show sayori neut oe 
    mc "Сюрприз-сюрприз, через переїдання у Сайорі болить живіт."
    s happ "Неможливо було уявити, правда?"
    mc "Я думав, що з більшим шансом на мене впаде метеорит, ніж таке станеться з тобою."
    s "Навіть так цей вечір все одно веселий."
    mc "Так, це було досить приємно. Не часто буваю у великих компаніях, тож це гарна зміна ритму."
    mc "Мію теж веселиться. Це ж була її ідея, тож я радий."
    s neut "До речі, про неї. Чому Юрі засмутилася, коли Мію вийшла з кімнати?"
    mc "Щодо цього..."
    mc "Насправді, нічого особливого. Юрі, як завжди, накручує себе, що вона не подобається Мію."
    s sad "О, ну, це погано."
    show sayori neut
    mc "Мені здається, вона просто занадто все обдумує."
    mc "Звісно, Міюкі трохи соромиться поруч із нею, але вона ніколи не показувала, що їй не подобається Юрі."
    mc "Вона просто трохи лякається її серйозності."
    s "Так, Юрі досить серйозна в цьому плані."
    s happ "Я маю на увазі, вона завжди була найдорослішою з нас."
    s "Мені здається, її характер перевернувся б з ніг на голову, якби вона дозволила собі розслабитися."
    mc "Можливо, але ти ж її знаєш."
    mc "Якщо не допомогти Юрі розслабитися, то вона такого в своїй голові накрутить, що мало не здасться."
    mc "Ось чому я з нею тоді поговорив, перед тим як ми пішли гуляти."
    s "Може, трохи пізніше я зможу їй допомогти."
    mc "Дій. Впевнений, вона буде рада твоїй пораді."
    mc "У тебе, мабуть, вже є якісь ідеї."
    s "Ага, є в мене кілька ідей, але всі вони про те, щоб просто бути дружелюбнішою до Міюкі."
    s neut "Наприклад, не треба розмовляти з нею так, ніби вона доросла чи підліток."
    s happ "Вона ж маленька дівчинка."
    mc "Почнемо з того, що Юрі не дуже товариська."
    mc "Скоріше за все, вона намагається говорити з усіма так, як зі своїми клієнтами."
    s neut "Знаєш, про що я подумала?"
    mc "Навряд чи."
    s happ "Мені здається, Юрі й Мію треба зустрічатися регулярно, а не випадково."
    mc "Ха."
    mc "Ти маєш на увазі, що їй треба проводити з нею стільки ж часу, скільки це робиш ти?"
    s "Ага."
    mc "Хм-м. Думаю, можна без зайвих вагань зробити їй таку пропозицію."
    mc "Я зовсім не проти, якщо вона буде заходити частіше."
    show miyuki winter at t22
    show sayori at t21
    mm "А ця «вона» буде заходити до мене частіше?"
    s ce "Ой, звісно, ти ж така чарівна!"
    mm e4 "Ехе-хе-хе-хе."
    show sayori oe
    mc "Гей, що ти тут робиш?"
    mm e7 "Я побачила тебе й тітку з вікна й прийшла привітатися."
    mc "І тобі захотілося трохи нам докучати?"
    mm m4 b3 "Гей! Я не докучаю вам!"
    show miyuki m9 b1
    s "Звісно ні, мила. Твій тато просто злюка."
    mc "Схоже, я знову в меншості."
    s "Ага."
    mm e7 om "Угу!"
    s "Весело проводиш ніч, Мію?"
    mm e4 "Так, тітко Сайорі!"
    s ce "Приємно чути."
    show sayori oe
    mm e7 "Тобі теж було весело?"
    s "Так, я теж не хотіла б, щоб це закінчувалося."
    s "Дякую за запрошення."
    mm e4 "Будь ласка, тітко Сайорі!"
    mc "Вся заслуга твоя, Мію. Зрештою, це була твоя ідея."
    mm "Ехе-хе-хе, і справді класно вийшло."
    show miyuki e7
    mc "Впевнений, так і є."
    s "Було б добре зробити таке святкування традицією."
    s "Для різноманіття можна змінювати дім, де будемо святкувати."
    mc "Непогана ідея."
    mc "Тільки тобі знадобиться більше місця, щоб влаштувати вечірку."
    s ce "Я вже працюю над цим, не хвилюйся."
    show sayori oe
    mc "Подумаємо про це детальніше після того, як відсвяткуємо цей рік."
    mc "На крайній випадок, можемо все спланувати заздалегідь, щоб не робити все навмання."
    mm m4 "Що таке «навмання»?"
    show miyuki m9
    mc "Це означає, що ми все робимо поспіхом і випадково."
    mm om "О-у, гаразд."
    s "Якщо у нас буде план на Новий рік, то можна, наприклад, влаштувати «таємного Санту» чи ще якісь розваги."
    mc "Ага, звучить весело."
    mm m4 "Зачекайте. Але Санта ж не таємний, всі знають, що він є."
    show miyuki m9
    s "Ні, ні, Мію. «Таємний Санта» насправді не пов'язаний із тим самим Сантою."
    s "Це гра, в якій кожен купує комусь подарунок так, щоб інша людина не знала, хто їй його купує."
    mm om "О, це весела гра."
    s ce "Так і є!"
    show sayori oe
    mc "Добре, обов'язково спробуємо це наступного року."
    mc "Але якщо врахувати, що у нас і так вже йде святкування, нам треба повертатися."
    s "Так, ти правий. Дякую, що все ж вийшов зі мною на вулицю."
    mc "Звісно, мені, якщо чесно, теж треба було подихати свіжим повітрям."
    mc "У будинку трохи задушливо."
    mm "Але це все ж краще, ніж мерзнути тут, тату."
    mc "Я не проти трохи постояти на холоді."
    mc "Але мені здається, що я вже не «трохи» насолоджуюся холодом. Давайте повертатися всередину."
    mc "Мені все одно треба поговорити з тіткою Нацукі. Вона прийшла трохи раніше, ніж ми вийшли."
    mm e4 "Вона була на кухні й дражнила дядька Хірото."
    show miyuki e7
    mc "Ха-ха, гарна робота."
    show sayori neut
    mc "Сподіваюся, Нацукі ще не закінчила. Коли повернемося, хочу подивитися на це шоу."
    s anno "Гей, тобі не варто було так казати при ній."
    mc "Тоді розкажи Моніці про мене, побачимо, чи мені буде байдуже."
    s mb "А я ж можу й розказати."
    show sayori ma
    mc "Я візьму на себе всю відповідальність пізніше. Досить балачок, ходімо швидше."
    #fadeout
    stop music fadeout 1.0

    scene bg kitchen with fadehold
    show natsuki turned casual happ cm oe at t22
    show canon turned casual anno cm oe at t21
    play music chillvibes

    hi "ПОСЛУХАЙ!"
    hi "Ти не можеш говорити зі мною зверхньо лише тому, що твій бізнес успішніший за мій, який я тільки-но почав."
    n rhip "Я можу хоч цілий день так говорити, бо твої ідеї неймовірно дурні."
    hi ce "Мої плани перспективні. Все, що мені потрібно — це час і терпіння."
    n ce "А як же «Божа допомога»?"
    hi oe "Побачимо, як ти будеш сміятися, коли я зароблятиму вдома більше, ніж ти у своїй пекарні."
    n oe cross casual happ "Подзвони мені, як тільки це станеться, щоб я могла сказати, що плювала на твої ідеї з високої дзвіниці."
    hi mc "За це ти будеш першою, кому я подзвоню!"
    show canon mb
    n turned casual happ oe "Чекаю не дочекаюся."
    mc "Якщо він тобі подзвонить, подзвони й мені теж."
    mc "Я б із задоволенням послухав, як пройшла розмова."
    n "О, привіт, [player], де ти пропадав?"
    mc "На вулиці."
    n neut "Дивне місце ти вибрав для вечірки в приміщенні."
    mc "Ми з Сайорі вийшли на хвильку подихати свіжим повітрям."
    n "Зрозуміла."
    show canon neut cm oe
    n happ "Обов'язково виконаю твоє прохання, але я ще й впевнена, що мені цього робити не доведеться."
    mc "Так, я теж у цьому впевнений."
    hi anno "Ви просто мої хейтери."
    mc "Я часто ненавиджу твої ніколи не працюючі дурні ідеї, тож так."
    hi "Ти жорстокий, знаєш?"
    mc "Гірка правда."
    show canon neut
    "І йому дуже потрібно це почути."
    n rhip "Гаразд, досить про цю нісенітницю."
    n rdown "Я промовчала про це, але в мене з собою є випічка для вечірки."
    hi happ "О, дуже круто з твого боку."
    n anno "Назви мені хоч одну причину, чому я маю поділитися з тобою хоч чимось, дурнику."
    hi nerv "Бо зараз сезон дарування?"
    n happ ce "Пф-ф-ф, так, точно."
    show canon neut
    mc "Чесно кажучи, я здивований, що тут досі не з'явилася Сайо-"
    show natsuki neut oe at t32
    show canon at t31
    #show Sayori excited
    show sayori turned hoodie happ mb oe at t33
    mc "..."
    mc "Ти щось хотіла?"
    s om "Я все чула."
    s "З сусідньої кімнати."
    s "Випічка."
    s "Від Нацукі."
    s "ВОНА МЕНІ ПОТРІБНА. ЗАРАЗ ЖЕ."
    n happ "Так, так, пригощайся."
    n neut "Тільки не сходь з розуму, вона для всіх."
    s "Тоді всі мають бути тут, щоб усе було чесно."
    n angr e4c "Це не так працює!"
    show natsuki oe
    s ce  "Для мене саме так і працює."
    show sayori oe
    n ce "Все, я несу їх в іншу кімнату."
    show natsuki at thide
    hide natsuki
    show canon at t21
    show sayori at t22
    #fadeout Natsuki
    s ce "Нацукі-і-і-і, ти ж знаєш, що я просто піду разом із тобою!"
    s oe "Але спершу хочу сказати, що я поговорила з Юрі."
    mc "Оу?"
    s "Так, я розповіла їй, про що ми говорили і що вона може зробити, щоб більше зблизитися з Мію."
    s ce "Здається, вона це сприйняла близько до серця, тож побачимо, як усе піде!"
    show sayori oe
    mc "Гарна новина."
    s "А тепер, вибачте мене."
    show sayori at thide
    hide sayori
    #fadeout Sayori
    show canon at t11
    hi "У тебе дивні друзі."
    mc "Зате вони в мене є."
    hi anno "Замовкни, у мене теж є друзі!"
    mc "Люди з інтернету не рахуються."
    hi "А от і рахуються."
    hi ce "Якщо я не знаю, хто вони насправді, це не означає, що ми не друзі."
    show canon oe
    mc "Ага, продовжуй переконувати себе в цьому."
    show canon neut
    mc "Ну а поки ти цим займаєшся, я піду і насолоджуся випічкою Нацукі."
    hi happ "Принеси й мені трохи. Маю відчуття, що сама вона мені нічого не дасть."
    mc "Я подивлюся, що можна зробити, але нічого не обіцяю."
    #long fadeout
    stop music fadeout 1.0

    scene bg living_room_night_christmas2 with fadehold
    show sayori turned hoodie happ cm oe at t21
    show monika forward_yellow happ cm oe at t22
    play music firelofi
    "Загалом, це був веселий вечір."
    show sayori om
    "Проста й приємна ідея для вечірки." #show Sayori and Monika in background "Chatting"
    show sayori cm
    show monika om
    "Моніка справді приготувала забагато їжі, але я впевнений, що Сайорі спробує забрати більшу частину із собою, тож усе гаразд."
    show sayori om ce 
    show monika cm
    "Нацукі, Котоноха й Хірото пішли рано, що було трохи прикро, але сама вечірка не була запланована заздалегідь, тож ми все розуміємо."
    show monika om
    show sayori cm oe
    "Принаймні, Юрі й Сайорі ще тут."
    show sayori om 
    show monika cm
    "...взагалі-то Юрі вже давно до нас не спускалася."
    show monika om
    show sayori cm oe
    "Вона запропонувала вкласти Мію спати, але це було аж півгодини тому."
    show sayori om 
    show monika cm
    "Краще загляну до них і переконаюся, що все добре."
    stop music fadeout 1.0

    scene bg hallway with fade
    play music yuri_theme

    "Хм, там досить тихо."
    #show Yuri
    show yuri turned casual happ cm oe at t11
    y "О, привіт, [player]."
    y ce "Я не могла спуститися, вона буквально щойно заснула."
    show yuri oe
    mc "Ха, це зайняло трохи часу."
    y laug "Н-ну, спочатку я просто хотіла вкласти її й повернутися у вітальню."
    y e1d lup rup "Але потім вона попросила мене прочитати їй казку!" #hopeful eyes
    y happ ce "Вона дуже цього хотіла."
    show yuri ldown rdown
    mc "Бачиш? Я ж казав, що вона тебе не ненавидить."
    y laug oe "Мабуть, я неправильно оцінила її сором'язливість."
    mc "Я ж так само казав."
    show yuri e1d
    mc "...Ти ж не читала їй жахи?"
    y neut oe "Звісно, ні! Навіщо мені таке читати?"
    mc "Просто хотів переконатися. Лише Бог знає, що ти іноді можеш утнути."
    y worr "Н-невже я така безвідповідальна?"
    show yuri neut
    mc "Пам'ятаєш, як у школі ти вирішила показати мені свою колекцію ножів?"
    y "Так, пам'ятаю. А до чого це?"
    mc "Знаєш... не так уже й важливо."
    mc "Головне, що ти досягла певного прогресу у стосунках із Міюкі."
    mc "Може, якщо ти будеш частіше до нас заходити, їй буде комфортніше з тобою."
    y "Я можу спробувати, але мій робочий графік дуже завантажений, і в мене не так багато вільного часу."
    mc "Нічого страшного, вона все одно більшість часу проводить у школі. Просто заходь ближче до вечора, коли вона вільна."
    y happ "Добре, я повідомлю, коли зможу прийти наступного разу."
    mc "Чудово. А тепер ходімо назад у вітальню, щоб не розбудити її балачками."
    y ce "Ой, звісно."

    scene bg living_room_night_christmas2 with fade
    show monika forward_yellow happ cm oe at t33
    show yuri turned casual happ cm oe at t31
    show sayori turned hoodie happ cm oe at t32


    m "З поверненням."
    y "Дякую."
    mc "Добре знати, що мене раді бачити у власній вітальні."
    m rhip ce "А мало б бути інакше?"
    mc "Безперечно."
    m oe "Юрі, як там Мію? Не бешкетувала перед сном?"
    y ce "Ні, я прочитала їй казку на ніч, і вона заснула."
    show yuri oe
    m ce rdown "Оу-у, це добре."
    m oe "Я досить часто читаю їй казки на ніч, зазвичай це допомагає."
    s "Я б хотіла, щоб хтось читав мені казки на ніч. Читати книжки наодинці нудно."
    show yuri anno
    mc "Хіба «нудьга» не пришвидшує процес засинання?" #yuri annoyed in the background
    s neut "І то правда..."
    show yuri neut
    m "Ось що, Сайорі: якщо ти колись залишишся тут на ніч, я прочитаю казку вам обом."
    s happ "Домовилися."
    "Її так легко зробити щасливою. Це мені в ній подобається."
    mc "Попередьте мене заздалегідь про ваш сеанс, щоб я міг уникнути цього жаху."
    s anno "Злюка."
    show monika ce om 
    m "Ахахах."
    show monika oe cm
    show sayori neut
    y "Хотіла б залишитися довше, але завтра зранку маю сімейні справи, тож мені час іти."
    s happ "Так, мені теж краще йти. Треба буде потрапити до батьків рано-вранці."
    m "Давайте проведемо вас до прихожої."
    #frontdoor
    scene bg entrance_night with wipeleft
    show monika forward_yellow happ cm oe at t33
    show yuri turned casual happ cm oe at t32
    show sayori winterhoodie happ cm oe at t31
    m "Добре, дякую, що прийшли, дівчата."
    y "Мені було дуже приємно, дякую за веселий вечір."
    s ce "Так, було дуже весело!"
    s oe "Чекаю не дочекаюся такої ж вечірки наступного року!"
    m neut "«Такої ж вечірки наступного року»?"
    mc "Я потім поясню."
    show monika happ
    mc "Загалом, дякую, що прийшли, друзі. Побачимось пізніше."
    y ce "На добраніч."
    show yuri oe
    s "Можливо, завтра ще заскочу ненадовго. Якщо що, чекайте від мене повідомлення."
    mc "Радий це чути, Сайорі."
    s ce "Хе-хе. На добраніч, друзі!"
    show monika at t11
    show sayori at thide
    hide sayori
    show yuri at thide
    hide yuri
    stop music fadeout 1.0

    #fadeout Sayori and Yuri, then fadeout
    # fade in living room, monika eyes shut
    scene bg living_room_night_christmas2 with fadehold
    show monika forward_yellow happ cm ce at t11
    play music wonderland
    m "Це була приємна ніч."
    mc "Ти виглядаєш трохи втомленою."
    m laug ce "«Трохи»? З мене висмоктали всі сили."
    m oe "Було весело й усе таке, але яких зусиль це коштувало."
    show monika ma
    mc "Якщо ти втомилася, можеш іти спати, а я приберу."
    m ce om "Ні-ні-ні, я можу... допомогти..."
    show monika ma
    mc "Я наполягаю, кохана, відпочинь трохи."
    mc "Взамін ти доглянеш за Мію з самого ранку, якщо вона прокинеться раніше."
    m om "М-м-м, домовилися." #smiling eyes still closed
    m happ ce "Але не затримуйся, я хочу обіймашок."
    mc "Ти чарівна. Я ненадовго, не хвилюйся."
    m "М-м-м, гаразд."
    m "Скоро побачимось, коханий."
    show monika at thide
    hide monika
    
    #fadeout monika
    "... ага, хотілося б."
    "Якщо вона дочекається мого повернення й не засне, я з'їм обгортку від цукерки." #у літературній українській завжди спочатку умова, потім наслідок
    "Це нагадало мені, що в мене є чудова можливість розкласти подарунки."
    #fadeout fadein, gifts under tree this time
    scene bg living_room_night_christmas with fade
    "Ось так, тепер усе гаразд."
    "Я знаю, що в Моніки є свої плани щодо розташування подарунків, але мене така «планування» не хвилює."
    "Якщо що, вона зробить як вважатиме за потрібне завтра зранку."
    "Крім того, мені спершу треба прибрати на кухні, а потім лягти спати."
    "Завтра знову доведеться рано вставати."
    stop music fadeout 1.0
    #fadeout












