label story3:
    scene black
    with fadehold
    window hide dissolve
    pause 2.0

    show screen end3 with fade
    pause 5.0
    hide screen end3
    pause 2.0
    screen end3:
        text "21 грудня" yalign 0.5 xalign 0.5
    scene bg altcafe with dissolve_scene_full
    show miyuki casual at t32
    show Kotonoha sweater neut cm oe at t33
    show monika forward_casual neut cm oe at t31
    play music cafe
    k rhip lup "То навіщо тобі було знімати дверний дзвінок?"
    k anno "Він там сидить і ниє, що я його рано розбудила."
    k ce ldown "Так по-дитячому, знаєш."
    show Kotonoha neut oe
    m "Мені здається, йому не треба було так робити, якщо тобі це цікаво."
    k rdown "Мені теж!"
    k "Ну, якщо ти не хочеш, щоб тебе рано будили, просто скажи це."
    k dist "Не треба драматизувати похід у торговий центр."
    show Kotonoha neut
    m curi rhip "Це все?"
    k "Дурно, так?"
    m neut rdown "Дуже."
    mm om "Я люблю ходити по торгових центрах."
    k happ "І я люблю, Мію, але мій хлопець просто дурненький."
    mm "Він звучить дурненько."
    k "Всі хлопці – дурні, але ми їх все одно любимо."
    k "До речі, як просувається планування вечірки?"
    m happ "Просувається добре, Міюкі і я будемо декорувати, а [player] після роботи принесе ялинку."
    k neut ce "Я досі не можу повірити, що він так довго відкладав."
    show Kotonoha oe
    m neut "Я знаю, але я теж винна."
    m "Ми обидва були дуже зайняті останнім часом."
    k "Ага, мабуть, все чесно."
    k happ "Але, ей, краще пізно, ніж ніколи, правда?"
    m laug ce "Я не думаю, що він відпустив би нас без ялинки, ага."
    show monika ma
    mm "Не може бути Різдва без ялинки."
    show monika happ oe cm
    k "Це правда, і ти не дай нікому це забути."
    mm e4 "Хе-хе, не дам!"
    show miyuki e7
    k ce "Хороша дівчинка."
    m "Уже не треба давати їй купу ідей, її батько вже зайнятий ними."
    k oe "Доведеться віддати їх комусь, а у мене ще немає дитини."
    m ce "Краще поквапся!"
    k angr ce md "Так, звичайно, як тільки мій молодий чоловік достатньо подорослішає, щоб не знімати дверний дзвінок через всяку дурню."
    $ km_name = "Кото і Моні"
    show Kotonoha happ ce om
    show monika om
    km "Ха-ха-ха!"
    show monika oe cm
    k om oe "Так чим ви двоє будете зайняті до кінця дня?"
    m "Як я і сказала, прикрасимо дім, потім додому і готувати вечерю."
    k "Не заперечуєте, якщо я приєднаюся до вас? Сьогодні вдень робити нічого."
    m "Звичайно."
    m "Думаю, Міюкі не заперечує."
    mm e4 "Нє-а!"
    k ce "Чудово!"
    show Kotonoha oe
    mm e7 "А звідки ми візьмемо декорації?"
    m "Десь у торговому центрі, сонечко."
    m "Швидше за все, ми знайдемо там все, що нам потрібно."
    mm "О, добре."
    m neut "Так твій хлопець теж збирається піти на вечірку, Кото?"
    k neut "Ні, працює цього вечора."
    k anno rhip "Допізна..." #annoyed
    m sad mg "Ох, не пощастило."
    show monika md
    k ce "Сама знаю."
    show monika neut cm oe
    k neut oe "Не будемо на цьому зациклюватися."
    k happ "Адже ви, дівчатка, будете тусити весь вечір."
    mm e4 "Це буде супер весело!"
    show miyuki e7
    k ce "Саме так, Мію."
    k oe "А хтось ще прийде?"
    m happ "Тільки три члени мого клубу з старшої школи."
    k "Це весело, по факту, як маленьке возз'єднання."
    m ce "Ну типу того, хе-хе, ну тобто, ви бачитеся іноді, але буде весело зібратися всім разом, як раніше."
    k rhip "Там всі дівчатка, так?"
    m oe "Ага, тільки ми вчетвером і [player]."
    k ce rdown "Хе-хе, він приєднався до повного дівчаток клубу і вибрав найкращу, який хитрун."
    m laug ce n4 "Перестань." #bashful
    show monika ma oe
    k oe "Я жартую! А якщо серйозно, то було б непогано завести ще друзів."
    show monika happ n1 cm
    k ce "Більше виправдань, щоб затягнути мого хлопця в торговий центр, ха-ха-ха!"
    m neut "Ну, Юрі не фанатка прогулянок по торговому центру, але інші дві іноді ходять, так що з ними тобі може пощастити."
    k oe "Рада чути."
    show monika happ cm
    mm "Іноді тітка Сайорі і я разом ходимо в торговий центр."
    k "О, так?"
    mm e4 "Ага-ага, вона дуже мила."
    k "Я вірю в це."
    m "Мію любить свою тітку Сайорі."
    mm back om e7 "А тітка Сайорі любить мене!"
    m ce "О, так, не сумніваюся."
    show miyuki neutral cm
    k "Це та, з ким [player] працює, так?"
    m oe "Так, їй трохи не пощастило з роботою, тому він найняв її, коли став менеджером."
    m "Він завжди був таким турботливим."
    k ce "Хе-хе, може, треба його звести з моїм хлопцем, щоб він чомусь навчився."
    show Kotonoha oe
    m laug n4 "Не знаю, чи буде це вдалим, але можеш спробувати, хе-хе." #bashful again
    show monika n3 neut
    mm "Мама, коли ми вже підемо?"
    show monika n1
    mm m4 "Тут нудно!"
    show miyuki m9
    m "Почекай пару хвилин, сонечко, не треба поспішати."
    k "Ну, можете почати, якщо ти не проти."
    k "Ми завжди зможемо походити і побалакати."
    show miyuki cm
    m happ "Тоді добре, збираємося."
    m neut "А я тут подумала, де твоє пальто?"
    k neut "Ох, я його залишила в машині."
    k happ "Я б все одно зняла його, так що подумала, що коротка прогулянка по холоду мене не вб'є."
    m happ "Ага, нам теж слід було так зробити."
    mm "Я в порядку, мам."
    m "Добре, ну що ж, йдемо за покупками для вечірки."
    mm "Я візьму з собою в центр гарячий шоколад, добре?"
    m "Звичайно."
    mm e4 "Окей."
    #fadeout
    stop music fadeout 1.0

    scene bg grocery with fadehold
    show Himari left casual at t11
    play music clubs

    h m2 "Вибачте, у вас є динна содова?"
    show Himari m1
    "У тебе все в порядку з головою? Хто так одягається взимку?!"
    mc "Так, он там, ззаду за бутильованою водою."
    h m5 "Я тільки що там була і не знайшла ніякої динної содової."
    show Himari m4
    mc "Вона там є, повірте."
    h m5 "Може, покажете?"
    show Himari m4
    mc "Звичайно."
    mc "Якщо ви повернетесь, я буду радий вказати на зелені пляшки прямо звідси."
    h m5 b3 e3 "Я хочу, щоб ви привели мене до них, а не тикали пальцем."
    show Himari m4
    mc "..."
    "Х-х-х-х."
    show Himari b1 e1
    mc "Добре, йдіть за мною."
    h m2 "Дякую."
    show Himari m1
    mc "Нема за що."
    #fade out fade in

    scene bg grocery with fade
    show Himari left casual at t11
    mc "Це все?"
    h m2 "Так."
    h "Плачу по картці."
    show Himari m1
    mc "Прикладайте."
    mc "..."
    mc "А на вулиці не холодно, щоб так одягатися?"
    h m5 "У мене є машина, як я можу замерзнути, пройшовши три метри до магазину?"
    show Himari m4
    mc "Напевно..."
    show Himari m1
    "Видимо, я ідіот."
    mc "Ось ваш чек."
    h m2 "Дякую, гарного дня."
    show Himari m1
    mc "І вам." #fadeout himari
    show Himari at thide
    hide Himari
    "Сюди заходять стільки різних людей."
    "Принаймні, сьогодні трохи веселіше."
    "Ще й Сайорі немає, щоб вона мене веселила, так що без покупців я можу взагалі померти від нудьги."
    "Звичайно, можна полазити в телефоні, але надовго це мене не відволіче."
    #*bzzt*
    play audio phone
    "О, до речі про це."

    h_nvl "Вечірка на честь кануна Різдва?"
    h_nvl "І вибач, що так довго не відповідав, довга ніч"
    "Не запитував. Звик до цього." #Лишня точка
    mc_nvl "Так, вечірка на честь кануна Різдва, ти зможеш прийти чи ні?"
    h_nvl "Напевно, хтось з моїх знайомих буде там?"
    mc_nvl "Твоя сім'я, дибіл"
    mc_nvl "Але крім них — ні, тільки друзі мої і Моники"
    h_nvl "Не треба поспішати"
    mc_nvl "Ти завжди змушуєш мене поспішати"
    h_nvl "Ну, я, швидше за все, прийду, задоволений?"
    mc_nvl "Скажи найвічливіше слово, щоб я був впевнений"
    h_nvl "Срака"
    mc_nvl "Добре, я на роботі, я напишу потім, в скільки тобі приходити"
    h_nvl "Ок"
    h_nvl "Побачимось"
    mc_nvl "До скорого"

    "Схоже, підготовка до вечірки в самому розпалі."
    "Якщо я цим займуся, я можу це перетворити в массовий захід."
    "Сподіваюся, Нацукі зможе це реалізувати."
    "О, знаю, чим зайнятися!"
    "Можу їй зателефонувати і пранканути її."

    #*ringing sounds*
    play audio dial
    window hide dissolve
    pause 7.0
    show natsuki turned casual anno cm oe at t31
    show natsukisplit behind natsuki
    n "Шо?" #bakery split screen #annoyed
    mc "Господи, ти так завжди відповідаєш на дзвінки клієнтів?"
    n neut "[player]?"
    mc "Так..."
    n happ "О, здоров! Як справи?"
    mc "Так нормально, я хотів тебе пранканути, але ти відповіла так грубо..."
    n neut "У-у-у, у мене немає часу на люб'язності, моя робота говорить за мене."
    mc "Ти така трудолюбива."
    n happ "Я знаю."
    n ce "Економить мені багато часу, щоб не витрачати його на телефонні розмови."
    mc "Ти можеш хоча б повідомляти їм, що вони подзвонили куди треба."
    n neut oe "Ей, моя робота — це не перевіряти їхню роботу, мій номер не змінюється, так що вони не можуть облажатися."
    mc "Ти просто промінь сонця, ти знаєш це?"
    n happ "Мій хлопець теж так думає."
    n neut "О, до речі про нього,ви ж не проти якщо я його запрошу на вечірку?"
    mc "Звичайно, чому ні."
    n happ "Круто, тому що він допоможе мені на роботі перед святом, так що, сподіваюся, ми виберемося раніше."
    mc "Наявність раба на день напевно полегшить це."
    n "Він швидше учень."
    mc "З дуже суворим вчителем."
    n "Я не буду з ним сюсюкатись тільки тому, що ми в стосунках."
    n ce "Я ж, в кінці кінців, професіонал."
    show natsuki oe
    mc "Якщо ти так кажеш."
    n neut "Так ти дзвонив просто щоб мене дістати, чи ще щось є?"
    mc "Ні, тільки щоб дістати."
    mc "Якщо тільки ти не хочеш залишитися на лінії, поки я намагаюся замовити якусь дурню."
    n anno "Не хочу."
    mc "Тоді добре, я тобі дозволяю повертатися до роботи."
    n happ "Окей, передай Мію і Мониці привіт від мене."
    mc "Добре, пізніше поговоримо ще."
    show natsuki at thide
    hide natsuki
    show natsukisplit at thide
    hide natsukisplit

    "Що ж, вийшло не те, на що я розраховував, але, тим не менш, було цікаво."
    "Думаю, зараз варто трохи зайнятися роботою."
    #*bzzt*
    play audio phone
    "Ох, що ще?"

    h_nvl "Вибач, що знову відволікаю від роботи, але можна в тебе зайняти трохи грошей?"
    h_nvl "Тільки до зарплати"
    mc_nvl "І коли ж вона буде?"
    h_nvl "...Коли у мене з'явиться нова робота, напевно?"
    mc_nvl "Що ж, ні"
    h_nvl "Спробувати варто"
    mc_nvl "Ага, так"

    "Ох вже цей хлопець."
    "Я ж навіть пропонував йому попрацювати зі мною."
    "Він каже, що фізична праця – не для нього."
    "В будь-якому випадку."
    "Цього разу точно повернемося до роботи."
    #fadeout
    stop music fadeout 1.0

    scene bg kitchen with fadehold
    show miyuki casual at t22
    show monika forward_casual happ cm oe at t21
    play music chillvibes

    mm m4 "Коли тато прийде додому?"
    show miyuki m9
    m "Скоро, доню, він повинен купити ялинку."
    mm m4 "Ох."
    mm b2 "...А йому для цього не потрібна машина?"
    show miyuki m9
    m neut "Можливо, але він не просив."
    mm "Чому?"
    m "Бо тато дуже впертий."
    show miyuki b1
    m "Якщо чесно, це в тобі теж є від нього."
    mm om e4 "Ехе-хе-хе."

    m anno "Нічого хорошого в цьому немає, міс смішинка."
    mm "А я думаю, є!"
    mm e7 "Тато, мабуть, теж так думає."
    m ce mb "О, я не сумніваюся."
    m happ oe om "Він дуже тобою пишається."
    m dist "Можливо, не з тих причин."
    show monika neut
    mm "Краще вже так, ніж якби він взагалі мною не пишався."
    m happ ce "Так, і це правда."
    m oe "Але я знаю, що він завжди тобою пишається, незважаючи ні на що."
    mm m4 "Справді?"
    show miyuki m9
    m "Звичайно."
    mm om "Вау!.."
    m "Тепер, не хочеш допомогти мені з вечерею?"
    mm e4 "Хочу!"
    show miyuki m9 e7
    m ce "Молодчинка, сьогодні ти будеш моїм маленьким кухарчиком."
    show monika oe
    mm "Що я можу зробити?"
    m "Ти можеш допомогти мені зважити й змішати інгредієнти."
    mm "Звучить весело."
    m "Мені подобається твій ентузіазм!"
    m ce "Це точно від мене, а-ха-ха."
    mm "Я дуже схожа на тебе."
    m oe "Ще й як!"
    m "Ти така ж, як я була у твоєму віці."
    mm back e4 "Круто!"
    show miyuki neutral e7
    m "Дуже круто. Як щодо курячого теріякі на вечерю?"
    mm e4 "М-м-м!"
    m ce "Вважаю це за «так»."
    show miyuki e7
    m oe "Що ж, маленька помічнице, йди до холодильника і принеси перець, гриби, цибулю, моркву, селеру і шпинат."
    mm m4 "Як багато!"
    show miyuki m9
    m "Ну, мамі треба щось їсти, крім курки, пам'ятаєш?"
    mm om b2 "О, так, забула."
    m "Нічого страшного, мила, саме тому я іноді роблю трохи більше порцій."
    m "Ти готова мені все це принести?"
    mm e4 "Ага!"
    show miyuki e7
    m ce "Молодчинка."
    #fadeout Miyu
    show miyuki at thide
    hide miyuki
    show monika at t11
    m oe "Поки ти все несеш, я займуся куркою."
    #fadeout/fadein
    scene bg kitchen with fadehold
    show miyuki casual at t22
    show monika forward_casual happ cm oe at t21

    m "Окей, тепер, коли все готово, можеш йти посидіти за столом, поки я готую."
    mm m4 "А можна мені і тут допомогти?"
    show miyuki m9
    m neut "Поки ні, я готую з олією, воно бризкає, і я не хочу, щоб ти обпеклася."
    mm b2 om "Оу-у, гаразд."
    show miyuki b1
    play audio dial
    window hide dissolve
    pause 3.0
    m "О, це твій тато."
    m "Спочатку йому відповім, потім візьмуся за приготування."
    #splitscreen kitchen/street
    show resident_snowsplit

    show monika at t43
    show miyuki at t44
    m happ "Привіт, коханий."
    mc "Привіт, кохана."
    m "Як справи? Як робота?"
    mc "З роботою нормально, нічого особливого."
    m "Це добре."
    mm e4 "Привіт, тату!"
    show miyuki e7
    m "Мію передає привіт."
    mc "Привіт, Мію."
    m "Тато передає тобі привіт."
    show miyuki e4
    m "Так, чого дзвониш?"
    show miyuki e7
    mc "Хотів сказати, що ялинку вже купив."
    mc "Можеш бути в мені впевнена."
    m ce "Я завжди в тобі впевнена."
    m oe "Хочеш, щоб ми приїхали забрати тебе?"
    mc "Ні, тут недалеко, я дійду пішки."
    m neut "До-о-о-обре, як хочеш."
    mc "Так, як я хочу."
    m happ "Я просто рада, що ти знайшов ялинку, можемо прикрасити її сьогодні ввечері або завтра."
    mc "Краще сьогодні ввечері, буде чим зайнятися після вечері."
    m "Добре, домовились."
    mm m4 "Про що домовились?"
    show miyuki m9
    m "Ми прикрасимо ялинку сьогодні після вечері."
    mm e4 om "Ура!!!"
    m ce "Вона дуже рада."
    mc "Трішки, а-ха-ха."
    m oe "Я якраз збиралася готувати вечерю, коли ти подзвонив."
    show miyuki e7
    m "У нас жарке."
    mc "Чудово, займайся цим."
    mc "Скоро побачимось, кохана."
    m ce "Окей, люблю тебе."
    mc "І я тебе, бувай."
    m oe "Бувай." #end split screen, далі тільки mc
    show monika at thide
    hide monika
    show miyuki at thide
    hide miyuki
    scene bg resident_snow with dissolve
    "..."
    "І чому я відмовився від підвозу?"
    "Звісно, я не {i}так{/i} далеко від дому."
    "Але, блін, це дерево так незручно тягнути."
    "Пора перестати бути таким впертим."
    "...Водночас я не збираюся дзвонити і просити підвезти."
    "Настільки сильно, наскільки я впевнений, що вона цього чекає..."
    "Але ні, я ж винахідливий!"
    "Я щось придумаю!"
    "..."
    "..."

    play audio dial
    window hide dissolve
    pause 7.0
    #phone popup, call Sayori several rings, split screen between street, sayori random living room

    show sayori turned casual neut cm oe at t31
    show sayosplit behind sayori
    s "О, привіт?"
    mc "Є питання."
    s anno "Люди мають спочатку вітатися, коли дзвонять, знаєш."
    mc "Ну так, але ти й так знаєш, що це я, навіщо паритись?"
    s "Це називається ввічливість."
    mc "До речі про ввічливість, повернемось до мого питання."
    s ce "Дай вгадаю, щось по роботі?"
    mc "Ні."
    s neut oe "А що тоді?"
    mc "Без подробиць, але я недалеко від твого дому, і мені треба дотягти ялинку."
    mc "Можеш допомогти?"
    s curi "...А у тебе немає машини?"
    mc "Фактично, це у Моніки є машина."
    s neut "Тоді попроси у неї."
    mc "Та-ааак, щодо цього."
    mc "Вона могла запропонувати, а могла й ні."
    mc "І я міг відмовитись, а міг і ні."
    mc "Деталі розмиті."
    s anno "Тобто твоя гордість завадила, і тепер ти хочеш, щоб я тебе виручила."
    mc "По суті, так."
    s "...І що я отримаю взамін?"
    mc "Щире дякую і трохи різдвяного настрою?"
    s ce "Мало, бувай."
    mc "Почекай!"
    s oe "Слухаю."
    mc "Я підміню тебе двічі у твої зміни, і!.."
    mc "І скажу Чеду, що ти новий помічник менеджера і можеш командувати ним."
    s happ "Домовились!"
    mc "Чудово."
    "Чед досить наївний, щоб повірити, що маленькому магазину біля дому потрібен помічник менеджера, тож має спрацювати."
    s neut "Де ти зараз конкретно?"
    mc "Я ще трохи протягну цю штуку, поки не побачу назву вулиці, і потім напишу."
    s happ "Добре, я одягнуся і вийду до тебе."
    mc "Дякую, Сайорі."
    s "Ні, тобі дякую, мені буде весело командувати Чедом."
    mc "Я не казав, що ти будеш ним командувати, просто даю тобі технічну перевагу."
    s "Те ж саме."
    mc "...Загалом, скоро побачимось."
    s ce "Угу!" #end call
    show sayori at thide
    hide sayori
    show sayosplit at thide
    hide sayosplit
    "Що ж, питання вирішене."
    "Звісно, тепер я маю працювати дві її зміни, поки зарплату отримуватиме вона..."
    "Ну, гаразд."
    "Це того варте."
    "Тепер просто треба дійти до знака з назвою вулиці."
    "Було б краще, якби я знав назву, але я тут не так часто буваю."
    "Мабуть, треба це виправити..." #fadeout
    stop music fadeout 1.0

    scene bg house_snow with fadehold
    show snow
    play music snowyjazz
    show sayori winterwork happ cm oe at t11
    s "Ну що, впорались."
    mc "Якщо чесно, виглядало так, ніби ми її вкрали."
    s neut "Не моя проблема, це ти погано плануєш."
    mc "Я й не казав, що він був хороший."
    s happ "Точно. Ти такий переконливий."
    mc "Знаєш, не обов'язково було зловтішатися."
    s "Я знаю, просто подарунок."
    mc "Ха-ха-ха."
    mc "А якщо серйозно, велике тобі дякую."
    mc "Навіть якщо це коштувало мені невеличкої послуги..."
    s "Я сьогодні добра, кажу, що треба відпрацювати лише одну мою зміну."
    s ce "Але Чеду все одно скажи."
    mc "Домовились."
    s "І я так думаю." #gleeful
    s oe "Мію рада, що скоро Різдво?"
    mc "Чесно, здається, вона майже забула про Різдво через підготовку до вечірки."
    s neut "Але ж це {i}різдвяна{/i} вечірка."
    mc "Так, але вона, мабуть, забула, що Різдво вже завтра."
    mc "Вона дуже чекає цю вечірку."
    s happ "Вона чарівна."
    mc "Ще й яка."
    s "Ну, мені пора додому."
    mc "Вірно."
    mc "О, до речі, попередь завчасно, коли тебе треба підмінити."
    s neut "Не обіцяю: може, раптом знадобиться, і попереджу за дві години."
    mc "...Добре."
    mc "Ти дуже відповідальна, так що все нормально."
    s happ "Дякую."
    s "Побачимось завтра на роботі, гарного вечора."
    mc "І тобі, Сайорі, щасливої дороги." #fadeout Sayo
    show sayori at thide
    hide sayori
    "Я б запросив її до себе, але не хочу, щоб Мію перед сном почала бешкетувати з «тіткою Сайорі»."
    "Вона пізно ляже, а вранці буде бурчати."
    "І буркотлива дитина — це не те, з чим я хочу миритися, тільки через ялинку."
    "Вона побачиться з «тіткою» через пару днів, все добре."
    "Краще йти всередину, ніж мерзнути і думати."
    #fadeout
    stop music fadeout 1.0
    scene bg living_room_night_christmas2 with fadehold
    show miyuki casual at t22
    show monika forward_casual happ cm oe at t21
    play music firelofi  ###

    m "Виглядає непогано, правда?"
    mm e4 "Так!"
    show miyuki e7
    mc "Це небагато, але я люблю мінімалізм."
    m "Мені здається, це ідеально."
    mm "Тут тепер дуже гарно!"
    mm e4 "Так має бути завжди."
    mc "Ні, дякую."
    show monika neut
    mm e7 b2 m4 "А чому ні?"
    show miyuki m9
    mc "Бо Різдво стає дуже втомливим, коли виростаєш."
    mm m4 "Що?"
    show miyuki m9
    m laug ce "А-а, твій тато має на увазі, що магія Різдва не буде такою чарівною, якщо вона буде цілий рік."
    show monika oe ma
    mm m4 "О, зрозуміла."
    show miyuki m9
    "Схоже, мене щойно врятували."
    mc "Можна залишити ялинку до Нового року, бо ми й так пізно її поставили."
    mm m4 "Це все через тебе, тату."
    show miyuki m9
    show monika sad
    mc "Тут немає нічиєї вини, Мію, ми з мамою просто були дуже зайняті."
    mc "Цього року все це довелося відкласти."
    mm m4 "Але ж Різдво важливе!"
    show miyuki m9
    mc "Так, але його можна святкувати і без прикрас."
    mm b3 m4 "Не можна!"
    show miyuki m9
    mc "Ти здивуєшся, але це можливо."
    mm m4 "Не вірю!"
    show miyuki m9
    mc "Ну, насправді, ми ніколи так і не робили."
    mc "Ми щороку прикрашаємо дім."
    mc "Просто цього року довелося відкласти."
    mm e5 "..." #conflicted, maybe like, sad-ish?
    m om neut b1b "Сонечко, зрозумій, ми обидва працюємо повний день."
    m "І робота потрібна, щоб платити рахунки."
    show miyuki e7
    m "Ми маємо віддавати пріоритет важливішим речам, ніж декорування."
    show miyuki b2
    m happ b1b "Це не означає, що ми не хотіли, просто треба було трохи почекати."
    m b1a "І подивись! Все зроблено і стоятиме тут кілька тижнів."
    mm m4 "Так, зрозуміла..."
    show miyuki m9
    m "Наступного року постараємось почати раніше, домовились?"
    mm om "Гаразд."
    m "Добре."
    m "А тепер не хочеш вибачитися перед татом за те, що звинуватила його?"
    mm m4 "Вибач, тату."
    show miyuki m9
    mc "Все добре, Мію, ми просто хотіли, щоб ти нас зрозуміла."
    mm m4 "Схоже, зрозуміла."
    show miyuki m9
    mc "Коли підростеш, зрозумієш ще більше, тож можна почати готуватись вже зараз."
    mm m4 "Тату, ну вибач."
    show miyuki m9
    mc "Я приймаю вибачення, але більше не роби сумних облич сьогодні, добре?"
    mm om "Добре." #smile
    mc "Тоді вперед."
    mc "Що ще хочете робити?"
    mm b1 m4 "Ем-м-м..."
    mm m9 b3 e5 "Хм-м."
    mm e7 b1 om "Думаю, піду помалюю."
    mc "Точно?"
    mm "Так, хочу закінчити розмальовку до кінця року."
    mm e4 "Залишилось всього шість сторінок!"
    mc "Тоді удачі з малюванням."
    mm e7 "Дякую!" #fadeout Miyu
    show miyuki at thide
    hide miyuki
    show monika at t11
    m "Так-с."
    m "А що ми будемо робити сьогодні ввечері?"
    mc "Ну, у моїй розмальовці залишилось дві сторінки, тож я піду її дороблю."
    m anno "О, ну ти даєш."
    mc "Якщо чесно, я радий зайнятися з тобою всім, чим ти захочеш."
    m curi mb "Справді?"
    m happ om "А якщо я захочу пробіжку?"
    mc "...Окей, може, не всім."
    mc "Пожалій свого бідного чоловіка."
    m ce "Мені подобається тебе дражнити, але я все одно не пішла б на пробіжку так пізно."
    m oe "Ні, на сьогодні досить фільмів і обіймів на дивані."
    mc "Звучить ідеально."
    m "Я знала, що тобі це сподобається."
    m neut "Тільки цього разу не засинай, будь ласка."
    mc "Тоді слідкуй за мною."
    m happ "Так-так."
    m "Я маю право вдарити тебе подушкою, якщо заснеш."
    mc "Тоді точно не забуду."
    m ce "Чудово! Я піду вмикати фільм."
    m oe "Сьогодні вибираю я."
    mc "Мене це влаштовує."
    "Ми все одно любимо одні й ті ж фільми."
    "Ті, що створені для найкращих вечорів кіно."
    "Хоча, коли вона в моїх обіймах, я, мабуть, міг би насолоджуватись чим завгодно." #fadeout fadein after

    scene bg living_room_night_christmas2 with fadehold
    show monika forward_casual happ cm oe at t11
    m "Я завжди любила культові різдвяні фільми."
    mc "А ще вони дуже ностальгічні."
    m ce "Ти озвучив мої думки."
    m oe "Я піду вкладати Мію спати, потім трохи почитаю."
    mc "Добре, я ще подивлюсь телевізор, потім піднімуся."
    m "Добре, коханий."
    m ce "До кінця вечора я ще можу тебе вдарити подушкою, тож не засинай тут."
    mc "Не буду, не хочу робити з цього звичку."
    m oe "Хороший хлопчик."
    mc "Гав." #mc – це дорослий одружений чоловік, а не щеня
    m ce "Ехе-хе-хе-хе." #fadeout
    show monika at thide
    hide monika
    "Вона така неймовірна."
    "Я найщасливіший чоловік на землі."
    "Хоча я не знаю багато чоловіків."
    "Але мені простіше вважати, що мені пощастило."
    "Можна перемикати канали, може, щось цікаве знайду."
    #fadeout fade in
    scene bg living_room_night_christmas2 with fadehold

    "Що ж, час витрачено не дарма."
    "Цілу годину перемикати різні реаліті-шоу — гарний спосіб завершити день."
    "Моніка не дуже любить реаліті-шоу, каже, що вони не стимулюють розум."
    "Може й так, але мені подобається відчувати себе розумнішим за людей з шоу, тож я вважаю їх корисними."
    "До речі про Моніку, цікаво, вона вже спить?"
    "Треба подивитись."

    scene bg bedroom with fade
    show monika pjs happ at t11

    mc "..."
    mc "Ти ще не спиш."
    m ma "Угу."
    m om "Ти вчасно, я якраз збиралася лягати."
    mc "Чудово, я вимкну світло." #light off & fadeout monika
    scene bg bedroom_dark
    show monika at thide
    hide monika
    m "Поки не забула, нагадай мені зателефонувати Нацукі й замовити щось для вечірки."
    mc "Давай зробимо це вранці, я зараз засну."
    m "Я знаю, тому й прошу нагадати."
    mc "Окей, тоді прямо зараз нагадую: зателефонувати Нацукі вранці."
    #hitting sound
    mc "Ай..."
    m "Не жартуй зі мною."
    mc "Вибач, кохана."
    m "Вибачаю."
    mc "Що плануєш завтра з Мію?"
    m "Нічого особливого, просто посидимо вдома."
    mc "Краще, ніж мої плани..."
    m "Я не думаю, що твоя робота така вже погана."
    mc "Ти там навіть не працювала."
    m "Спитаю Сайорі, коли побачимось."
    mc "Ти не отримаєш нічого схожого на правду, запевняю."
    m "Побачимо."
    m "Я збираюся спати. Люблю тебе."
    mc "І я тебе, кохана."
    "Я теж маю заснути."
    "Завтра обіцяє бути нудним, а нудьга не поєднується з втомою."
    #fadeout
    stop music fadeout 1.0

    return
