label story2:
    scene black
    with fadehold
    window hide dissolve
    pause 2.0

    show screen end2 with fade
    pause 5.0
    hide screen end2
    pause 2.0
    screen end2:
        text "20 грудня" yalign 0.5 xalign 0.5
    scene black
    with fadehold

    "..."
    mm "{size=12}Тату.{/size}" #small writing"
    "..."
    mm "{size=16}Тату?{/size}"
    "..."
    mm "Тату, прокидайся!!"
    mc "Хм-м...що?"
    scene bg living_room_day
    show miyuki casual at t11
    with fadehold
    play music chillvibes
    #open eyes, very close Miyu
    mc "Привіт, Мію."
    mm "Привіт, тату."
    mm e4 "Вже ранок!"
    mc "Дійсно."
    mm "Хе-хе-хе, дурний тату, ти заснув на дивані."
    mc "...Так і є, чи не так?"
    mm "Угу!"
    mm e7 "Але настав час прокинутися, зранку-пораненьку, як ти і сказав."
    mc "І то вірно."
    "До речі, котра година?"
    "{i}8 ранку.{/i}"
    "О, непогано, не так рано."
    "Цікаво, чи прокинулася Моніка."
    mc "Твоя мама ще спить, Мію?"
    mm m4 "М-м-м, не знаю."

    mm m6 "Я прокинулася і спустилася сюди, побачила, що ти спиш і розбудила тебе."
    show miyuki cm
    mc "Що ж, якщо вона ще не спустилася, значить, швидше за все, спить."
    mc "Ну, як тобі ідея приготувати їй сніданок у якості сюрпризу?"
    mm om "Давай! Мамі це сподобається!"
    mc "Тоді ходімо на кухню і подивимося, що ми можемо приготувати."

    scene bg kitchen with wipeleft
    show miyuki casual at t11
    mc "Хм-м-м, є ідеї?"
    mm e4 m2 "Млинці!"
    show miyuki cm
    mc "Це тому, що вони сподобаються їй, чи ти хочеш їх приготувати для себе?"
    mm e7 "І те, і інше."
    mc "Що мама, що дочка, гаразд, млинці так млинці."
    mm e4 m2 "Ура!"
    show miyuki cm
    mc "Добре, тоді дістань суміш з нижньої шафки, а я візьму яйця і молоко."
    mm e7 "Добре, тату."
    "Магазин зараз відчинений, може, мені варто було подзвонити Сайорі."
    "Гаразд, яйця і молоко є."
    mm "Ось і суміш, тату."
    mm "Можна я змішаю все разом?"
    mc "Звісно, доню, тільки я спочатку додам молоко та яйця."
    "{w}.{w=0.1}{w}.{w=0.1}{w}.{w=0.1}" #separate dots
    mc "Ось, починай."
    mc "Постарайся все добре змішати."
    mm "Я знаю, тітка Нацукі каже, що ти повинен вибивати з цього все лайно, коли збиваєш щось."
    mc "...Ну, тітка Нацукі не повинна була говорити тобі вибивати лайно з усього підряд, але технічно, вона права."
    mc "Просто перемішуй, а коли перемішаєш, то приступимо до готування."
    mc "Поки ти будеш цим займатися, тато швидко подзвонить тітці Сайори."
    mm m4 "Ти ж не збираєшся розповідати їй про вечірку, правда?!"
    mm m2 e6 "Я хочу це зробити!!"
    show miyuki cm
    mc "Не хвилюйся, ти зможеш поговорити з нею про це пізніше, мені просто потрібно обговорити з нею дещо."
    mm m4 e7 "Оу."
    mm om "Тоді добре."
    mc "А тепер, міс, приступай."
    mm "Вже!"

    #*ringing*
    play audio dial
    window hide dissolve
    pause 7.0


    show sayori work neut cm oe at t31 zorder 2
    show sayosplit behind sayori
    s "Алло?"
    mc "Доброго ранку, Сайорі."
    s happ "О, привіт, [player], що робиш?"
    mc "Готую млинці з Мію."
    s ce "Оу-у, як мило, передай їй слухавку!"
    mc "Не можу, вона зайнята змішуванням."
    s anno oe "Тоді ввімкни гучний зв'язок."
    mc "На це немає часу, це щодо роботи."
    s neut "Ох, що не так?"
    mc "Насправді нічого особливого, просто зроби мені послугу і подивись записи з камер спостереження минулої ночі."
    mc "Мені потрібно знати, чи взяв Чед з собою додому прострочені речі."
    s curi "Навіщо йому це робити?"
    mc "Тому що це Чед."
    mc "У будь-якому разі, якщо подивишся, напиши мені, брав чи ні, я був би дуже вдячний."
    s happ "Звісно, я дам тобі знати."
    mc "Чудово, дякую, Сайорі."
    s "Немає проблем!"
    mc "У будь-якому разі, я поговорю з тобою пізніше, мені потрібно приготувати сніданок."
    s ce "Добре, бувай!"
    show sayori at thide
    hide sayori
    show sayosplit at thide
    hide sayosplit
    mc "Ти закінчила?"
    mm "Думаю, так."
    mc "Дай подивлюся... Так, ти чудово впоралася."
    mc "Я почну смажити млинці."
    mm "Я піду накрию на стіл." #fade out miyuki after
    show miyuki at thide
    hide miyuki
    mc "Звучить добре, готування не займе багато часу."
    mm "Добре, тому що я дуже голодна!"
    mc "Що ж, тобі доведеться трохи зачекати, тому що спочатку ми приготуємо порцію для мами."
    mm "Ми повинні принести їх їй у ліжко!"

    mc "Гарна ідея, сніданок у ліжку – це завжди приємно."
    mm "Сподіваюся, вона ще не прокинулася."
    mc "Не думаю, що це проблема, це займе кілька хвилин."
    mm "Хіба млинці так швидко готуються?"
    mc "Для однієї людини – так, просто зазвичай я готую їх довше для нас трьох."
    mm "Хм."
    #show Miyu
    show miyuki casual at t11
    mm "Гей, я можу налити їй склянку соку на додаток до них?"
    mc "Звісно, доню, їй це сподобається." #fade out Miyu
    show miyuki at thide
    hide miyuki
    "Зазвичай вона п'є каву, але це занадто мило, вона може просто випити її потім."
    mc "Чи не могла б ти сходити у вітальню за підносом?"
    mc "Ми принесемо її сніданок на ньому."
    mm "Піду дістану його."
    mc "Дякую, Мію."
    "Добре, млинці є, сік є, залишилося дочекатися дочку."
    "Вони, напевно, зможуть поговорити, поки я готую сніданок для Міюкі та мене."
    "Хм, на вулиці досить сонячно."
    "Сподіваюся, там не надто холодно."
    mm "Ось і він!"
    mc "Гарна робота, тепер ми просто покладемо сніданок на піднос і принесемо його їй нагору."
    mm "Можу я понести його?"
    mc "Як щодо того, щоб я поніс його вгору сходами, а потім звідти понесеш ти?"
    mm "Домовились."
    mc "Гаразд, тоді ходімо розбудимо маму."
    #fade out
    stop music fadeout 1.0

    scene bg bedroom with fade
    show miyuki casual at t22
    show monika pjs dist om ce at t21
    play music clubs
    mc "Тук-тук."
    mm "Обслуговування номерів!"
    m curi cm e4a "М-м-м?"
    m om "Обслуговування номерів?"
    mm e4 "Так точно, мамо, ми приготували тобі сніданок!"
    m neut ce mb "О? Ви зробили його зараз?"
    show monika ma
    mm "Ага, млинці!"
    mm e7 "І я допомагала."
    #monika open eyes
    m happ oe om "Вау!"
    m "Виглядає приголомшливо, доню."
    mm "Я замісила тісто і налила сік."
    m ce "Погляньте на мого маленького кухаря, ти збираєшся скласти конкуренцію тітці Нацукі?"
    mm e4 "Можли-и-и-иво."
    m oe "Що ж, дуже тобі дякую, Мію, я впевнена, що це буде смачно."
    #moni kiss
    show monika ce at h11:
        ease .3 zoom 3.8 yoffset 1900
    #hug/kiss
    window hide dissolve
    pause 2.0
    show monika at h21:
        ease .5 zoom 1.0 yoffset 0
    show miyuki e7
    m "І тобі теж дякую."
    mc "Нагорода вартувала зусиль."
    m ce n3 "О, припини це."
    mc "Я хіба збрехав?"
    mc "Та ні за що."
    m n4 b1b "Досить!"
    mc "Ні за що!"
    #moni kiss again
    show monika ce at h11:
        ease .3 zoom 3.8 yoffset 1900
    #hug/kiss
    window hide dissolve
    pause 2.0

    show monika at h21:
        ease .5 zoom 1.0 yoffset 0
    #end kiss
    show miyuki e3 m4 b3 behind monika
    mm "Фу-у-у, гидота!"
    mm e7 m4 "Бридота."
    show miyuki m9
    m happ b1a n1 oe om "Це просто прихильність, доню, в цьому немає нічого поганого."
    mm m4 "Це огидно!"
    show miyuki m9
    mc "Ха-ха-ха, ну, якщо ти так кажеш, Мію, то гаразд."
    show miyuki m9 b1 e7
    mc "Хочеш поговорити з мамою, поки я піду готувати наш сніданок?"
    mm om "Окей."
    mc "Це не займе багато часу, я покличу вас, коли буде готово."
    m "Можеш приготувати чашку кави?"
    mc "Звісно."
    m "Дякую, коханий."
    mc "Завжди будь ласка."
    #fade out

    scene bg kitchen with fade
    show miyuki casual at t22
    show monika pjs happ cm oe at t21

    mc "Що ж, це було добре, як думаєш?"
    mm e7 om "Вони були дійсно смачними."
    mm e7 "Дякую, тату."
    mc "Нема за що, і дякую тобі за твою допомогу."
    mm back e4 "Хе-хе-хе, було весело!"
    m "Скоро нам доведеться готувати тату сніданок у ліжко, Мію."
    mm neutral e7 om "Так!"
    mc "Хіба я ще не казав, що твій поцілунок був достатньою нагородою?"
    m "Не починай, містер."
    mc "Що я можу сказати, я люблю дражнити."
    m "Ніби я цього не знала, а-ха-ха."
    "Хм, схоже, зараз близько пів на десяту."
    mc "Гаразд, Мію, збирайся, ми вирушимо за кілька хвилин."
    mm "Добре, тату."
    show miyuki at thide
    hide miyuki
    show monika at t11
    m "І куди ви двоє направитеся в першу чергу?"
    mc "Дотримуючись мого вчорашнього плану, спочатку ми відвідаємо Нацукі."
    m "Я могла б довезти вас до неї, мені все одно по дорозі на роботу."
    mc "Звісно, це заощадить трохи часу."
    mc "Мію?"
    mm "Так?" #offscreen
    mc "Твоя мама відвезе нас до тітки Нацукі."
    mm "Добре!"
    m "Ти теж можеш зібратись, я тільки сходжу за ноутбуком, і ми можемо вирушати."
    mc "Чудово."
    #fade out
    stop music fadeout 1.0

    scene bg altstreetday_snow with fadehold

    show monika forward_winter neut cm oe at t21 zorder 2
    show miyuki winter at t22
    play music snowyjazz
    m "Ви не проти піти звідси пішки?"
    mc "Так, без проблем."
    m happ "Добре, тоді побачимося після роботи."
    mm "Бувай, мамо!"
    mm e4 "Люблю тебе!"
    show miyuki e7
    m "І тебе люблю, доню."
    show monika ce at h11:
        ease .3 zoom 3.8 yoffset 1900
    #hug/kiss
    window hide dissolve
    pause 2.0
    show monika at h11:
        ease .5 zoom 1.0 yoffset 0
    #moni kiss
    m "Гарного дня, коханий, люблю тебе."
    mc "Я теж тебе люблю, гарного дня на роботі."
    m ce "Звісно, постараюся, ага."
    #fade out Monika
    show monika at thide
    hide monika
    show miyuki at t11
    mc "Добре, міс, ходімо до тітки Нацукі."
    mm "Тримаю парі, вона буде рада нас бачити."
    mc "Тебе? Безсумнівно. Мене? Е-е-е, подивимося."
    "Мені дуже подобається діставати її."
    "Ніхто не може дратувати її так, як я."
    "Чесно кажучи, це кумедно."
    mm "Поспішай, тату."
    mc "Що за поспіх? У нас цілий день попереду, Мію."
    mm e4 "Так, але я справді хочу запросити її прийти на вечірку!"
    show miyuki e7
    mc "І ти запросиш, тільки потерпи ще трохи."
    mm back b2 m4 "Але-"
    show miyuki m9
    mc "Гей, ніяких «але». Ми всього за кілька кварталів звідси, і вона нікуди не збирається."
    mc "Просто насолоджуйся прогулянкою."
    mm neutral b3 m8 e4 "Хмф."
    mm m4 "Гаразд."
    show miyuki m8
    mc "Добре."
    mc "А взамін я буду ходити швидше, добре?"
    mm b2 om e7 "...Окей, тату."
    mc "Радий, що ти згодна, ходімо."
    #fade out

    scene bg bakeryopening with fadehold
    show miyuki winter at t11

    "Тут завжди пахне корицею."
    "Я знаю, що це пекарня, але чорт забирай."
    "Це завжди змушує мене купити пару булочок з корицею."
    mm "Гей, тату, можна нам чогось перекусити, раз вже ми тут?"
    mc "Наприклад?"
    mm m4 "М-м-м-м..."
    mm m8 b3 "..."
    mc "Є з чого вибирати, правда?"
    mm b1 om "Угу! Складно вибрати."
    mc "Ну, ми все одно ще будемо тут недовго, вибери щось, і я куплю це для тебе."
    mm "Добре, тату, я постараюся вибрати щось швидше."
    show miyuki at t22
    show natsuki turned casual happ cm oe at t21
    n "Гей, ви двоє!"
    mm e4 "Тітка Нацукі!"
    n ce "Як поживає моя маленька Мію?"
    mm e7 "Чудово!"
    show miyuki e7
    n oe "А як у тебе справи, [player]?"
    mc "Непогано, що щодо тебе?"
    n neut "До біса зайнята, але в іншому я в порядку."
    mc "Так, такий час."
    n "І не кажи, я люблю свій бізнес, але, чорт забирай, це виснажливо."
    n "Тобі пощастило, що ти працюєш тільки в цілодобовому магазині."
    mc "Я зовсім не вважаю себе щасливчиком, але я розумію, про що ти говориш."
    n happ "Добре."
    n "Отже, що привело вас двох сюди?"
    mc "О, я прийшов, щоб зробити замовлення на купу печива, кожне з яких з різним смаком."
    n anno rhip "...Правда?"
    mc "Звісно, одне з шоколадною крихтою, одне медове вівсяне з родзинками, одне з горіхами та білим шоколадом макадамії, одне з арахісовим маслом, одне цукрове печиво, одне-"
    n ce "Мію, він зараз серйозно?"
    mm "Я не знаю, напевно, ні."
    n oe "Я теж про це думаю."
    n lhip "Просто кажу, якщо ти закінчиш цей список і все ще хочеш їх, я виставлю подвійну ціну."
    mc "Це просто погане обслуговування клієнтів."
    mc "Я вимагаю зустрічі з менеджером."
    show natsuki at thide
    hide natsuki
    pause(1.5)
    show natsuki turned casual sedu cm ce at t21
    #have natsuki slide offscreen, then back on
    n sedu ce "Пекар, менеджер, власник – просто перед тобою."
    n happ b1d oe "У вас є скарга? Можете обговорити її з молодшим керівником."
    mm m4 "Зі мною?"
    show miyuki m9
    n ce rhip "Вірно."
    mm om e4 "Чудово!"
    mc "Враховуючи, що ми тут рідко буваємо, керівник, можливо, невідповідна для неї робота."
    n oe rdown b1a "Звісно, вона стежить за тобою і тримає в вузді."
    n ce "Гарна робота, Мію."
    mm "Дякую!"
    show miyuki e7
    mc "Налаштовує власну дочку проти мене, як жорстоко."
    n oe "Ми, дівчата, повинні триматися разом."
    mm "Так, тату."
    mc "Я б так швидко не зістрибував з корабля, врешті-решт, через тебе ми сьогодні тут."
    mm e6 "...О так!"
    mm e7 "Тітко Нацукі, ти зможеш прийти на нашу вечірку?"
    mm back "Будь ласка?"
    n neut "Вечірка?"
    mc "Так, перед Різдвом, вона дуже хотіла, щоб ми її влаштували, і ось ми тут."
    n "Чудово."
    show miyuki neutral m9
    n pout "Але я не знаю, чи вийде в мене, Мію."
    n sad "Різдво – найзавантаженіша пора року для мене, і, можливо, я не зможу піти звідси до пізнього вечора."
    mm b2 m4 "О-о-о."
    show miyuki m9 b1
    n happ "Але гей! Якщо я зможу, я подзвоню твоєму татові і дам йому знати, добре?"
    mm b2 om "Добре..."
    n ce "Як щодо безкоштовної булочки з корицею, щоб змінити цей похмурий погляд?"
    mm "...Було б гарно."
    show miyuki b1
    mc "Можна мені теж одну безкоштовно?"
    n neut oe "А ти хіба маленька мила дівчинка?"
    mc "Я міг би прикинутися однією з них, якщо це означає безкоштовну їжу."
    n anno "Зробиш це, і я забороню тобі заходити в магазин."
    mc "Натяк зрозумілий."
    mm e4 "А-ха-ха, ти боїшся тітку Нацукі, тату."
    n happ "Так, і не дозволяй йому забути про це."
    show miyuki e7
    mc "Я не боюся, просто уникаю жахливої ситуації, коли я ніколи не спробую твою випічку знову."
    n "Це найбільше покарання, яке я можу тобі винести."
    mc "Як то кажуть, я хочу булочку з корицею, і я заплачу за це."
    n ce "Ні, вони обидві за рахунок закладу, я просто жартувала над тобою."
    mc "Ну, тоді гаразд..."
    mc "Дякую, Нацукі."
    mm e4 "Так, дякую!"
    show miyuki e7
    n oe "Обом – немає за що."
    n rhip "Не соромтеся, візьміть булочки, а я повинна повернутися до роботи, ці замовлення самі собою не виконаються."
    mc "Чудово, ми поговоримо з тобою пізніше."
    mm "Бувай, тітко Нацукі!"
    n rdown ce "Бувай, Мію."
    n oe "До зустрічі, [player]."
    mc "До зустрічі."
    #fade out
    
    scene bg altstreetday_snow with fadehold
    
    show miyuki winter at t11

    mc "Отже, чим ми займемося тепер?"
    mc "Хочеш запитати тітку Юрі, чи спочатку пообідаємо?"
    mm back e4 b2 om "Д-давай спочатку пообідаємо, тату." #nervous
    show miyuki cm
    mc "Добре, Мію."
    mc "Ми можемо піти в те кафе поруч, яке тобі подобається."
    mm neutral e6 om b1 "Правда?!"
    mc "Правда."
    mm e4 m2 "Ура!"
    mm om e7 "Я сподіваюся, що мила леді там."
    mc "Думаю, ми побачимо її, коли приїдемо."
    #fade out
    stop music fadeout 1.0

    scene bg cafe with fadehold
    show miyuki winter at t11
    play music firelofi
    mm m4 b2 e5 "Бр-р-р-р, надворі холодно."
    show miyuki m7
    mc "І то вірно, але ти скоро зігрієшся."
    show kiyomi turned casual happ cm oe at t21
    show miyuki e7 b1 m9 at t22
    ky "Привіт, друзі, з поверненням!" #Kiyomi
    mc "Привіт знову."
    mm om "Привіт, Кійомі!"
    ky ce "Як ти, Міюкі?"
    show kiyomi oe
    mm e4 "Хе-хе, чудово."
    show miyuki e7
    ky "Ну, рада чути."
    ky "Сьогодні тільки ви двоє?"
    mc "Так, тільки ми."
    mm "Мама на роботі."
    ky neut "О, я зрозуміла."
    ky happ "Що ж, передай їй від мене привіт, коли побачиш її."
    mm "Добре."
    ky "Так що вам принести випити?"
    mm e4 "Яблучний сік, будь ласка!"
    show miyuki e7
    mc "Я буду каву."
    ky "Звісно, ​​скоро повернуся."
    #fadeout kiyomi
    show kiyomi at thide
    hide kiyomi
    show miyuki at t11
    mm "Вона тут сьогодні, тату."
    mc "Так, пощастило нам, правда?"
    mm "Так, вона дуже хороша."
    mc "І дуже дружелюбна."
    "Хоча у неї дивне почуття стилю."
    "Вона, мабуть, божевільна, щоб носити щось подібне взимку."
    show miyuki at t22
    show kiyomi turned casual happ cm oe at t21
    ky "Кава для тебе і яблучний сік для тебе."
    mm "Дякую!"
    ky ce "Нема за що."
    ky oe "Вже знаєте, що будете їсти?"
    mm e4 "Угу!"
    show miyuki e7
    ky "Добре, мила, замовляй."
    mm "Можна мені курячі крильця?"
    ky ce "Звісно, можна."
    ky oe "З картоплею фрі?"
    mm "Так, будь ласка."
    ky "Чудово, а для вас?"
    mc "Я візьму чізбургер з беконом, і картоплею фрі."
    ky "Чудово, це не займе багато часу."
    mc "Дякую."
    show kiyomi at thide
    hide kiyomi
    #fade out kiyomi again
    show miyuki at t11
    mm b2 m4 "А де ми візьмемо ялинку?"
    show miyuki m9
    mc "М-м-м-м..."
    mm e4 m4 "Нам потрібна ялинка, тату!"
    mm e7 "Ми повинні були знайти її тиждень тому!"
    show miyuki m9
    mc "Я знаю, я знаю."
    mc "Я постараюся знайти її завтра після роботи, добре?"
    mm m4 "Обіцяєш?"
    show miyuki m9
    mc "Обіцяю."
    mc "Обіцяю, що постараюся, але не обіцяю, що знайду."
    mc "Але я зроблю все, що в моїх силах."
    mm om "Вже постарайся."
    mc "О, ще б пак, інакше я повинен буду відповідати перед тобою і твоєю мамою."
    mm b1 e4 "Ось саме!"
    "Вона виросте такою ж, як мама, я знаю."
    "Я боюся цього."
    mm "Гей, а Кійомі може прийти на вечірку?"
    mc "Що? Ні, ми не запрошуємо офіціантку."
    mm b2 m4 "О-о-о, чому ні?"
    show miyuki m9
    mc "Тому що це буде дивно, Мію."
    mm m4 "Ні, це не так, ми їй подобаємося."
    show miyuki m9
    mc "Так, як клієнти, вона не є ні частиною сім'ї, ні другом."
    mm m4 "О-о-о-о."
    show miyuki m9
    mc "Вибач, але «ні» – це остаточна відповідь."
    mm m8 b1 "Хмф."
    mc "Дуйся скільки хочеш, це нічого не змінить."
    mm m8 b3 "Хмф."
    mc "Хмф."
    mm e4 b3 m8 "Хмф!"
    mc "Хмф!!!"
    mm m4 "Припини!"
    show miyuki e7 m9
    mc "Після вас, міс."
    mm m4 "Злюка!"
    show miyuki m9
    mc "Ця злюка платить за обід, так що він не може бути таким злим."
    mm e4 m4 "...Може."
    show miyuki m9
    mc "Знаєш, ти нагадуєш мені тітку Сайорі, коли дуєшся."
    mm b1 e7 om "Думаєш, вона зможе прийти на вечірку?"
    mc "Зможе, я знаю це."
    mm m4 "Правда?"
    show miyuki m9
    mc "Так, я просто дам їй вихідний, щоб у неї не було виправдань."
    mc "І до того ж, ти справді думаєш, що вона упустить можливість провести час з тобою?"
    mm m4 "...Ні."
    show miyuki m9
    mc "Саме так. Тітка Сайорі завжди хоче провести більше часу з Мію."
    mm e4 om "Е-хе-хе, я завжди хочу більше часу з тіткою Сайорі!"
    show miyuki e7 at t22
    show kiyomi turned casual happ cm oe at t21
    ky "Добре! Ось ваше замовлення."
    ky "Бургер для тата і курячі крильця для міс Міюкі."
    mc "Дякую."
    mm "Дякую, Кійомі!"
    ky ce "Будь ласка, просто скажіть, якщо вам потрібно щось ще."
    show kiyomi oe
    mc "Звісно."
    show kiyomi at thide
    hide kiyomi
    #fade out Kiyomi
    show miyuki at t11
    mc "Чудовенько, давай поквапимося і поїмо, нам ще потрібно зробити пару зупинок, а потім ми повернемося додому на вечерю."
    "Сьогодні так багато доручень."
    mm "Добре, тату."
    #fade out
    stop music fadeout 1.0

    scene bg library with fadehold
    show miyuki winter b2 m9 at t11
    play music yuri_theme
    "Завжди тішить, коли я думаю про Юрі, що працює в книгарні."
    "Схоже, вона народжена для цієї роботи."
    mc "... "
    mc "Мію, ти виглядаєш трохи нервовою."
    mm m4 "Я в порядку."
    show miyuki m9
    mc "Гаразд."
    "Юрі сьогодні не працює?"
    "Вона не за прилавком."
    "Можливо, я повинен був хоча б перевірити, перш ніж з'являтися тут."
    show miyuki at t22
    show yuri turned casual happ cm oe at t21
    y "О, привіт, [player], привіт, Міюкі."
    y "Що привело вас сюди сьогодні?"
    mc "Привіт, Юрі, як справи?"
    y ce "Досить добре, дякую."
    y neut oe "Найзавантаженіший час року, приємно бачити так багато людей, які захоплюються літературою."
    y happ "Або хоча б тих, хто дарує подарунки у вигляді книг."
    y neut rup "Тому ви тут?"
    show yuri rdown
    mc "М-м-м? Насправді ні."
    "Хоча це нагадало мені про те, що потрібно купити подарунок для Моніки та Сайорі."
    "Подарунки будуть днями, чесне слово."
    mc "Ми тут, тому що Міюкі хоче дещо тобі сказати."
    y happ "Ну, я була б рада відповісти на запитання від тебе, Міюкі."
    mm m9 "..."
    mc "Ну ж, Міюкі."
    mc "Що ти хочеш запитати у тітки Юрі?"
    mm back b2 m4 "{size=12}...Тихотілабприйтидонаснавечірку...{/size}"#small writing
    show miyuki m9
    y neut "Скажи це трохи голосніше, я тебе не почула."
    mm m4 "...Т-ти хотіла б прийти до нас на вечірку?"
    show miyuki m9
    y "Вечірка?"
    mc "Так, вечірка у канун Різдва."
    mc "Ми вирішили надіслати тобі запрошення на її прохання, тому я приводив її до всіх, щоб запитати."
    y happ "Оу-у-у, як мило."
    y "Я так розумію, ввечері?"
    mc "Так, приблизно в вечері, може, трохи пізніше."
    y ce "Що ж, тоді я безумовно можу бути присутньою."
    mm m4 "П-правда?"
    show miyuki m9
    y oe "Звісно, Міюкі, магазин не буде відчинений так пізно у переддень Різдва, тож я можу піти на твою вечірку."
    mm om "С-спасибі, тітко Юрі."
    y "Не думай про це, я впевнена, що це буде веселий вечір для всіх."
    y neut "До речі, хто ще прийде?"
    mc "Хех, поки що тільки ти."
    mc "Хоча, я думаю, Сайорі теж прийде."
    mc "Ми вже відвідали Нацукі, але вона не впевнена, чи зможе вона."
    y sad "Як шкода."
    mc "Так, але, сподіваюся, вона ще зможе заглянути до нас."
    show yuri neut
    mc "Я також запитаю свого брата, а у Моніки є друг, якого вона запрошує, так що подивимося, як все піде."
    y happ "Ну, навіть якщо нас буде всього кілька людей, я впевнена, що все одно буде весело."
    mc "Звісно, буде, правда, Мію?"
    mm b1 "Так, тату."
    mc "Добре, я вважаю, ми залишимо тебе в спокої."
    y ce "О, це не проблема, ви вдало зайшли."
    y oe "У другій половині дня відвідувачів мало."
    mm "Можна я куплю книгу, тату?"
    mc "До Різдва менше тижня, Мію."#жид
    mm b2 m4 "Але у мене є кишенькові гроші!"
    show miyuki m9
    mc "...А хоча, знаєш? Ти права."
    mc "Ти можеш купити книгу, якщо зможеш заплатити за неї."
    mm e4 b1 om "Ура!"
    mc "Іди і знайди собі щось."
    mm e7 "Добре, скоро повернуся!"
    #fade out Miyu
    show miyuki at thide
    hide miyuki
    show yuri at t11
    mc "Я сумніваюся, що вона скоро повернеться."
    y "Ніколи не вгадаєш, вона може побачити щось, що одразу приверне її увагу."
    mc "Це малоймовірно, якщо тільки на обкладинці немає блискіток."
    y "Вірно."
    y ce "Я впевнена, що вона знайде те, що захопить її."
    mc "Напевно."
    show yuri neut oe
    mc "Як справи, окрім роботи?"
    y "Ох, знаєш, досить спокійно."
    y "Окрім роботи, у мене мало справ."
    y happ "Тільки я і мої книги вдома."
    y ce "Але я в порядку."
    mc "Це найголовніше."
    y oe "Що щодо тебе?"
    mc "Те ж саме, тільки з дочкою, ха-ха-ха."
    mc "Я занадто багато працюю, щоб займатися іншими справами, але коли я вдома, вона тримає мене в тонусі."
    y ce "Очікувано."
    y oe "Якби не вона, то напевно б Моніка."
    mc "Повір мені, тримає."
    mc "Міюкі напевно перейняла це від матері."
    y "Я впевнена в цьому."
    show yuri at t21
    show miyuki winter at t22
    mm om "Знайшла!"
    mc "Тільки одну? Я здивований."
    mm "Мені вистачає грошей тільки на одну, тату."
    mc "Ну, я знав це."
    mc "Я просто не знав, чи знаєш ти."
    mm b3 m4 "Я не дурна."
    show miyuki m9
    mc "Ніколи так не казав."
    mc "Ти виростеш такою ж розумною, як твоя мама."
    mm b1 om e4 "Так і є."
    mc "Готова йти?"
    mm e7 "Угу!"
    mc "Чудово, іди заплати за свою книгу, а потім ми підемо до тітоньки Сайорі."
    mm e4 "Ура! Тітонька Сайорі!"
    mc "М-м-м, але спочатку ти повинна заплатити за книгу."
    mm e7 "О так, тримай, тітко Юрі."
    y ce "Дякую, Міюкі, я піду візьму здачу." #fadeout Yuri
    show yuri at thide
    hide yuri
    "Дурненька."
    #fadeout
    stop music fadeout 1.0

    scene bg grocery with fadehold
    show miyuki winter at t11
    play music clubs

    mc "Добре, Мію, тепер згадай, тітка Сайорі працю-"
    show miyuki at t22
    show sayori work happ cm oe at t21
    mm e4 "Тітко Сайорі!!!" #show sayo
    show miyuki e4
    s ce "А ось і моя Мію!"
    mc "Боже, ніхто ніколи так не радий бачити мене."
    show miyuki e7
    s oe "Ти хіба мила дитина?"
    mc "Я був ним."
    mc "Нацукі теж так сказала."
    s neut "О, ти бачився з Нацукі?"
    mc "Так, сьогодні ми зустрічаємося з усіма."
    s happ "О, це весело, кілька дружніх візитів заради Мію?"
    mc "Ні, в цьому є причина."
    mm "Так!"
    mc "Ну ж, Мію."
    mm "Можеш прийти до нас на вечірку?!"
    s neut "Вечірка?"
    s sad "Ой, почекайте, не кажіть мені, що я забула про чийсь день народження."
    mm "Ні, це вечірка на канун Різдва!"
    s nerv ce "О, слава Богу, я вже почала почуватися дуже погано, хе-хе."
    mm "Так ти можеш прийти до нас, тітко Сайорі?!"
    s neut oe "Коли вечірка?"
    mc "На канун Різдва."
    s sad "О, я не зовсім впевнена, чи зможу я це зробити."
    mm b2 m4 "Оу-у-у, чому ні?"
    show miyuki m9
    s "Я не планувала це, так що мені, можливо, доведеться працювати."
    mc "..."
    mc "Сайорі, ти ж знаєш, що я складаю розклад, правильно?"
    show miyuki b1
    s nerv "...Це був довгий день, гаразд?"
    mc "Тут кожен день довгий."
    s happ "Для тебе, може, я завжди стараюся з усіх сил."
    s nerv "Я погано спала минулої ночі."
    show sayori happ
    mc "Ну, не турбуйся, я просто попрошу Чеда прийти раніше."
    mc "Він все одно хотів попрацювати довше."
    "Не те, щоб він їх заробив, чи щось у цьому роді."
    s ce "Чудово, тоді я точно зможу це зробити, Мію!"
    mm e4 "Ура!"
    mm om "Я так рада, що ти будеш там, тітонько Сайорі!"
    s oe "Я намагаюся не упускати шанс провести більше часу з моєю маленькою Мію."
    mm e7 "Мені теж подобається проводити з тобою час, тітко."
    mc "Якщо хочеш, можеш провести більше часу з нею."
    s "Звісно, хочу."
    mc "Чудово, приходь на кілька годин раніше і візьми її з собою, поки ми все приготуємо."
    s "Звучить як план."
    s ce "Я придумаю щось веселе, чим ми можемо зайнятися, Мію."
    show sayori oe
    mm e4 "Не можу дочекатися!"
    show miyuki e7
    mc "Що ж, тобі доведеться, моя дорога, ще кілька днів."
    mm "Я знаю, просто дуже збуджена."
    mc "Збережи сили на канун Різдва."
    mm e4 "Я буду спати спокійно, тату, я не дитина."
    mc "Знаю, знаю, просто кажу."
    show miyuki e7
    s "Тепер, Міюкі, ти завжди будеш маминою дитиною."
    mm "Тітко, це інше."
    s "Гей, якщо ти хочеш, іди вибери щось з цукеркового відділу, я пригощаю."
    mm back om "Правда?! Добре!"
    #fade out Miyu
    show miyuki at thide
    hide miyuki

    show sayori at t11
    mc "Ти балуєш її, знаєш?"
    s "Хто балуватиме її, якщо не я?"
    mc "Містер Міттенс."
    s "Він отримує достатньо, повір."
    mc "Давати їй цукор так пізно, ти дійсно збираєшся робити це зі мною, так?"
    s ce "Що сказати, я весела тітка."
    mc "Угу."
    mc "Як пройшов день?"
    s oe "Нічого незвичайного."
    s "Нічого, з чим я не можу впоратися."
    mc "Добре, менше приводів турбуватися про завтрашній день."
    s ce "Ага."
    show sayori oe
    mc "Мію, поквапся, будь ласка!"
    mm "Дуже складно вибрати!" #offscreen
    mc "Хех, вона звучить як ти."
    s "Вибирати цукерку не легко."
    mc "Каже той, хто просто скуповує їх усі."
    s ce "Це економить мені час." #gleeful
    mc "Твій стоматолог, мабуть, любить тебе."
    s nerv oe "Я отримую від нього різдвяні листівки, тож, можливо, хе-хе."
    mc "Так, це має сенс..."
    show sayori happ at t21
    show miyuki winter at t22
    mm om "Добре, думаю, я знайшла."
    mc "...Тобі знадобилося так багато часу, щоб вибрати Кіт-кат?"
    mm e4 "У нього є багато видів!"
    s "Вона права, знаєш."
    show miyuki e7
    mc "Так-так-так."
    mc "Нехай тітка заплатить за це, а потім вирушимо додому до мами."
    mm "Дякую, тітко Сайорі."
    s ce "Нема за що, Мію."
    show sayori oe
    mc "Вдалий день для тебе, Міюкі?"
    mm "Так, сьогодні було весело."
    "Для неї, може, ну а у мене побачення з коханою дружиною і чашка кави після цього."
    "Ходити цілий день виснажливо."
    s "Тримай, Мію."
    mm e4 "Смачно! Дякую ще раз."
    show miyuki e7
    s "Завжди будь ласка."
    mc "Чудово, ми вирушаємо."
    mc "Передай Чеду, щоб він не наробив дурниць."
    s "Я зрозуміла."
    mm "До побачення, тітко Сайорі, скоро побачимося!"
    s "Обов'язково, доброї ночі, Мію."
    mc "Побачимося, Сай."
    #fade out

    scene bg living_room_day with fadehold
    show miyuki winter at t11

    mc "Ми вдома!"
    mm "Мамо, ти де?"
    show monika forward_yellow happ cm oe at t21
    show miyuki at t22
    m ce "Завжди поруч, ага, привіт."
    show monika oe
    mm e4 "Привіт, мамо!"
    mc "Гей, мала."
    m "Привіт, коханий."
    #hug/kiss
    show monika ce at h11:
        ease .3 zoom 3.8 yoffset 1900
    #hug/kiss
    window hide dissolve
    pause 2.0
    show monika at h21:
        ease .5 zoom 1.0 yoffset 0
    m "Та-а-ак, як пройшов день?"
    mm e7 "Весело!"
    mc "Втомлююче."
    mc "Потрібна кава."
    m "На кухні є трохи."
    mc "Чудово, скоро повернуся."
    #fadeout miyu and monika, then switch to kitchen bg
    scene bg kitchen with wipeleft
    "{cps=*1.5}Кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава кава{/cps} {nw}"
    "У такі дні, як цей, я дякую Богу, що Моніка теж любить каву."
    "Я просто наповню найбільшу чашку, яка у нас є, цього повинно вистачити на весь вечір."
    "Дивно, що нам з Монікою обом подобається чорна кава."
    "Я маю на увазі, які шанси."
    "...Хм, вечеря не готувалася, я що, забув приготувати її в один з вечорів?"
    #remove textbox, back to living room
    mc "Не кажи мені, що я забув приготувати вечерю..."
    show monika forward_yellow happ cm oe at t21
    show miyuki casual at t22
    m rhip "О, ні-ні, я щойно замовила вечерю, день видався трохи довгим, тому мені не хотілося готувати."
    m rdown "Я сподіваюся, що все в порядку."
    mc "Мене це влаштовує."
    m "Що щодо тебе?"
    mc "А, так!"
    mc "Ти сказала їй, Мію?"
    mm pose "Начебто!" #like the screenshot
    show miyuki neutral
    m ce "Ага, вона згадала булочку з корицею, книгу та цукерку."
    m oe "Я не можу повірити, що це все, з чого складався день."
    mc "Не зовсім, ха-ха."
    m "Тепер, якщо можеш, заповни відсутні прогалини."
    mc "Що ж, довгі історії коротко."
    mc "Булочка з корицею дісталася від Нацукі, яка, швидше за все, не зможе прийти."
    m neut "О, що ж, це прикро."
    mm "Я сподіваюся, що вона зможе знайти спосіб відвідати нас."
    m happ "Я теж на це сподіваюся, доню."
    m "Так, ти приніс мені одну?"
    mc "Ні, але я дійсно поводився як дитина, щоб здобути її."
    m neut "Що?"
    mm e4 "Тато просто поводиться по-дурному, він цього не робив."
    mc "Звісно, ні."
    show miyuki e7
    m laug ce "Слава Богу."
    show monika happ oe
    mc "Я просто пригрозив, і це було все, що вимагалося."
    m anno "Х-х-х-х, звісно, ти це зробив."
    mc "Якщо це допоможе, на той час там більше нікого не було, і це було справді кумедно."
    m "Чомусь я не почуваюся краще."
    mc "Це тому, що я не приніс тобі ще одну, чи не так?"
    m happ "...Можливо."
    mc "Я візьму одну, коли наступного разу проїжджатиму там."
    m ce "Дякую."
    m oe "А що щодо Юрі та Сайорі?"
    mc "Що ж, Сайорі, очевидно, зможе прийти, і ось звідки взялися цукерки."
    m "Очевидно."
    mc "Сайорі дійсно подобається балувати її."
    mm "Тітка Сайорі дійсно мила."
    m "Так, це так, особливо для тебе."
    mm e4 "Е-хе-хе-хе."
    mc "Юрі теж може прийти."
    mm e7 "Я купила книгу, мамо!"
    mm back "Можемо ми прочитати її разом пізніше?"
    m neut cm "М-м-м?"
    mc "Вона купила книгу на свої «кишенькові» гроші."
    "І це не прямо щоб домашні справи, на кшталт миття посуду."
    "Ми просто змушуємо її робити маленькі речі, щоб навчити її відповідальності."
    m happ "Це досить круто."
    m "Звісно, ми можемо прочитати це пізніше, після вечері звучить добре?"
    mm neutral "Угу."
    m "Можливо Нацукі, Сайорі та Юрі, так?"
    mc "Ага."
    mc "Що щодо твого друга?"
    m "Кото сказала, що вона, ймовірно, зможе затриматися ненадовго."
    mc "Чудово."
    m "А твій брат?"
    mc "... "
    m neut "Ти забув написати йому, чи не так?"
    mc "Ні..."
    mc "Гаразд, можливо."
    mc "Ось, я напишу йому прямо зараз."

    mc_nvl "Швидке питання, ти можеш прийти на вечірку на канун Різдва?"
    mc_nvl "Твоїй племінниці сподобається, якщо ти зможеш."

    mc "Готово."
    mc "Подивимося, що він відповість."
    mc "Навіть якщо він не зможе, у нас і так достатньо людей для вечірки."
    m happ "Схоже на те, поки ніхто нічого не придумав."
    mc "Тим не менш, найгірше, що може бути, це невелике зібрання."

    m neut "Правда."
    m happ "Ну, ми просто зробимо все можливе."
    mm e4 "Так!"
    mm e7 "Буде весело."
    m "Звісно, буде, доню."
    m "А що стосується вас, містере, чи можете ви принести ялинку завтра?"
    mc "Ймовірно після роботи."
    "Моя провина, що я так довго чекав."
    m "Добре."
    m "Я можу відвести Мію до торгового центру завтра, щоб купити прикраси та інше."
    mc "Це спрацює."
    mm e4 "Торговий день з мамою."
    show miyuki e7
    m ce "Так, трохи часу мами та Мію."
    mm e4 "Ура!"
    mc "Що ж, сподіваюся, вам двом сподобається цей день, і я обов'язково куплю ялинку, перш ніж повернуся додому."
    show miyuki e7
    m oe "Чудово."
    mc "Може, подивимося телевізор, поки їжу не доставили?"
    m "Звісно."
    mm "Давайте подивимося різдвяний фільм."
    mc "Добре, вибери той, який будемо дивитися."
    "Думаю, це буде досить веселий спосіб провести вечір."
    "Гарний спосіб закінчити день."
    "А завтра знову на роботу."
    "Ура."
    stop music fadeout 1.0
    #fadeout









