label story6:
    scene black
    with fadehold
    window hide dissolve
    pause 2.0

    show screen end6 with fade
    pause 5.0
    hide screen end6
    pause 2.0
    screen end6:
        text "25 грудня." yalign 0.5 xalign 0.5
    scene bg black with dissolve_scene_full
    #black
    "Різдвяний ранок."
    "Іноді так приємно прокидатися першим."
    "Настає новий день, і в повітрі відчувається якась магія."
    "Сьогоднішній день — сімейний."
    "Б'юсь об заклад, Мію теж дуже рада."
    "Я маю на увазі, що достатньо подивитися на те, як вона раділа вчора—"
    mc "Гр-р-р-р-р!"
    play music firelofi
    #fadein Miyu close
    scene bg bedroom_dark with fade
    show miyuki pajama at t11
    mm e4 "Прокидайся, тату, Різдво настало!"
    show miyuki e7
    mc "Гр-р-р... я й так не сплю..."
    "І таке відчуття, ніби мене молотом вдарили."
    "Моніка казала мені, що встане разом із Міюкі..."
    "... А-а. Моніки немає в кімнаті."
    "Схоже, наша дорога донька втекла, щоб розбудити мене."
    mc "З Різдвом, Міюкі."
    mm e4 "З Різдвом!"
    mm e7 "Можна вже почати відкривати подарунки?"
    mm "Мама сказала чекати на тебе!"
    mc "Дай вгадаю, ти втомилася чекати?"
    mm m10 e4 "Ага."
    show miyuki cm e7
    mc "Коли ти встала?"
    mm "Я встала раніше, ніж сонце!"
    "Чорт, а це й справді дуже рано."
    "Ну... не можу ж я розсердитися на неї в такий день."
    mc "Добре, зараз зберуся. Спускайся, я приєднаюся за кілька хвилин."
    mm "Окей!" #fadeout Miyu
    show miyuki at thide
    hide miyuki
    "Саме час побороти бажання лягти спати."
    "Ех-х... це лише на один день. Я впораюся."
    "Краще вже залишуся в піжамі, ніж буду дотримуватися формальностей."

    scene bg living_room_day_christmas with fade
    show miyuki pajama at t21
    show monika pjs happ cm oe at t22

    mc "Ось і я."
    m "Доброго ранку, любий."
    show monika ce at h11:
        ease .3 zoom 3.8 yoffset 1900 
    #hug/kiss
    window hide dissolve
    pause 2.0
    show monika at h22:
        ease .5 zoom 1.0 yoffset 0
    #kiss
     

    m "З Різдвом."
    mc "З Різдвом, Моні."
    mc "Ти приготувала мені каву?"
    mc "Найкращий подарунок на Різдво."
    m "Якщо тебе так легко вразити, то ти дуже здивуєшся тому, що я ще приготувала."
    mc "Я дуже хочу в це вірити."
    mc "Ти знаєш мене набагато краще, ніж я сам, коли йдеться про подарунки для мене."
    mm "Можна я вже відкрию свої подарунки?!"
    m "Оскільки тато тут, можеш починати, сонечко."
    "Сподіваюся, їй сподобаються наші подарунки."
    "У найгіршому випадку, один із них точно зведе її з розуму від радості."
    "Там лежить досить дорогий планшет..."
    "Набагато дорожчий, ніж те, що вона могла б собі дозволити на кишенькові гроші."
    "Я впевнений, що вона буде сяяти від щастя, як різдвяна ялинка."
    m "Мені здається, пора і нам вже відкривати подарунки."
    mc "Тоді, почнемо."
    #fadeout/fadein
    scene bg living_room_day_christmas with fade
    show miyuki pajama at t21
    show monika pjs happ cm oe at t22
    "Кожен почав розпаковувати свій подарунок."
    "Мушу сказати, не думав, що Моніка візьме квитки на гарячі джерела для мене... чи точніше, для нас."
    "Я не скаржуся, але чорт забирай. Знову мої подарунки в тіні її подарунків."
    "Але немає сенсу постійно зациклюватися на цьому."
    "Особливо зараз, бо Міюкі вже дійшла до потрібного подарунка."
    #cg 
    scene miyucg with dissolve
    mm "А в цій коробці що?"
    m "Ну так відкрий і подивись."
    mm "Тут щось важке!"
    mc "Ага, ми туди каміння поклали."
    mm "Красиве каміння?"
    mc "Це був жарт, Мію."
    mc "І ти можеш сама в цьому переконатися."
    mm "Окей, але я хочу бути впевнена, що і ти це побачиш."
    mc "Ми разом із мамою підготували його, тож так, ми дуже хочемо побачити твою реакцію."
    mm "Окей!"
    "Вона буде кричати від захвату."
    "Треба підготуватися до головного болю..."
    #living room again/ shock miyu
    
    scene bg living_room_day_christmas with dissolve
    show miyuki pajama m6 at t21
    show monika pjs happ cm oe at t22
    "..."
    "Хм-м? {w} {cps=30}Чому вона не крич–{/cps} {nw}"
    mm m1 e6 "А-А-А-А-А-А-А-А-А-А-А-А-А-А-А-А!!!!!!!!!!" #star eyed miyu
    mm e4 "ВІН ТАКИЙ КЛАСНИЙ! КЛАСНИЙ КЛАСНИЙ КЛАСНИЙ КЛАСНИЙ!!!!!!"
    show miyuki cm
    mc "Гей, Моні, здається, їй сподобалось."
    m "Мені теж так здається."
    mm e6 m2 "ЦЕ ТА-А-А-АК КЛАСНО!!!!!!!"
    mm e4 "СПА-А-А-СИ-И-БІ!!!!!!!"
    show miyuki cm
    mc "Чорт, здається, до нас і сусіди можуть завітати."
    m laug ce "Два будинки по обидва боки від нас, принаймні."
    show monika happ oe
    mc "Що ж, я піду снідати, а ти розбирайся з криками."
    m anno rhip "Ой-ой-ой, дуже турботливо з твого боку." #sarcastic
    mc "Та ну? Іноді я й сам дивуюсь своїй доброті."
    m mj "М-м-м."
    show monika rdown neut oe cm
    mc "Якщо тобі буде легше, я зроблю все, що ти захочеш."
    m happ "Думаю, треба зробити те, що хоче вона."
    mc "Невже ти хочеш сказати, що вона заспокоїться прямо зараз?"
    m "Скоріше за все? ні."
    m "Просто приготуй фруктовий салат з млинцями, і думаю, цього вистачить."
    mc "Зрозумів."
    #fadeout
    stop music fadeout 1.0

    scene bg kitchen with fadehold
    #show all three
    show monika pjs happ cm oe at t21
    show miyuki pajama at t22
    play music snowyjazz
    "Все вийшло на диво чудово."
    "Не так вже й багато треба зусиль, щоб зробити дитину щасливою."
    "Особливо коли вона вже літає в хмарах після відкриття подарунків."
    mm e4 "Дякую за сніданок, тату."
    show miyuki e7
    mc "Завжди будь ласка."
    mm "Що будемо робити до вечері?"
    mc "Хм-м-м... Як щодо подрімати?"
    mm m4 "Це тупо, я не хочу спати."
    show miyuki m9
    mc "Це ти зараз так кажеш. Подивимось, що скажеш, коли будеш мого віку."
    mm b3 m4 "Ні."
    show miyuki m9
    mc "А-га."
    mm m4 "Я ненавиджу спати."
    show miyuki m9
    mc "Одного дня ти все зрозумієш."
    mc "Але сьогодні я пожартував, доню."
    mc "Думаю, ми можемо і розважитись."
    mm m4 "Без сну."
    show miyuki m9
    mc "Так-так, без сну."
    show miyuki b1

    m "А як щодо того, щоб пограти у щось веселе?"
    mm om "Ця ідея звучить набагато краще, ніж татова!"
    m ce "Рада чути."
    show monika oe
    "М-да, щоб вигравати в таких ситуаціях, мені потрібен син."
    mc "Тільки не кажіть мені, що ви вирішили зайнятися дурницями замість того, щоб подрімати."
    m "В будь-який інший день."
    m "Але оскільки зараз Різдво, навіть не думай засинати."
    mc "І не думав, я просто вас підколював."
    m "Ось і добре."
    #*phone ringing*
    play audio dial
    window hide dissolve
    pause 7.0
    "М-м-м?"
    show monika neut
    mc "Чому твоя мама дзвонить мені?"
    m "Мій телефон залишився нагорі, думаю, вона вже встигла мені подзвонити."
    mc "Я так не хочу брати слухавку." #і ти теж не будь злюкою, в оригіналі немає жодного міцного слова
    m anno "Не будь такою злюкою хоча б сьогодні."
    mc "Гаразд-гаразд."
    #splitscreen kitchen/hanae house or something
    show momika rchest cm at t31
    show hanae_split behind momika
    show monika happ at t43
    show miyuki at t44
    mc "З Різдвом, бабусю моєї доньки."
    m anno "[player]..."
    show monika neut
    ha "Звучить святково."
    ha rhip "Я хотіла б поговорити зі своєю донькою і онукою."
    mc "Я так і подумав."
    mc "Зараз передам їм телефон."
    ha "Не тягни кота за хвіст."
    "Ця жінка — єдиний недолік одруження на Моніці."
    m happ "Привіт, мамо, щасливого Різдва!"
    ha rchest m3 "З Різдвом, доню."
    show momika m2
    mm e4 "З Різдвом, бабусю!"
    ha m3 b2 e2 "І тобі того ж, онучко!"
    ha e1 "Мабуть, Санта вже залишив тобі цілу гору подарунків?"
    show momika m2
    mm e7 "Ага, тут стільки класних речей!"
    ha m3 "Рада чути."
    ha e2 "У мене теж є для тебе подарунки, тож завітай як-небудь."
    show momika e1 m2
    mm e6 "Справді?!"
    ha m3 "Звісно, мила, не думаєш же ти, що твоя бабуся залишить тебе без подарунків?"
    show miyuki e7
    
    ha b1 "Тут і для тебе подарунки є, Моніко."
    show momika m2
    m "Дякую, мамо, можливо, ми зайдемо до тебе ненадовго ближче до другої половини дня."
    ha m3 "Чудово."
    show momika m2
    "Мене туди не затягнете."
    "Це абсолютно не має сенсу."
    ha om "Ну, я просто хотіла подзвонити і побажати вам двом щасливого Різдва, тож можете повертатися до ранку з батьком."
    m anno "Його звати [player], мамо."
    ha "Так, я знаю, доню."
    show monika neut
    mc "Гарного дня, Ханае."
    ha "Обов'язково."
    show monika happ
    mm "Бувай, бабусю!"
    ha m3 "Бувай, онучко, побачимось пізніше."
    show momika m2
    mm e4 "Ага!"
    #end call
    show momika at thide
    hide momika
    show hanae_split at thide
    hide hanae_split
    show monika at t21
    show miyuki e7 at t22
    mc "Тобі хтось колись казав, як добре, що ти не стала схожою на свою маму?"
    mc "Бо я буду радий стати першим."
    m neut "Я знаю, що вона може бути трохи різкою, але повір на слово, вона хоче найкращого для мене і її онуки."
    show miyuki m9
    mc "Так, якби не я, не було б у неї онуки, тож могла б ставитися поблажливіше."
    mm m4 "Чому це мене не було б?"
    show miyuki m9
    mc "Це розмова для дуже дорослої Міюкі."
    mm m4 "Оу-у, окей."
    show miyuki m9
    mc "Що ж, тоді план такий: трохи пізніше ви двоє йдете до неї, а я йду дрімати, і цього разу я не жартую."
    m "Ти не підеш?"
    mc "Щоб потім вона вилила на мене відро помиїв? Ні, дякую."
    mc "Моя зустріч із нею може обернутися цілим реп-батлом, і я впевнений, що ваш день від цього кращим не стане."
    mc "Не хвилюйтеся, я нікуди не втечу. Зате матиму можливість приготувати вечерю."
    m "Якщо ти так впевнений."
    show miyuki cm
    mc "Я ніколи не був так впевнений у своєму житті, окрім того моменту, коли вирішив одружитися з тобою."
    m laug mb "Оу-у-у, як мило."
    show monika ma
    mc "Так, я солодкий, як мед."
    m happ oe "Звісно, мій солоденький."
    mc "Боже, я почуваюся таким щасливим, тільки подивіться."
    m ce "Ну, хтось же мав бути таким."
    show monika oe
    mm "А я завжди щаслива на Різдво!"
    mc "Якби тобі колись було сумно на Різдво, ми з мамою швидко б усе виправили."
    m "Абсолютно."
    mm "Я взагалі не розумію, як можна сумувати перед Різдвом. Це ж так весело!"
    mc "Оце правильно! Нема чого сумувати в такий гарний день."
    mm e4 "Ніколи б і не подумала!"
    show miyuki e7
    mc "До речі, тепер, коли сніданок готовий, час грати?"
    mm e4 "Ура-а-а, час ігор!"
    show miyuki e7
    m ce "Я сприйму це як «так»."
    mc "Чудово, можете займатися чим хочете, поки я мию посуд."
    m oe "Приємно чути. Мію, йди допоможи мамі."
    mm "Окей!" #fadeout both
    #fadeout
    stop music fadeout 1.0

    #living room (minus gifts)
    #eyes closed
    #*doorbell*
    
    scene bg living_room_day_christmas2 with fadehold
    play audio doorbell
    play music clubs
    "М-м-м?"
    "Хто посмів потривожити мій райський острівець тиші?"
    #*doorbell*
    play audio doorbell
    "Зараз Різдво, тож я, мабуть, повинен відповісти."
    scene bg entrance with wipeleft
    show sayori winterhoodie happ cm ce at t11
    s "З Різдвом!"
    mc "Оу, привіт, Сайорі. І тебе з Різдвом."
    s oe "Як виявилося, у мене з'явилося трохи вільного часу, тому я вирішила заскочити ненадовго до вас."
    mc "Ну поки що тут тільки я, але в іншому почувайся як вдома."
    s neut "А де Моніка і Міюкі?"
    mc "У бабусі."
    s "Оу, а ти чому тут залишився?"
    mc "Ти зараз серйозно?"
    s curi e1a "Ем-м-м... мабуть?"
    show sayori neut oe
    mc "Скажімо так... я не дуже ладнаю з мамою Моніки."
    s "Але ж зараз Різдво."
    mc "Послухай. Єдиний раз, коли ми при зустрічі не почнемо сваритися як шевці, це її похорон."
    mc "Простіше кажучи, мені просто зручніше залишатися тут."
    s "Якщо так подумати, то ти, мабуть, правий."
    mc "З огляду на це, хочеш ще зайти?"
    s happ "Звісно."
    scene bg living_room_day_christmas2
    show sayori winterhoodie happ cm oe at t11
    mc "Як пройшов твій день?"
    s laug ce "Дуже зайнята, ага. По суті, зараз моя перерва."
    show sayori happ oe
    mc "І це плюси великої сім'ї, так?"
    s "Твої батьки заходили чи що?"
    mc "Ні, цього року вони вирішили провести Різдво на тропічному острові."
    "Мабуть, приємно бути достатньо багатим для такого."
    s neut "Вау, хотіла б я поїхати з ними."
    mc "... Що? Навіщо моїм батькам запрошувати тебе у відпустку з собою?"
    mc "Вони ж можуть запросити мене."
    s happ "Так, але я веселіша!"
    mc "... Це взагалі не аргумент."
    s "Думаю, ми ніколи не дізнаємося, що б вони подумали з цього приводу."
    mc "У будь-якому разі, у мене не було бажання їхати з ними."
    mc "Я вважаю стандартні поїздки на пляж нудними."
    s anno "Пляжі не нудні!"
    s happ "На пляжі можна багато чого робити."
    mc "Добре, якщо провести на пляжі кілька годин або навіть день-другий."
    mc "Але поїхати більше ніж на тиждень? Вибачте."
    #*bzzt*
    play audio phone
    mc "Оу, зачекай поки."
    nvl clear
    n_nvl "Здоров, дурнику, з Різдвом"
    mc_nvl "Як завжди ти випромінюєш позитив"
    mc_nvl "Але і тебе з Різдвом"
    mc_nvl "Коли ти мені востаннє дзвонила?"
    n_nvl "Забув мій голос? Я ж дзвонила тільки вчора, а-ха-ха-ха"
    mc_nvl "Не лестіть собі"
    n_nvl "Насправді, я вже дзвонила Моніці, але вона і Міюкі були у її мами"
    mc_nvl "Ти так це сказала, ніби я і сам не знав про це"
    n_nvl "Хто тебе, розумнику, знає. Ти міг би досі валятися в ліжечку"
    n_nvl "У будь-якому разі, ліміт твоєї сім'ї на мій дзвінок вже вичерпано, тож отримуй смс-ки"
    mc_nvl "Вважатиму за честь отримати повідомлення від тебе"
    n_nvl "Як і має бути :p"
    n_nvl "Я зараз іду до сім'ї свого хлопця, тож поговоримо пізніше"
    mc_nvl "До зустрічі"

    s neut "Це була Нацукі?"
    mc "Як ти здогадалася?"
    s happ "Твоє обличчя говорить саме за себе — «Типова Нацукі»."
    mc "Чорт, невже мене можна читати як книжку?"
    s "Ми з тобою давно дружимо, тож будь-хто на моєму місці здогадався б."
    s "Але також вона дзвонила мені раніше і згадала, що хотіла обдзвонити вас, пізніше того ж дня."
    mc "Ага, так я і зрозумів, що ти щось приховала."
    s ce "Знаєш, важко повірити, що рік майже закінчився."
    mc "Що ти маєш на увазі?"
    s oe "Він пройшов як блискавка! Хіба ти не думаєш так само?"
    mc "Насправді ні. Деякі люди можуть думати так, але це тому, що рік підходить до кінця."
    s neut "Думаю, ти правий, час тече як пісок крізь пальці."
    s happ ce "Навіть так, минулий рік був дуже веселим." #gleeful
    mc "Так, був, Сайорі."
    show sayori oe
    "З огляду на всі обставини, це був гарний рік."
    "У мене все гаразд зі здоров'ям і сім'єю."
    "Я й не думав просити про щось більше."
    "Хоча, якби мені дали можливість, я б попросив мільйон доларів."
    "Продовжую літати в хмарах."
    mc "Мабуть, я повинен запросити тебе на вечерю. Але ж у тебе зустріч із сім'єю цього вечора, так?"
    s "Так, дякую за запрошення, але скоро мені доведеться йти вечеряти з сім'єю."
    s ce "Насправді... гей, може, ми всі зможемо потусити тут у новорічну ніч!"
    show sayori oe
    mc "Так, мабуть, це було б весело."
    s "Я впевнена, що Моніка і Мію не заперечували б."
    mc "Скоріше за все, я спитаю якось Моніку."
    s ce "Дай мені знати, якщо вона відповість!"
    mc "Обов'язково."
    s oe neut "До речі, котра година?"
    mc "Е-е-е... пів на четверту."
    s "Чорт. Схоже, мені вже треба повертатися."
    mc "Чорт, ти ж буквально щойно прийшла."
    s laug ce "Ага-а-а, так, я ж казала, що у мене лише невелика перерва."
    show sayori happ oe
    mc "Мабуть, буде краще, якщо я візьмуся за вечерю, як ти підеш, щоб мені не було нудно."
    s ce "Сподіваюся, що твоя кулінарія не вилізе боком."
    show sayori oe
    mc "Мої кулінарні здібності не такі гарні, як у Моніки, але я впораюся."
    mc "Бажаю насолодитися вечерею з сім'єю."
    s ce "Постараюся, еге-ге-ге."
    s oe "Поговоримо пізніше!"
    mc "Ага, бувай, Сайорі."
    #fadeout Sayori
    show sayori at thide
    hide sayori
    "Так, гаразд, вечеря сама себе не приготує."
    "І я майже впевнений, що Моніка не буде рада, якщо я замовлю їжу на виніс." #door shut sound
    "Почнемо ж."
    #fadeout
    stop music fadeout 1.0

    scene bg kitchen with fadehold
    play music wonderland

    #show monika and miyu
    show monika forward_yellow happ cm oe at t21
    show miyuki casual at t22
    m "Непогано, любий."
    mm "Виглядає дуже апетитно, тату!"
    mc "Я отримав два позитивних відгуки, і це саме те, що я хотів почути."
    mc "Сподіваюся, на смак так само, як і на вигляд."
    m ce "Є лише один спосіб це перевірити." #glee
    show monika oe
    mc "Не знаю, що на мене таке найшло, але як пройшов твій візит до мами?"
    m "Було дуже мило. Вона купила Мію купу нового одягу і кілька іграшок для дому."
    mc "Я не знав, що твоя мама любить гратися з іграшками, хоча навряд чи вона отримала б від них задоволення."
    m rhip anno "Іграшки купили для Міюкі, розумнику."
    show monika rdown neut 
    mm "Вона теж може з ними погратися, якщо захоче. Бабуся дуже мила."
    mc "Гей, не поспішай давати такі розумні поради тим, кому не вистачить розуму їх зрозуміти."
    show miyuki m9
    m angr "[player]!" 
    mc "Не втримався, вибач."
    m anno "Не кажи такого при ній."
    mc "Так-так, я зрозумів, моя вина."
    "Іноді моє «дотепність» бере гору наді мною, я можу це визнати."
    show monika neut
    mc "Мію, просто не слухай свого тата, якщо він несе всяку нісенітницю, гаразд?"
    mm m4 "Е-е-е, добре, тату."
    show miyuki m9
    mc "Тато дуже радий, що бабуся так сильно тебе балує."
    show monika happ
    show miyuki cm
    "Навіть якщо вона дбає про неї лише один день на рік."
    m "Ми обидва чудово провели час, ось що справді важливо."
    mc "Згоден, я теж прекрасно провів час."
    m "Лежачи під ковдрою, так?"
    mc "Лише трохи. Сайорі приходила поговорити зі мною ненадовго."
    mc "Вона хотіла побачити всіх нас. Шкода, що вас тут не було."
    mm b2 m4 "Ой, я пропустила візит тітки Сайорі?"
    show miyuki m9
    mc "На жаль, так, але я впевнений, що вона скоро зайде знову."
    mm om b1 "Сподіваюся!"
    mc "Якщо я перевірю, чи зможе вона прийти до тебе завтра, тобі це сподобається?"
    mm "Звучить весело."
    mc "Я теж так думаю."
    m "Я можу спитати її, якщо хочеш. Я все одно збиралася подзвонити їй пізніше, щоб побажати щасливого Різдва."
    mc "Якщо тобі не лінь. Але, здається, вона у своєї сім'ї вечеряє, тож подзвонимо пізніше."
    m ce "Ну, я і не збиралася дзвонити під час вечері."
    show monika oe
    mc "... Так, чесно кажучи, це більше схоже на те, що зробив би я."
    m "І справді."
    mm "Ой! Тату, а бабуся мені ще й шоколад дала!"
    mc "Ти хочеш його з'їсти?"
    mm "Ага! Можна після вечері?"
    mc "Не бачу причини відмовляти, тим більше, на Різдво. Один із тих днів, коли додаткові солодощі дозволяються."
    mm e4 "Ура! Дякую, тату."
    mc "Будь ласка, дурненька."
    mm "Еге-ге-ге-ге."
    m "Тільки трохи, не хочу, щоб у тебе болів живіт."
    mm e7 "Я знаю, мамо. Просто хочеться шоколадного Санту."
    m "Ну тоді добре, він же все одно невеликий."
    mc "А мій шоколадний Санта де?"
    mm "Не знаю, спитай у бабусі."
    mc "А, зрештою, не дуже й хотілося..."
    "Мені буде легше одразу в пекло потрапити."
    mc "Я все одно пожартував. Якщо що, можу трохи вкрасти у мами."
    m ce "Я б і так з тобою поділилася."
    show monika oe
    mc "Бачиш? Працює, як швейцарський годинник."
    mm e4 "Ти такий дурний, тату."
    mc "Знаю-знаю, сказали б дякую за те, що я підтримую вас у формі."
    mm e7 "Ага!"
    m "Треба подзвонити Юрі трохи пізніше."
    mc "Так, мабуть, вона боїться нас потурбувати, тому і не подзвонила сама."
    m rhip "Клянусь, ось хто-хто, а вона знає, що не буде набридливою."
    show monika rdown 
    mc "Знаю-знаю, але у неї такий характер."
    mc "Вічно вона у себе в голові шторм влаштовує."
    m "Думаю, вона нічого з цим не може зробити."
    mc "Не те, щоб це була проблема. Треба дати їй знати, що вона не потурбує нас своїм дзвінком."
    m "Зроблю так, щоб вона не знала, що ми це обговорювали."
    mc "Чудовий план."
    mc "До речі, про тітку Юрі, я чув, що вчора ввечері вона читала тобі казку на ніч, Мію."
    mm e4 "Ага, я попросила її, і вона була рада мені прочитати."
    show miyuki e7
    mc "Вона дбає про тебе. Мені здається, вона була щаслива, коли ти попросила її провести з тобою час."
    mm "Мені подобається тітка Юрі, хотілося б читати з нею більше."
    mc "Впевнений, вона буде рада це почути."
    m ce "Тітка Юрі любить читати і, звісно, вона буде рада поділитися улюбленою справою з племінницею."
    show monika oe
    mm "Я впевнена, вона може розповісти багато класних історій."
    mc "Безумовно."
    m "Ага, а їсти хто замість вас буде? Їжа холоне."
    mc "Ага, у нас ще буде час поговорити."
    "Чудовий день для повного релаксу. Провести час із сім'єю — це ідеальний спосіб закінчити день."
    "Я не жартую: це справді гарний спосіб закінчити день."
    "Я багато скаржуся на життя, але коли йдеться про нього, то моя дружина і донька — це все, що мені справді потрібно."
    "Поки вони у мене є, я підкорю весь світ, якщо до цього дійде."
    "Боже, мені краще припинити думати настільки сентиментально — не хочу плакати за вечерею, а-ха-ха-ха."
    #fadeout
    stop music fadeout 1.0
    scene bg living_room_night_christmas2 with fadehold
    show monika forward_yellow happ cm oe at t11
    play music firelofi

    "Тихий вечір — це саме те, чого я просив, і тихий вечір — це саме те, що я отримав."
    "Після вечері Моніка зателефонувала Сайорі та Юрі."
    "Юрі, як ми й здогадувалися, хвилювалася, що може нам завадити, але вона по суті є частиною нашої сім'ї."
    "Так, вона, як і Сайорі з Нацукі, не наші родичі по крові, але все одно вони для нас — сім'я."
    "По телефону Сайорі була набагато веселішою, і, на велику радість Міюкі, вона збирається запросити її завтра на обід."
    "Ну а тепер трохи сімейного часу."
    "Моніка виконує композиції зі свого улюбленого репертуару, а Мію грає зі своїми новими іграшками."
    "Це досить безтурботно, чесн-"
    m "Про що думаєш?"
    mc "О, просто розповідав про наше життя у своїй голові."
    m laug ce "Що?" #glee/laughish
    show monika oe
    mc "Краще не питай, а-ха-ха-ха."
    mc "Це моя дивна звичка."
    m ce "Я зрозуміла, просто типовий ти."
    show monika happ
    mc "Я так радий, що ми розуміємо одне одного."
    m oe "[player], а як наше життя виглядає з твоєї точки зору?"
    mc "Чудово."
    m "Прекрасна відповідь."
    mc "Справді?"
    m ma ce "Угу." #glee
    show monika oe cm
    mc "Це був гарний день, і він заслуговує на певне внутрішнє осмислення."
    m neut "Твоя правда. Але я б хотіла, щоб ти прийшов до моєї мами."
    mc "Повір, не вийшов би такий гарний день, якби я прийшов до неї."
    m "Я все ще сподіваюся, що ти колись наважишся."
    mc "Не виключаю, але це дуже малоймовірно."
    m happ "Тобі просто потрібно почати будувати з нею стосунки."
    mc "Думаю, тут ти права."
    mc "Але це проблема, яку я обов'язково вирішу пізніше."
    mc "Давай закінчимо сьогодні без проблем, тільки ми вдвох."
    m "Приємно чути."
    m "Після того, як Міюкі ляже спати, давай подивимось ще один різдвяний фільм."

    mc "Для тебе — все, що завгодно."
    mc "До речі, Міюкі... піду подивлюся, що вона робить."
    m ce "Гаразд, тоді я трохи почитаю."
    #fadeout

    scene bg altbedroomnight with fade
    show miyuki pajama at t11

    mc "Як справи, Мію?"
    mm "Граю, а що?"
    mc "Ти граєш сама на Різдво?"
    mm "У мене не було часу грати весь день."
    mm "Мені було дуже весело з тобою, мамою і бабусею!"
    mm "Думаю, мені потрібно трохи часу для себе."
    mc "Тобі теж подобається проводити час наодинці, так? Вся в тата."
    mm "Угу. Приємно іноді посидіти в тиші."
    mc "І мені теж, тиша — це завжди добре."
    "Хоч я й чую це від дитини, але тиша справді хороша лише в малих дозах."
    mc "Здається, я вже знаю відповідь на це питання, але тобі сподобалося, як ми провели Різдво?"
    mm e4 "Було класно, тату."
    show miyuki e7
    mc "Радий це чути."
    mm "А тобі сподобалося?"
    mc "Ну... я щасливий, поки щасливі ви з мамою."
    mm e4 "Бабуся теж була щаслива!"
    show miyuki e7
    mc "О-у-у, я впевнений, що так і було."
    "Звісно, вона була щаслива, раз я не прийшов."
    mc "Але я радий, що вона була щаслива. Це, мабуть, завдяки вашій з мамою присутності."
    mm "Впевнена, якби ти був там, було б ще краще!"
    mc "Може й так, але ми з бабусею не дуже ладнаємо, тому татові краще залишатися вдома."
    mm m4 "Згодна, я не хочу сваритися на Різдво."
    show miyuki m9
    mc "Очевидно, зараз не найкращий день для таких розмов."
    mc "Хоча й в будь-який інший день не варто сваритися з людьми, це... не дуже приємно."
    mm m4 "Тоді чому ти сваришся з бабусею?"
    show miyuki m9
    mc "Бо вона почала першою."
    mm m4 "То виходить, що нормально, якщо хтось починає сварку з тобою першим?"
    show miyuki m9
    mc "Ні."
    mm m4 "Тоді чому–"
    show miyuki m9
    mc "Поговоримо про це іншим разом."
    "Мабуть."
    mc "Ну а зараз вже час лягати спати, чи не так?"
    mm om "Думаю, так, я втомилася за день..."
    mc "Довгий день видався."
    mm e4 "Може, мені варто було подрімати, як ти, тату."
    show miyuki e7
    mc "На Різдво краще не лягати спати якнайдовше."
    mc "Воно ж повернеться лише наступного року."
    mm m4 "До наступного року ще цілий рік, так?"
    show miyuki m9
    mc "Це правда."
    mm m4 b2 "Оу-у... так довго чекати."
    show miyuki m9
    mc "Так і є, але не хвилюйся."
    show miyuki b1
    mc "Ти навіть не помітиш, як швидко промайне час — Різдво настане непомітно для тебе."
    mm m4 "Справді?"
    show miyuki m9
    mc "Так щороку відбувається."
    mm om "Я збираюся заснути дуже швидко, щоб новий рік прийшов трохи раніше."
    mc "Ха-ха-ха, ну, це буде не так швидко, але трохи поспати — гарна ідея."
    mc "Побачимось вранці, добре?"
    mm e4 "Окей. Люблю тебе, тату."
    show miyuki e7
    mc "Я теж тебе люблю, моя маленька Мію, на добраніч."

    scene bg hallway with fade

    "Вона така хороша дитина."
    "Я страшенно везучий хлопець."
    "Я ніколи не був таким на Різдво, поки вона не з'явилася у моєму житті."
    "Боже, невже народження дитини настільки все змінює?"
    "Але це й не так вже й погано."
    "Вона дає нам більше приводів святкувати."
    "Усі зусилля варті того, щоб просто бачити її щасливою."
    "Отже, час завершити це Різдво дурнуватим різдвяним фільмом у обіймах з моєю чудовою дружиною."
    "Який чудовий спосіб завершити день."
    #slow fadeout
label test:
    stop music fadeout 1.0

    #не знаю навіщо я це переклав, раз уже підписано test, але не мені ж розбиратися, так?
    #label test — це епілог основної історії гри від першої особи Міюкі, а не просто «раз раз, перевірка зв'язку»
    scene bg altbedroomdark with dissolve_scene_full
    show miyuki pajama e4 at t11
    miyu "Я сьогодні так повеселилася."
    miyu "Я так люблю Різдво."
    miyu "До наступного ще цілий рік, але думаю, тато правий, усе має пройти швидко."
    miyu "Хм, цікаво, що ми будемо робити завтра?"
    miyu "Сподіваюся, буде весело."
    show miyuki om
    miyu "Про що я говорю? Нам завжди буде весело."
    show miyuki cm
    miyu "Думаю, час спати."
    miyu "Побачимось завтра, світе!"

    scene black with dissolve_scene_full

    play music firelofi
    window hide dissolve
    pause 2.0

    show logo1 
    with dissolve 
    

    show screen finish1 with fade
    pause 5.0
    hide screen finish1
    pause 2.0
    screen finish1:
        text "Дуже дякуємо, що зіграли у «Doki Doki: Christmas Time»" yalign 0.4 xalign 0.5

    show logo1 at thide
    hide logo1
    

    show logo2 with dissolve
    show screen finish2 with fade
    pause 5.0
    hide screen finish2
    pause 2.0
    screen finish2:
        text "Цей мод був створений командою «Team Elevate». Автор сюжету — MikeLowMoney$$$#0382, автор коду — Spraichon#0812." yalign 0.4 xalign 0.5

    show logo2 at thide
    hide logo2
    

    show screen finish3 with fade
    pause 10.0
    hide screen finish3
    pause 2.0
    screen finish3:
        text "Величезна подяка Prox#9492 за всі правки сніжного фону, багатьох спрайтів, заставки та логотипа, а також за головну родзинку — Міюкі. Цього б не було без Prox'а." yalign 0.4 xalign 0.5

    show screen finish5 with fade
    pause 15.0
    hide screen finish5
    pause 2.0
    screen finish5:
        text "Ми щиро вибачаємося за затримку випуску цього моду. У нас було багато планів, і замість того, щоб викладати недороблений шматок на Різдво, ми трохи затрималися, щоб переконатися, що цей мод буде чимось особливим.\n\nЩе раз дякуємо за гру. Ми сподіваємося, що це було варте вашого очікування." yalign 0.4 xalign 0.5
    vn "Привіт!"
    vn "Дякую за проходження модифікації."
    vn "Я хочу вибачитись за те що довго не займався цим."
    vn "Останні місяці вийшли дуже виснажливими і я не міг себе змусити займатись перекладом."
    vn "Щей запалення легень вилізло дуже невчасно разом з НМТ яке я сука НЕ ЗДАВ."
    vn "Ще хочу подякувати ////// за те що запропонував цей мод для перекладу в Говорилці."
    vn "Віталік Бетян якщо ти читаєш це я б хотів з тобою обговорити наступні переклади."
    vn "Я знаю що на момент коли я закінчив цей мод ти займаєшся перекладом WoD і я б хотів допомогти з наступними модами цього світу."
    vn "Якщо ти хочеш зі мною зв'язатись то можеш знайти мене в Говорилці або за юзом @VorkNezer в телеграм."
    vn "Дякую за гру, сподіваюсь вам сподобався цей мод."
    vn "До зустрічі в наступних модифікаціях!"


    #fadeout
