label story4:
    scene black
    with fadehold
    window hide dissolve
    pause 2.0

    show screen end4 with fade
    pause 5.0
    hide screen end4
    pause 2.0
    screen end4:
        text "22 грудня" yalign 0.5 xalign 0.5
    scene bg grocery with dissolve_scene_full
    show miyuki casual at t11
    play music clubs

    mm m4 "Тату, ти виглядаєш сонним."
    show miyuki m9 
    mc "Дай татові пару годин, і я прийду до тями."
    mm m4 "Ти що, вчора не спав?"
    show miyuki m9 
    mc "Звісно, спав."
    mc "Тато просто не жайворонок."
    mm m4 "Хто такий жайворонок?"
    show miyuki m9 
    mc "Божевільний, ось хто."
    mm m4 "Справді?"
    show miyuki
    mc "Ні, я просто жартую."
    mc "Коли я кажу, що я не жайворонок, це означає, що зазвичай я втомлений десь до обіду."
    mc "А жайворонки зазвичай встають і одразу до справи."
    mc "Зрозуміла?"
    mm om "Ага."
    mc "Добре."
    mc "Але не хвилюйся, як приємний бонус роботи тут — я отримую безкоштовну каву, тож я підбадьорюся за пару годин."
    mm "Я хочу гарячий шоколад!"
    mc "Звісно, Мію."
    mm e4 "Дякую, тату."
    mc "Будь ласка."
    #fadeout fadein
    stop music fadeout 1.0

    scene bg grocery with fadehold
    show miyuki casual at t11
    play music yuri_theme
    mm e4 m10 "М-м-м-м."
    mc "Смачно, так?"
    mm om "Так!"
    mm e7 "А де тітка Сайорі?"
    mc "Вона скоро буде."
    mc "Я починаю працювати на годину раніше за неї."
    "Взагалі, переваги роботи менеджером."
    mm e4 "Вона здивується, коли побачить мене."
    mc "Так, це зробить її день."
    mm m4 e7 "Те, що я зараз тут?"
    show miyuki m9
    mc "Те, що ти тут взагалі."
    mc "Вона завжди рада бачити свою маленьку Міюкі."
    mm om e4 "А я завжди рада бачити її."
    show miyuki e7
    mc "О, я знаю."
    "Мію, скоріш за все, буде розважати Сайорі, а я тим часом зроблю всю паперову роботу в тиші й спокої."
    "Або ж вони обидві відволікатимуть мене від роботи як тільки зможуть."
    "Одне з двох."
    show miyuki m9 at t22
    show yuri turned casual happ cm oe at t21
    y "Доброго ранку, [player]."
    mc "Привіт, Юрі, ти на роботу збираєшся?"
    y "Так, я лише візьму з собою каву і щось поїсти на обід."
    y ce "О? Доброго ранку і тобі, Міюкі."
    mm b2 m4 "П-привіт..."
    show miyuki m9
    y oe "Що ти тут робиш?"
    mm m4 "Маму викликали на роботу, тож я пішла з татом."
    show miyuki m9
    y neut "Ох, ясно."
    y happ ce "Ну, я впевнена, що твій день з татом буде веселим."
    y oe "Гаразд, я повернусь за кілька хвилин."
    mc "Добре." #fadeout Yuri
    show yuri at thide
    hide yuri
    show miyuki at t11
    mc "..."
    mm "..."
    mc "Вона не кусається."
    mm b3 m4 "Та знаю я!"
    show miyuki m9
    mc "Угу."
    show miyuki b2
    "Вона завжди боялася Юрі."
    "Хоча, навколо Юрі завжди була така темна аура, тож я її розумію."
    "Я досі пам’ятаю ті нетипові хобі на кшталт колекціонування ножів і розмови про жахи."
    "Ех, були часи..."
    show miyuki at t22
    show yuri turned casual happ cm oe at t21
    y "Щож, я думаю, у мене є все, що мені потрібно."
    mc "Клас. Але хіба маленький бутерброд допоможе тобі пережити день?"
    y "Так, я все одно мало їм."
    mc "Ну, я маю на увазі, що навіть Мію їсть більше."
    y ce "Ну, звісно, вона зростаючий організм, це природно, що вона їсть досить багато."
    show yuri oe
    show miyuki m9 b1
    mc "Припустимо."
    mm om "Навіть мама каже, що я багато їм."
    y "Це в будь-якому випадку набагато краще, ніж недоїдання."
    mc "Уж про це ти точно не хвилюйся."
    mc "Ось твій чек."
    y "Дякую."
    y "Я так думаю, я зустріну вас вже через два дні."
    mc "Цілком вірно."
    mm "Па-па, тітка Юрі..."
    y ce "До побачення." #cheerful and fadeout
    show yuri at thide
    hide yuri
    show miyuki at t11
    mc "Хіба це було настільки погано?"
    mm m4 "Ні."
    show miyuki m9
    mc "Не потрібно боятися тітку Юрі, вона насправді безобідна."
    mm b3 m4 "Я не боюся."
    show miyuki m9
    mc "Ага, звичайно."
    mm e4 m4 "Я не боюся!"
    show miyuki m9
    mc "Звичайно, не боїшся."
    mm e1 m4 "Я ЇЇ НЕ БОЮСЬ!!!" #angry white eyes
    show miyuki m9
    mc "Тихіше, не потрібно кричати."
    mm e7 m4 "Тоді перестань говорити, що я боюся її, тому що я не боюся!"
    show miyuki m9
    mc "Мені все одно, боїшся ти чи ні, не потрібно кричати в магазині."
    mc "Ще раз закричиш, і ти покарана в моєму кабінеті до кінця дня, зрозуміла?"
    mm "..."
    mc "Зрозуміла?"
    mm m4 e5 "...так..."
    show miyuki m9 b2
    mc "Добре."
    show miyuki e7 
    mc "Добре, пробач, що я тебе дразнив."
    mc "Я більше так не зроблю."
    mm m4 "Обіцяєш?"
    show miyuki m9
    mc "Обіцяю."
    mm om "Добре."
    mm m4 "...Ти мене теж пробач, тату."
    show miyuki m9
    mc "Все в порядку, тобі просто пощастило, що зараз в магазині нікого немає."
    mc "Що б подумала тітка Сайорі, якби вона побачила, як ти себе ведеш?"
    mm m4 "...Напевно, їй би не сподобалося."
    mc "Ти абсолютно права, їй би дуже не сподобалося таке."
    mc "Як і твоїй мамі."
    mc "Добре, а тепер припини капризувати, перш ніж тітка з'явиться. Будь ласка."
    mm om "...Добре..."
    stop music fadeout 1.0
    #fadeout/fadein, miyuki neutral face
    scene bg grocery with fadehold
    show miyuki casual m4 at t22
    show sayori work happ cm ce at t21
    play music firelofi
    s "Доброго ранку!" #gleeful eyes closed, miyuki smile
    show miyuki cm
    mc "Доброго."
    s oe "Ой, привіт, Мію!"
    mm "Привіт."
    s "А що ти тут робиш?"
    mc "Японія скасувала закон про заборону дитячої праці, тому я змушую її працювати."
    s angr "Що?!"
    mm m4 "Про що ти говориш, тату?"
    show miyuki m9
    show sayori neut
    mc "Ні про що, доню, тато просто дразнить тітку."
    s laug ce "Я вже на секунду було подумала, що ти серйозно."
    mc "Серйозно? Ти справді подумала, що я змушу свою доньку працювати?"
    s nerv ce "...Може бути."
    s oe "Ще рано, гаразд?! Я досі не прокинулася!"
    mc "Ти чула, Мію? Тітка Сайори – лунатик."
    mm m10 e4 "Е-хе-хе-хе."
    show miyuki cm
    s e1a "Ти знаєш, що я мала на увазі."
    show miyuki e7
    mc "Можливо."
    s happ oe "Добре, тепер серйозно – що вона тут робить?"
    mc "Моніку викликали на роботу, тому мені довелося взяти її з собою."
    s neut "Ох..."
    mc "Що, не настільки безумно, як ти очікувала?"
    s "Ні, я просто здивована, що ти не продовжив ламати комедію і далі."
    mc "Ну, не все одразу, в кінці кінців, день попереду довгий."
    s neut "О, господи, ні."
    mc "Думаю, ти і сама знаєш відповідь на це."
    mc "В будь-якому випадку, мені потрібно, щоб ти за нею наглянула, поки я буду зайнятий паперовою роботою."
    s happ "Ось це мені якраз треба."
    mc "Просто не потрапте в неприємності, пам'ятайте, що я буквально в трьох кроках звідси."
    s ce "Ми? В неприємності? Та ніколи."
    mm e4 om "Так, ми ангели."
    s oe "Ось, вона шарить."
    mc "Ну, раз ви двоє такі ангели, то процедура буде дуже простою."
    show miyuki e7 b3 m9
    s anno mj "Хмф."
    show sayori cm
    mm m4 "Це жорстоко, тату."
    show miyuki m9
    mc "Добре, я швидше говорив тільки про тітку."
    show miyuki b1 m9
    mc "Твоя мама клянеться, що ти її маленький ангел, і оскільки вона права в більшості випадків, я не сперечаюся."
    show miyuki cm
    s "А я ні чи що?"
    show sayori neut
    mc "Я кажу, що ти в найкращому випадку 49%% від ангела."
    s happ "Хм, це майже наполовину ангел – я згодна."
    "Схоже, вона жарт не зрозуміла."
    "Але в мене є робота і інші більш важливі справи, тож немає сенсу пояснювати їй."
    mc "Так... Так-так...."
    mc "В будь-якому випадку, я скоро повернуся, переконаюся, що все в порядку."
    mc "Мію, веди себе добре."
    mm e4 "Звісно!"
    show miyuki e7
    mc "Тітка, веди себе добре."
    s ce "Звісно!"
    s oe neut "Почекайте щ- {nw}"
    mc "Ось так краще. Добре, я скоро повернуся."
    #textboxless moment or something
    window hide dissolve
    pause(1.5)
    s happ "Не переймайся за тата, він просто трохи буркотливий."
    s "На сьогодні у нас заплановано дуже багато веселощів."
    mm e4 "Так!"
    mm e7 "Працювати тут — це весело."
    s "Звісно."
    s "Не знаю, чому твоєму татові це не подобається."
    mm "Він нудний."
    s ce "Так, саме так."
    s "А ми — ні."
    s oe "Отже, хочеш допомогти тітці перевірити зіпсовані продукти?"
    mm e4 "Звісно!"
    s "Чудово, йди за мною, я покажу, що треба робити."
    mm e7 "Добре."
    #fadeout/fade in
    scene bg grocery with fadehold
    "Добре, мабуть, варто подивитися, чим ці двоє займаються."
    "Все одно вже майже обід."
    "Хм-м-м..."
    nvl clear
    mc_nvl "Мала, одне питання"
    m_nvl "Я на роботі, тільки швидко"
    mc_nvl "Через скільки у тебе обід?"
    m_nvl "Десь за півгодини"
    mc_nvl "Давай зустрінемось на обід?"
    m_nvl "Звісно, є ідеї куди?"
    mc_nvl "Той ресторан біля моєї роботи, який тобі подобається"
    m_nvl "Добре, я зможу зустрітися"
    mc_nvl "Чудово, тоді до зустрічі"
    m_nvl "До зустрічі"

    "Міюкі точно сподобається сюрприз."
    "Та й Сайорі впорається з магазином годинку чи близько того."
    "А тепер я все ж подивлюся, що вони там роблять."

    #different store scene
    scene bg grocery2 with fade
    show miyuki casual at t22
    show sayori work happ cm oe at t21
    mc "Мабуть, тобі дуже нудно, якщо ти на іншому кінці магазину і не дивишся за грошима."
    s anno "Я дивлюсь на товари, не бурчи."
    mc "Що ви взагалі робите?"
    s happ "Насправді, чимало."
    mm "Так, тітка Сайорі навчила мене усякому різному!"
    mc "Наприклад?"
    mm "Вона навчила мене знаходити зіпсовану їжу, підмітати підлогу, робити так, щоб речі на полицях виглядали гарно, як-"
    mc "Сайорі, ти ж знаєш, що мій коментар про дитячу працю був жартом, так?"
    s neut "А що ще нам робити?"
    s "Якщо вона просто стоятиме цілий день, їй швидко стане нудно."
    s happ "А так вона хоча б проводить час зі мною, і ми одна одну розважаємо."
    mc "Тобі весело, Мію?"
    mm e4 "Ага!"
    mm e7 "Допомагати тітці з різними справами дуже весело."
    mc "Ну добре, поки тобі подобається, я не проти."
    mc "Але зараз я все одно мушу тебе зупинити."
    mm b2 m4 "Чому?"
    show miyuki m9
    mc "Бо вже майже обід, і ми підемо їсти."
    mm om "Тоді добре."
    mm "А куди ми підемо?"
    mc "У ресторанчик неподалік."
    mc "Сайорі, ти головна, поки нас немає."
    s "Зрозуміла, бос."
    mc "Не називай мене так, це звучить дивно."
    s "Але ж це правда."
    mc "Так, але це не змінює того, що це звучить дивно."
    s anno "Добре, добре, зрозуміла, [player], тепер задоволений?"
    mc "Так."
    show sayori neut
    mc "Ми повернемося приблизно за годину."
    s happ "Не поспішайте, я впораюся."
    mc "Тоді добре, ходімо, Мію."
    mm "Ходімо, тату."
    #fadeout
    stop music fadeout 1.0

    scene bg altstreetday_snow with fadehold
    show snow
    show miyuki winter at t11
    play music wonderland
    mm e4 "Тату, сніг!"
    mc "Так... Так-так... Зима."
    "Сніг — це відстій."
    "У дитинстві я насолоджувався снігом, але він втратив свою магію ще багато років тому."
    "Втім, краще сніг, ніж мороз. Ну, для мене."
    mm e7 "Можна піти в парк?"
    mc "Боюся, зараз ніколи. Обід не триває вічно."
    mm b2 m4 "Ну добре..."
    show miyuki cm
    mc "Може, завтра, але не обіцяю."
    show miyuki b1
    "Хто знає, що буде далі."
    show miyuki at thide with wipeleft
    hide miyuki
    #miyu offscreen, falling down sound
    mc "Гей! Відійди від замету!"
    mm "Але це весело!"
    mc "Ти ж будеш вся мокра від снігу!"
    mm "І що?"
    mc "А ми йдемо на обід!"
    mc "Піднімайся, будь ласка."
    mm "Добре."
    #show Miyu again, kind of annoyed
    show miyuki winter b3 m4 at t11 with wiperight
    mm e4 "Тату, ти зануда."
    show miyuki m9 e7
    mc "Виховання не завжди може бути веселим, люба."
    mc "Ти ще подякуєш, коли не сидітимеш мокра у ресторані."
    mm m4 "А тітка дозволила б погратися у снігу."
    show miyuki m9
    mc "Тітка й сама б погралася у снігу, так що це не рахується."
    "Клянуся, вона всі свої погані звички переймає від Сайорі."
    mc "Мамі б не сподобалося, як ти валяєшся у снігу перед виходом."
    mm m4 "Але мами зараз тут немає."
    show miyuki m9
    "{i}Це ми ще побачимо.{/i}"
    mc "Це неважливо, моя думка не зміниться."
    mc "А тепер ходімо, ми втрачаємо час."
    mm m4 e4 "Добре-е-е-е-е."
    show miyuki m9
    stop music fadeout 1.0

    #fade out

    scene bg restaurant with fadehold
    show miyuki winter at t11
    play music snowyjazz

    "Так, подивимось, вона вже тут?"
    "Швидко оглянутись і-і-і..."
    "О, ось же вона."
    show miyuki m4 at t22
    show monika forward_casual happ cm oe at t21
    m "Ой, привіт."
    mm m2 e4 "Матусю!"
    show miyuki cm
    m "Привіт, доню."
    mm e7 "А що ти тут робиш?!"
    m ce "Приєднуюсь до вас на обід, ось що!"
    m oe "Ви ж не проти?"
    mm e4 "Звісно, ні!"
    mm e7 "Тато не казав, що ти теж тут будеш."
    mc "Це був сюрприз."
    m ce "Тато просто жартівник."
    mm e4 "Так-так-так."
    m oe "Добре, сідайте, мені треба буде повернутись за годину."
    mm e7 "Я тоді сяду з тобою."
    m "Звісно, доню."
    mc "Як проходить день?"
    m neut "Напружено, але це все через кінець року."
    m happ "Чесно кажучи, я дуже рада, що ти написав мені про обід, мені все одно треба було трохи відпочити від усього цього."
    mc "Завжди до твоїх послуг."
    m ce "А як у вас, міс, як проходить день з татом?"
    show monika oe 
    mm e4 "Дуже класно! Але тато був зайнятий, тому я просто допомагала тітці Сайорі з її роботою."
    m rhip "Справді? Вчить тебе різним робочим хитрощам?"
    mm e7 "Ага! Мабуть, я зможу працювати не гірше за тітку Сайорі."
    m ce rdown "Я впевнена, що зможеш."
    "Я теж впевнений, що зможе."
    "Це не образа Сайорі, просто з її роботою впорається навіть першокласник."
    mc "Може, ти попрацюєш, поки тітка хворіє, хе-хе."
    mm e4 "Я впораюсь!"
    m "Тато просто жартує, Мію."
    m neut "Ну або я принаймні на це сподіваюсь."
    mc "Жартую, звісно, я не змушу нашу доньку працювати."
    show monika happ
    mm e7 m4 "Але мені подобається працювати!"
    show miyuki m9
    mc "Зараз — так, але спробуй працювати постійно."
    mm m4 b3 "Ти мені не дозволиш."
    show miyuki m9
    mc "Вірно, не дозволю."
    show miyuki b1
    m "Любонько, тобі треба думати про школу, а не про роботу."
    mm m4 "Так, я вже й забула про школу."
    show miyuki m9
    "Забула про школу всього за три дні канікул."
    "Одним словом, діти..."
    m ce "Але ти хоча б будеш маленькою помічницею тітки Сайорі до кінця дня."
    mm e4 om "Я обов'язково впораюсь!"
    show miyuki e7
    m oe "Я знаю, звісно, впораєшся."
    m "І після того, як я закінчу роботу, я за тобою заїду, і ми разом підготуємось до Різдвяної вечірки."
    m rhip "Гаразд?"
    show monika rdown
    mm "Дуже добре, мамо."
    mm m4 "Тато теж буде готуватись?"
    show miyuki m9
    m "Це вже у тата питай."
    mc "А чому б і ні?"
    show miyuki cm
    mc "У мене все одно не було можливості зробити багато з підготовки."
    mc "Може, ми подивимось різдвяний фільм чи щось таке."
    mm e4 "Так, з гарячим шоколадом!"
    show miyuki e7
    m rhip "Ну, нам варто спробувати щось цікавіше, ми й так постійно дивимось фільми."
    mc "{i}У мене{/i} ідей немає, тому я б із задоволенням послухав ваші."
    m rdown "Ну, за прогнозом сьогодні цілий день сніг, тому можемо прогулятись пізніше."
    mc "Прогулянка під снігом?"
    mc "Я за."
    mm "Я теж."
    mc "З огляду на твій недавній фокус, я й не здивований."
    m neut "Який фокус?"
    mm back e4 "Ніякий!"
    mc "Міс Міюкі вирішила, що буде смішно стрибнути у замет по дорозі сюди."
    mm e7 neutral "Я не казала, що це було смішно, я казала, що це було весело!"
    m happ "Було весело?"
    mm e4 "Ага!"
    m ce "Тоді решта не має значення."
    "Зрадниця!"
    mm e7 "Дякую, мамо."
    show monika oe
    mc "Так, хвилинку, ти кажеш це лише тому, що її речі не мокрі, бо я вчасно витягнув її із замету."
    m rhip sedu "Добре, що ти відповідальний батько, правда ж?"
    show monika ma
    mc "Я, е-е... ну... так..."
    "Я навіть не можу сперечатись."
    "А вона молодець."
    m rdown happ om "Приємно чути, що нашій доньці дозволяють трохи повеселитись, але нехай тато все одно тримає вухо гостро."
    mm e4 "Так, гарна робота, тату."
    mc "Д... дякую?"
    "Коли тебе дякує твоя ж дитина за те, що ти про неї дбаєш..."
    "Це одна з тих речей, які треба просто перечекати, поки вони не виростуть."
    show miyuki e7
    m "А взагалі, я, скоріше за все, закінчу роботу трохи раніше за тебе, тому заберу її в парк, щоб вона ще трохи погралась у снігу."
    m "Після цього можемо зустрітись вдома."
    mc "Так, добре."
    mc "Так, хвилинку, ми ж ще нічого не замовили!"
    m "Не переймайся, коханий, я замовила на трьох, як тільки прийшла, щоб зекономити час."
    mc "А-а-а..."
    "Я знову почуваюся обдуреним."
    mm "Мамо, що ти замовила?"
    m "Ви з татом поділите піцу, а для себе я замовила великий салат."
    mm e4 "М-м-м!"
    show miyuki e7
    mc "Мама надто добре нас знає."
    m ce "Звісно."
    mc "Але я здивований, що салат так довго готують."
    m oe "Я попросила принести все одразу."
    mc "Тобі не треба було це робити, я ж знаю, тобі ще треба повертатись в офіс і все таке."
    m "Не біда, якщо я на кілька хвилин запізнюсь."
    m ce "Переваги роботи менеджером."
    show monika oe
    mc "А це не зловживання посадою?"
    m curi mb "Хто б казав."
    show monika ma
    mc "...справедливо..."
    show monika happ cm oe
    "Я сам постійно передаю завдання, які не хочу робити."
    "В чужому оці бачиш скалку, а у своєму й колоди не помічаєш."
    "Мабуть, краще просто помовчу і почекаю, поки офіціант принесе їжу."
    #fadeout/fadein
    show miyuki winter at t22
    show monika forward_casual happ cm oe at t21
    mm e4 "Дуже смачно, але я вже наїлася."
    show miyuki e7
    mc "Завжди дивує, скільки в тебе влазить."
    mc "Тітка і про це поділилась секретами?"
    mm e4 b2 "Ні, я просто багато їм, хе-хе-хе."
    show miyuki b1 e7
    m ce "Ну, поки це здебільшого корисна їжа, це навіть добре."
    m oe "Добре, я б дуже хотіла залишитись з вами довше, але, на жаль, мені треба повертатись на роботу."
    mc "Все нормально, побачимось пізніше."
    m "Звісно. Ах так, не переймайся за рахунок, я все оплачу."
    mm "Дякую за обід, мамо."
    m ce "Завжди будь ласка, доню."
    show monika oe
    mc "Так, дякую за обід, кохана."
    show monika ce at h11:
        ease .3 zoom 3.8 yoffset 1900 
    #hug/kiss
    window hide dissolve
    pause 2.0
    show monika at h21:
        ease .5 zoom 1.0 yoffset 0
    #kiss
    m happ oe "Будь-коли."
    mc "Наступного разу обід за мій рахунок."
    m "Буду чекати з нетерпінням."
    m "До зустрічі."
    mm e4 "Бувай, мамо!"
    #fadeout Monika
    show monika at thide
    hide monika
    show miyuki e7 at t11
    mc "Ну що, як думаєш, нам повертатися, подивимось, чи не спалить тітка магазин?"
    mm m4 "Тату, я не думаю, що вона це зробить."
    show miyuki m9
    mc "Ти просто не чула старі історії, тому я не звинувачую тебе, що так думаєш."
    mm m4 "Які історії?"
    show miyuki m9
    mc "Розповім, коли підростеш."
    mc "У будь-якому разі, нам краще повертатися, було б грубо запізнитися тільки через те, що ти зі мною цілий день."
    "Я не з тих батьків, які прикриваються дитиною при кожній нагоді."
    "Їх і так забагато."
    mc "Ходімо."
    mm om "Добре."
    #fadeout
    stop music fadeout 1.0

    #convenience store scene
    scene bg grocery with fadehold
    show miyuki casual at t22
    show sayori work neut cm oe at t21
    play music clubs
    s "Хм-м-м... Є двійки?"
    mm e4 "Ні."
    s happ ce "Шкода."
    s oe "О, я витягнула сімку, скринька!"
    mm e7 "У мене все одно їх більше."
    s "Так, але я наздоганяю."
    mm "Є сімки?"
    s "Так, тримай."
    mm e4 "Ще одна скринька."
    s "Є четвірки?"
    mm e7 "Ні!"
    s laug ce "Шкода, немає четвірок."
    show sayori happ oe
    mm "Є дама?!"
    s nerv ce "...Ну та-а-а-а-а..."
    mm e4 "Так!"
    mm e7 "Більше немає карт, гра закінчена."
    mm e4 "У мене більше скриньок, я виграла!"
    show miyuki e7
    s happ oe "Звісно, виграла, але все одно було весело."
    mm e4 "Так!"
    show miyuki e7
    mc "І якраз вчасно, твоя мама скоро має бути тут."
    "Це, звісно, була дуже дивна версія Скриньки, але їм було весело, тому я й не заперечую."
    s "О, Моніка прийде?"
    mc "Так, вона забере Міюкі в парк ненадовго."
    s "О-о-о, буде весело."
    mm m10 "Угу!"
    mm om "Я б хотіла, щоб ти теж пішла з нами."
    s "Я б із задоволенням, але я працюю, хіба що мій начальник захоче бути добрим?"
    mc "Тобі ж гроші потрібні?"
    s nerv ce "...Ну так, ти правий, хе-хе."
    s happ oe "Вибач, Мію, наступного разу."
    mm "Я сподіваюсь."
    "Секундочку, а як щодо мене?"
    s "Але я впевнена, що ви добре повеселитесь!" #show chad
    show chadmc turned casual happ cm oe at t31
    show sayori at t32
    show miyuki at t33
    "...Що він тут робить так рано?"
    c "Привіт, начальнику!"
    c neut "Привіт, Сайорі, привіт... е-е, міні-начальнику?"
    mc "Це моя донька, так."
    mc "Але, як бачиш, вона дівчинка, і відповідно не «начальник», як ти сказав."
    c happ "Ну і все одно, вона мініатюрна копія тебе."
    mc "Ну-у-у, скоріше, мініатюрна копія Моніки."
    c curi "Моніки?"
    mc "Моєї дружини."
    c neut "О, ну так, це логічно."
    m "Хтось казав моє ім'я?"
    #show Monika
    show chadmc at t41
    show sayori at t42
    show monika forward_winter happ cm oe at t43
    show miyuki at t44
    mm "Мамо, привіт!"
    mc "До речі."
    c happ "О, тепер я чітко бачу схожість!"
    mc "Що, серйозно?"
    c ce "Ну так, хе-хе."
    "Здається, хлопець зовсім не розуміє сарказму."
    m "Приємно офіційно познайомитись."
    c happ "Так, саме так."
    c "Я б сказав, що ти, мабуть, Моніка, але тоді прозвучу дурно."
    "Ти вже давно звучиш дурно."
    m "Приємно офіційно познайомитись."
    c "Так, мені теж, начальник завжди про тебе говорить, і Сайорі теж."
    s "Привіт, Моніка."
    m ce "Привіт, Сайорі, як справи?"
    show monika oe
    s "Все чудово, я провела цілий день з моєю племінницею, було весело."
    m laug ce "Так, щодо цього, я не планувала, щоб мене раптово викликали на роботу, це як сніг на голову."
    show monika happ oe
    s "Ну, це дало мені можливість провести час з маленькою Міюкі, так що дякую!"
    m laug ce "Ну-у-у, будь ласка, мабуть? Е-хе-хе."
    show monika happ oe
    c neut "Викликати на роботу — це відстій, зі мною таке постійно."
    m "Так, безперечно."
    mc "Насправді, я рідко викликаю тебе на роботу."
    c "Справді? А мені здається, часто."
    c ce md "Хм-м-м..."
    mc "Не думай занадто багато, а то голова вибухне."
    c om oe "А ти так можеш?"
    "Чувак..."
    mc "То як пройшла друга половина дня, люба?"
    show chadmc happ
    m neut "Набагато краще за першу, вона насправді пролетіла дуже швидко."
    m happ "Тільки я повернулась з обіду, як вже час забирати малу."
    mm "Це я."
    m "Звісно, ти, моя дорога, а тепер бери своє пальто і все інше — ми йдемо в подорож."
    mm "Добре, мамо." #fadeout Miyuki
    show miyuki at thide
    hide miyuki
    s "А що щодо вечірки, яка наближається?"
    m "Ну, у нас майже все є."
    m "Ми не будемо сильно перейматись щодо декорацій, просто те, що вже маємо."
    m rhip "У нас також буде все необхідне, і закуски, і напої."
    m ce "Звісно, все безалкогольне."
    show chadmc neut
    show monika oe
    s "О-о-о, які закуски?"
    m rdown "Прийдеш і побачиш."
    s neut "Але я не люблю сюрпризи."
    mc "Здається, ти просто хочеш знати, наскільки треба наїстися до вечірки."
    s nerv ce "...Ну, може бути, е-хе-хе..."
    show sayori happ oe
    m "Сайорі, не хвилюйся, у нас не буде нічого такого, що тобі не подобається."
    mc "Це, до речі, неважко зробити."
    s "Так, я не дуже вибаглива."
    mc "І це ще дуже м'яко сказано."
    c "Що це за вечірка, і без алкоголю?"
    mc "Вечірка перед Різдвом, на якій є дитина."
    c lsur "Перед Різдвом? А чому мене не покликали?"
    mc "Бо хтось має тримати магазин відкритим."
    "І тому що я б не запросив тебе, навіть якби ти був останньою людиною на Землі."
    c neut "А ми не можемо просто закритися?"
    mc "Ну, якщо ти пожертвуєш свій денний дохід, щоб покрити виручку, тоді звісно."
    c nerv "Так, мабуть, закриватися — не найкраща ідея."
    c neut "Шкода, я ж головна зірка будь-якої вечірки, ви багато втрачаєте."
    "Я дуже в цьому сумніваюсь."
    m "Може, прийдеш іншим разом."
    c happ ce "Може й так, ха-ха-ха."
    show miyuki winter at t44
    show chadmc oe
    mm "Готова, мамо."
    m ce "Добре, доню."
    m oe "Було приємно познайомитись, Чеде."
    c "І мені теж, жінко-начальнику."
    show monika neut
    "{cps=*0.33}{i}ч є л  т и . . . {/cps}{/i}"
    m happ "...У будь-якому разі, побачимось на вечірці, Сайорі."
    s "Звісно!"
    m "А тебе я побачу значно раніше, коханий."
    #kiss
    show monika ce at h11 zorder 2:
        ease .3 zoom 3.8 yoffset 1900 
    #hug/kiss
    window hide dissolve
    pause 2.0
    show monika at h43:
        ease .5 zoom 1.0 yoffset 0
    mc "Звісно, бережи себе, кохана."
    m ce "Звісно."
    m oe "Всім бувайте."
    mm e4 "Бувай, тітко, бувай, тату, бувай, хлопець, який працює на тата!"
    show miyuki e7
    "Я дуже радий, що вона навіть не запам'ятала його ім'я."
    s "Бувай, Мію, скоро побачимось!"
    c "До зустрічі, маленька жінко-начальнику."
    mc "Господи боже мій..." #tiny writing
    mc "Скоро побачимось, доню, слухай маму."
    s "Так, а то Санта не прийде тебе провідати!"
    mm e4 "Я буду добре себе вести, не хвилюйся!" #fadeout miyu and monika
    show miyuki at thide
    show monika at thide
    hide monika
    hide miyuki
    show chadmc at t21
    show sayori at t22
    mc "Санта точно прийде до неї, вона добре себе вела весь рік."
    s "Я знаю, але сумнів, чи справді добре, ніколи не завадить."
    mc "І справді, я й сам про це думав кілька разів, але за сьогодні я не хвилююсь."
    mc "До того ж, Моніка знає, як з нею ладнати."
    c "Це дуже круто, начальнику."
    mc "Господи, у мене є ім'я, або хоча б називай мене бос."
    c ce "Начальник звучить крутіше."
    mc "...То чому ти так рано прийшов?"
    c oe "Ах так, мало не забув, хе-хе."
    mc "Ну кажи вже."
    c "Я прийшов раніше, щоб попросити, щоб хтось підмінив перші кілька годин моєї зміни."
    mc "А навіщо?"
    c "Мій друг іде на побачення з дуже гарною дівчиною, і попросив підстрахувати на випадок, якщо у неї проблеми з головою."
    s neut "Це не дуже ввічливо."
    c "І не кажи. Уяви, що ти підеш на побачення з хлопцем, у якого проблеми з головою, і він нічого не скаже заздалегідь."
    s "Це не зовсім те, що я мала на увазі."
    "...Ну, мабуть, це категоричне «ні»."
    "Але я все одно хотів, щоб Сайорі пішла додому раніше перед Різдвом, а тут якраз така можливість."
    mc "Сайорі, ти можеш підмінити Чеда на кілька годин його зміни?"
    s "Не можу, у мене прийом після роботи."
    "Ах так, психотерапія."
    "Вона вже не ходить так часто, як раніше, тому я іноді забуваю, що вона ще ходить."
    s "Але навіть якби могла, це поважна причина, щоб пропустити роботу?"
    c "Це допомога другу, це, типу, дуже поважна причина."
    mc "Насправді ні, але ось що я скажу."
    mc "Якщо ти прийдеш раніше перед Різдвом, я підміню перші кілька годин твоєї зміни."
    c "Що, справді?"
    s curi "Що, справді?" #confused
    show sayori neut
    mc "Так."
    c ce "Звучить як угода, начальнику."
    mc "Чудово. І раз ми це вирішили, можеш іти."
    c oe "Ні, мені все одно треба вбити кілька годин."
    mc "Добре, це не пропозиція, це наказ."
    mc "Забирайся звідси, або я скасовую угоду."
    c neut "Скасо... що?"
    mc "Я її відміняю."
    c "Міг би й одразу сказати, не у всіх тут IQ 140."
    "Досить іронічно, що я дізнався це слово тільки від Юрі."
    mc "Добре, сказано — зроблено, тепер йди."
    c "Добре, добре, але все одно дякую."
    mc "Ага, звісно."
    c happ "Тоді до зустрічі, побажайте моєму другу удачі!" #fadeout chad
    show chadmc at thide
    hide chadmc
    show sayori at t11
    mc "Я сподіваюсь, його друг облажається по повній."
    s anno "Це жорстоко."
    mc "Ну так, ну так, звісно."
    s neut "Чому ти взагалі помінявся з ним частиною зміни?"
    mc "Бо ти зможеш побачити Міюкі на кілька годин перед Різдвом."
    mc "Нам треба підготуватись до вечірки."
    mc "І для нас слово «дитина» і слово «метушня» означають одне й те саме."
    s happ "Ах так, майже забула."
    mc "Тільки Міюкі не треба знати, що ти це визнаєш."
    s "Та ні, не сама вечірка, а просто прогулянка перед нею."
    mc "Ось і добре, бо улюблена тітка, яка забула про вечірку — це непростимо."
    s "Цього ніколи не станеться, тож можеш не хвилюватись."
    mc "Я завжди в тебе вірив."
    s anno "Ну звісно."
    s happ "Добре, є щось особливе, що ти б хотів, щоб ми з нею зробили цього дня?"
    mc "На розсуд тітки."
    mc "Прогуляйся з нею, якщо погода гарна, пограй з нею вдома, якщо погана, загалом, усе, що зможеш придумати."
    s "Хм-м, добре."
    s "Я щось придумаю."
    mc "Ну, у тебе є кілька днів."
    mc "А тепер слідкуй за грошима, я подзвоню Моніці і скажу, що повернусь тільки пізно ввечері."
    s "Без проблем!"
    "Блін, Мію, мабуть, засмутиться через це."
    "Знаю, я казав, що ми зробимо сімейні штуки сьогодні ввечері, але, на жаль, треба розставляти пріоритети."
    "Може, якщо пощастить, я зустріну їх, поки вони гуляють ввечері."
    "Скоріше за все, я навіть пропущу вечерю. Блін."
    "Ну добре, я все одно обов'язково щось з ними зроблю ввечері."
    "Це найменше, що я можу пообіцяти." #fadeout
    stop music fadeout 1.0

    scene bg grocery with fadehold
    play music chillvibes

    "..."
    "Ну ж бо, Чеде."
    "Скільки ще триває це кляте побачення?"
    "І на побаченні ж навіть не він сам!"
    "А якби й так, вона б пішла, не витримавши й п'яти хвилин, а я вже був би вдома."
    "Добре хоч Моніка не була дуже засмучена, чого не скажу про Мію."
    "Але я обов'язково виправлюсь. Якось."
    "Вони гуляють вже досить довго, тому якщо цей хлопець з'явиться тут найближчим часом, я зможу написати Моніці, що виходжу."
    show chadmc turned casual happ cm oe at t11
    c "Привіт, начальнику!"
    c "Вибач, що так довго."
    mc "Якраз вчасно. Ти підмінив його чи як?"
    c "Ні, його побачення пройшло чудово."
    c "Мені просто треба було залишитись на випадок, якщо у неї якісь дивні вподобання чи щось таке."
    mc "Дивні вподобання?"
    c "Ну, знаєш, так."
    c "У деяких людей смаки в ліжку досить специфічні."
    mc "...Якщо я правильно зрозумів."
    mc "Ти був відсутній так довго, бо чекав, поки твій друг закінчить займатися сексом?"
    c "Ну, загалом, так."
    mc "...Добре, я тебе залишаю, поки не зробив чогось, про що буду шкодувати."
    c "Окей, але ще раз дякую!"
    mc "Та нема за що." #fadeout

    stop music fadeout 1.0
    scene bg altstreetday_snow with fadehold
    show snow
    show monika forward_winter happ cm oe at t21
    show miyuki winter at t22
    play music wonderland
    "О, а ось і вони."
    "Добре, що вона була недалеко, коли я їй написав."
    "Знаю, вона запропонувала повернутись у магазин, але це означає ще 45 хвилин розмов з Чедом."
    m "Привіт, красунчику."
    mc "Привіт, кохана."
    mm m4 b3 "Тату, чому так довго?"
    show miyuki m9
    "Пу-пу-пуу, вона дуже зла на мене."
    mc "Мію, сонечко, бо тато мав попрацювати замість того хлопця, якого ти бачила раніше..."
    mc "...щоб він підмінив тітку Сайорі перед Різдвом..."
    mc "...щоб вона змогла провести більше часу з тобою."
    "Фух."
    mm b1 m4 "Добре..."
    mm b2 "А зі мною ти не хочеш проводити більше часу?"
    show miyuki m9
    "О, ні, я загнаний у кут."
    m "Звісно, хоче, доню."
    "ШВИДШЕ."
    mc "Так, Мію, просто... ну... Тато і так проводить з тобою весь час, а тітку Сайорі ти бачиш рідко."
    show miyuki b1
    mc "Тому тато зробив їй послугу, щоб вона змогла провести більше часу з тобою перед Різдвом."
    mm m4 "Добре..."
    mm om "Мабуть, ти правий."
    mm e4 "А ще я дуже люблю зустрічатись з тіткою Сайорі."
    mc "Ось бачиш, тепер розумієш?"
    mm e7 m4 "Так, але я все одно хочу, щоб ти більше не приходив додому дуже пізно."
    show miyuki m9
    mc "Я знаю, пробач мене."
    mc "Але ми все ще можемо погуляти, добре?"
    mc "І ми все одно подивимось фільм, коли повернемось."
    mm m4 "Обіцяєш?"
    show miyuki m9
    mc "Звісно."
    mm om "І я вибираю фільм?"
    mc "Звісно, чому б і ні."
    mm "Добре, тату."
    "Фу-у-ух. Ухиляюсь від куль не гірше Нео з Матриці."
    m "Як пройшла решта твого дня?"
    mc "Нудно, майже не було відвідувачів."
    mc "І не змушуй мене навіть починати розмову про те, чому Чед так довго був відсутній."
    "Дурень."
    m neut "Чи хочу я взагалі про це знати?"
    mc "Повір, не хочеш, це було дуже тупо."
    mc "Ну а крім цього, звичайний день і вечір."
    m happ lpoint rhip "Все одно краще, ніж поганий день і вечір." #point
    show miyuki e4 pose
    mc "Це чиста правда." #miyu copy point
    show monika ldown rdown
    mc "Але хоча б завтра у мене вихідний, і перед Різдвом працюю тільки першу половину дня."
    "Я відмовляюсь відкриватись на саме Різдво."
    "Я знаю, що це цілодобовий магазин, але навіть Чед не захоче працювати, так що ні."
    "Власник може обурюватись, але це неваж-"
    mc "Мію, що ти робиш?"
    mm back "Нічого!" #hands snap behind back
    mc "Ти що, повторюєш за своєю мамою?"
    mm "Ні, не повторюю!"
    mc "Так, повторюєш."
    mm pose e7 "Ні! Я використала ліву руку."
    mc "Дурненька."
    mm e4 neutral "Хі-хі-хі."
    m "Вона вчиться цьому у тебе."
    mc "Ти кажеш, що я дурненький?"
    m ma ce "Угу!"
    show monika oe cm
    mm e7 "Ти неймовірно дурненький, тату."
    mc "Справді?"
    mm e4 "Так!"
    mc "Добре, не можу сперечатись з такою логікою, значить, я дурненький."
    mm "Ха-ха-ха!"
    m rhip "Може, він і дурненький, але ми все одно його любимо, правда ж?"
    mm e7 "Так, я люблю тата всім серцем."
    m rdown ce "Як і я."
    show monika oe behind miyuki
    mc "Добре, дівчата, ви змушуєте мене червоніти."
    mc "Я теж вас обох люблю, дуже-дуже сильно."
    mc "Тато щодня дякує Богу, що ви тут і зі мною."
    mm e4 "Обіймашки!"
    show miyuki at h11:
        ease .3 zoom 3.8 yoffset 700 
    #hug/kiss
    window hide dissolve
    pause 2.0
    
    #miyuki hug
    "Цього разу вона хоча б попередила мене."
    "Кожного разу, коли вона стрибає {i}без{/i} попередження, я просто падаю разом з нею."
    mc "Я дуже сильно тебе люблю, моя маленька Мію."
    mm "Я теж тебе люблю, тату!"
    #end hug
    show miyuki at h22:
        ease .5 zoom 1.0 yoffset 0
    mc "Добре, що скажеш, Мію, може, підемо додому і подивимось фільм, який ти вибрала?"
    mm e7 "Звісно!"
    m "Все одно надто прохолодно для довгої прогулянки, тому ідея хороша."
    mc "Веди, Мію, тільки не тікай далеко."
    mm "Добре, я буду поруч."
    "Чесно, мені дуже подобаються моменти, коли ми з сім'єю просто проводимо час разом."
    "Якби тільки ці сімейні моменти були частіше..."
    "Особливо під час свят..."

    #front of house scene
    scene bg house_snow with fade
    show miyuki winter at t22
    show monika forward_winter happ cm oe at t21
    "..."
    mc "Мію, йди в дім і вибери фільм, а я швидко поговорю з мамою."
    mm "Добре, тату."
    mc "Ось мій ключ, просто залиш його у замку."
    mm "Звісно." #fadeout Miyu
    show miyuki at thide
    hide miyuki
    show monika neut at t11
    m "Щось не так?"
    mc "Ну, типу."
    mc "Не знаю, мабуть, я просто занадто багато думаю про різне."
    m "Тебе щось турбує, коханий?"
    mc "Просто... Це погано, що я провів з нею так мало часу під час свят?"
    mc "Ну тобто, ми майже нічого не зробили щодо підготовки до свята, яке вже цього тижня!"
    mc "Звісно, я працюю і все таке, але, може, мені варто було б докласти трохи більше зусиль?"
    mc "Я маю на увазі, я купив ялинку лише за п'ять днів до Різдва."
    show monika happ
    mc "Як батько я кажу, що це безвідповідально." #have monika smile here
    mc "А що, якщо вона образиться на мене за це?"
    mc "Чесно кажучи, не те щоб я цього не заслуговую, просто-"
    m b1b "Е-е-ей, любий, заспокойся."
    mc "..."
    m "Послухай, ти зовсім не безвідповідальний."
    m b1a "Але ти точно занадто багато думаєш, у цьому ти правий."
    mc "...Так, це моя шкідлива звичка."
    m "Знаєш, я заміжня за тобою вже досить багато років, щоб знати, що у більшості випадків це просто необґрунтовано."
    mc "Ну, так, але не цього разу?"
    m rhip ce "Звісно."
    m oe b1b "Те, що у нас не вистачає часу, щоб проводити його з нашою донькою, не робить нас безвідповідальними батьками."
    m rdown "І я кажу «ми», бо ми обидва працюємо, і ми дуже зайняті своєю роботою."
    m "Тож не применшуй себе, це не тільки ти, а ми."
    mc "Я просто відчуваю, що ти проводиш з нею більше часу, ніж я."
    m "І це нормально, виховання — це не якесь змагання."
    m "Вона обожнює час, проведений з тобою, і неважливо, скільки його."
    m rhip "Купили б ми ялинку раніше? Звісно."
    m "Але це не означає, що ти безвідповідальний."
    m rdown "Безвідповідально було б не купити ялинку взагалі, і вигадати якусь дурну відмазку."
    mc "Ну, мабуть."
    mc "Але все одно, мені треба більше часу проводити з нею."
    m neut b1b "Як і мені, але зараз це просто важко."
    m "Ми обидва працюємо, а у неї канікули почались менше тижня тому."
    m "Поєднувати роботу і домашнє життя важко, але ти ж враховуєш, що вона в школі цілий день, кожен будній день?"
    m "Це робить усе набагато складнішим."
    m happ "Але коли у мене є можливість, я проводжу дуже багато часу з нею."
    m "І я знаю, що ти теж."
    mc "А мені іноді так не здається."
    m "Нісенітниця."
    m b1a "Кожного разу, коли ти вдома, і вона приходить до тебе щось з нею зробити, ти ніколи не відмовляєш їй."
    mc "Я б просто так не зробив."
    m rhip ce "Ось саме. Ти чудовий батько, тому перестань так сильно хвилюватись."
    m oe "Ти завжди даруєш їй усмішку, навіть якщо настрій буркотливий."
    mc "...Знаєш, ти завжди знаходиш правильні слова, щоб підбадьорити мене."
    m ce rdown "Що я можу сказати, я просто дуже добре тебе знаю."
    m oe "Ти не лише чудовий батько, а й чудовий чоловік."
    m ce "Чоловік, якого я дуже люблю."
    show monika ce at h11:
        ease .3 zoom 3.8 yoffset 1900 
    #hug/kiss
    window hide dissolve
    pause 2.0
    show monika at h11:
        ease .5 zoom 1.0 yoffset 0
    #kiss
    show monika oe
    mc "Я теж тебе люблю, Моніко."
    m "Якщо це допоможе тобі почуватися краще, ти ж завтра вихідний, так?"
    m "Давай проведемо з нею весь день, вигадаємо щось цікаве."
    m ce "Без хвилювань і відволікань на щось інше."
    show monika oe
    mc "Звучить як чудова ідея."
    m "Так, на мене іноді накочує натхнення."
    mm "Ну ви там скоро? Я вже вибрала фільм!" #offscreen
    m "Ми скоро будемо, доню."
    mm "Добре, але не затримуйтесь!"
    mc "Краще поспішити, ми не хочемо, щоб з'явилась буркотлива Мію."
    m ce "Ні, ми дуже цього не хочемо."
    mc "Дякую, що поговорила зі мною, без тебе це б мене дратувало всю ніч."
    m oe "Без проблем, любий, до твоїх послуг."
    mc "Добре, ходімо тоді, подивимось, який фільм вона нам вибрала."
    stop music fadeout 1.0
    #fadeout









